Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/**
 * \file
 *
 * \brief Component description for USBC
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4L_USBC_COMPONENT_
#define _SAM4L_USBC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USBC */
/* ========================================================================== */
/** \addtogroup SAM4L_USBC USB 2.0 Interface */
/*@{*/

#define REV_USBC                    0x310

/* -------- USBC_UDCON : (USBC Offset: 0x000) (R/W 32) Device General Control Register -------- */
#define USBC_UDCON_OFFSET           0x000        /**< \brief (USBC_UDCON offset) Device General Control Register */
#define USBC_UDCON_RESETVALUE       0x00000100   /**< \brief (USBC_UDCON reset_value) Device General Control Register */

#define USBC_UDCON_UADD_Pos         0            /**< \brief (USBC_UDCON) USB Address */
#define USBC_UDCON_UADD_Msk         (0x7Fu << USBC_UDCON_UADD_Pos)
#define USBC_UDCON_UADD(value)      ((USBC_UDCON_UADD_Msk & ((value) << USBC_UDCON_UADD_Pos)))
#define USBC_UDCON_ADDEN_Pos        7            /**< \brief (USBC_UDCON) Address Enable */
#define USBC_UDCON_ADDEN            (0x1u << USBC_UDCON_ADDEN_Pos)
#define USBC_UDCON_DETACH_Pos       8            /**< \brief (USBC_UDCON) Detach */
#define USBC_UDCON_DETACH           (0x1u << USBC_UDCON_DETACH_Pos)
#define USBC_UDCON_RMWKUP_Pos       9            /**< \brief (USBC_UDCON) Remote Wake-Up */
#define USBC_UDCON_RMWKUP           (0x1u << USBC_UDCON_RMWKUP_Pos)
#define USBC_UDCON_SPDCONF_Pos      10           /**< \brief (USBC_UDCON) Speed configuration */
#define USBC_UDCON_SPDCONF_Msk      (0x3u << USBC_UDCON_SPDCONF_Pos)
#define USBC_UDCON_SPDCONF(value)   ((USBC_UDCON_SPDCONF_Msk & ((value) << USBC_UDCON_SPDCONF_Pos)))
#define USBC_UDCON_LS_Pos           12           /**< \brief (USBC_UDCON) Low Speed Mode Force */
#define USBC_UDCON_LS               (0x1u << USBC_UDCON_LS_Pos)
#define USBC_UDCON_TSTJ_Pos         13           /**< \brief (USBC_UDCON) Test mode J */
#define USBC_UDCON_TSTJ             (0x1u << USBC_UDCON_TSTJ_Pos)
#define USBC_UDCON_TSTK_Pos         14           /**< \brief (USBC_UDCON) Test mode K */
#define USBC_UDCON_TSTK             (0x1u << USBC_UDCON_TSTK_Pos)
#define USBC_UDCON_TSTPCKT_Pos      15           /**< \brief (USBC_UDCON) Test Packet mode */
#define USBC_UDCON_TSTPCKT          (0x1u << USBC_UDCON_TSTPCKT_Pos)
#define USBC_UDCON_OPMODE2_Pos      16           /**< \brief (USBC_UDCON) Specific Operational mode */
#define USBC_UDCON_OPMODE2          (0x1u << USBC_UDCON_OPMODE2_Pos)
#define USBC_UDCON_GNAK_Pos         17           /**< \brief (USBC_UDCON) Global NAK */
#define USBC_UDCON_GNAK             (0x1u << USBC_UDCON_GNAK_Pos)
#define USBC_UDCON_MASK             0x0003FFFFu  /**< \brief (USBC_UDCON) MASK Register */

/* -------- USBC_UDINT : (USBC Offset: 0x004) (R/  32) Device Global Interupt Register -------- */
#define USBC_UDINT_OFFSET           0x004        /**< \brief (USBC_UDINT offset) Device Global Interupt Register */
#define USBC_UDINT_RESETVALUE       0x00000000   /**< \brief (USBC_UDINT reset_value) Device Global Interupt Register */

#define USBC_UDINT_SUSP_Pos         0            /**< \brief (USBC_UDINT) Suspend Interrupt */
#define USBC_UDINT_SUSP             (0x1u << USBC_UDINT_SUSP_Pos)
#define USBC_UDINT_MSOF_Pos         1            /**< \brief (USBC_UDINT) Micro Start of Frame Interrupt */
#define USBC_UDINT_MSOF             (0x1u << USBC_UDINT_MSOF_Pos)
#define USBC_UDINT_SOF_Pos          2            /**< \brief (USBC_UDINT) Start of Frame Interrupt */
#define USBC_UDINT_SOF              (0x1u << USBC_UDINT_SOF_Pos)
#define USBC_UDINT_EORST_Pos        3            /**< \brief (USBC_UDINT) End of Reset Interrupt */
#define USBC_UDINT_EORST            (0x1u << USBC_UDINT_EORST_Pos)
#define USBC_UDINT_WAKEUP_Pos       4            /**< \brief (USBC_UDINT) Wake-Up Interrupt */
#define USBC_UDINT_WAKEUP           (0x1u << USBC_UDINT_WAKEUP_Pos)
#define USBC_UDINT_EORSM_Pos        5            /**< \brief (USBC_UDINT) End Of Resume Interrupt */
#define USBC_UDINT_EORSM            (0x1u << USBC_UDINT_EORSM_Pos)
#define USBC_UDINT_UPRSM_Pos        6            /**< \brief (USBC_UDINT) Upstream Resume Interrupt */
#define USBC_UDINT_UPRSM            (0x1u << USBC_UDINT_UPRSM_Pos)
#define USBC_UDINT_EP0INT_Pos       12           /**< \brief (USBC_UDINT) Endpoint 0 Interrupt */
#define USBC_UDINT_EP0INT           (0x1u << USBC_UDINT_EP0INT_Pos)
#define USBC_UDINT_EP1INT_Pos       13           /**< \brief (USBC_UDINT) Endpoint 1 Interrupt */
#define USBC_UDINT_EP1INT           (0x1u << USBC_UDINT_EP1INT_Pos)
#define USBC_UDINT_EP2INT_Pos       14           /**< \brief (USBC_UDINT) Endpoint 2 Interrupt */
#define USBC_UDINT_EP2INT           (0x1u << USBC_UDINT_EP2INT_Pos)
#define USBC_UDINT_EP3INT_Pos       15           /**< \brief (USBC_UDINT) Endpoint 3 Interrupt */
#define USBC_UDINT_EP3INT           (0x1u << USBC_UDINT_EP3INT_Pos)
#define USBC_UDINT_EP4INT_Pos       16           /**< \brief (USBC_UDINT) Endpoint 4 Interrupt */
#define USBC_UDINT_EP4INT           (0x1u << USBC_UDINT_EP4INT_Pos)
#define USBC_UDINT_EP5INT_Pos       17           /**< \brief (USBC_UDINT) Endpoint 5 Interrupt */
#define USBC_UDINT_EP5INT           (0x1u << USBC_UDINT_EP5INT_Pos)
#define USBC_UDINT_EP6INT_Pos       18           /**< \brief (USBC_UDINT) Endpoint 6 Interrupt */
#define USBC_UDINT_EP6INT           (0x1u << USBC_UDINT_EP6INT_Pos)
#define USBC_UDINT_EP7INT_Pos       19           /**< \brief (USBC_UDINT) Endpoint 7 Interrupt */
#define USBC_UDINT_EP7INT           (0x1u << USBC_UDINT_EP7INT_Pos)
#define USBC_UDINT_MASK             0x000FF07Fu  /**< \brief (USBC_UDINT) MASK Register */

/* -------- USBC_UDINTCLR : (USBC Offset: 0x008) ( /W 32) Device Global Interrupt Clear Register -------- */
#define USBC_UDINTCLR_OFFSET        0x008        /**< \brief (USBC_UDINTCLR offset) Device Global Interrupt Clear Register */
#define USBC_UDINTCLR_RESETVALUE    0x00000000   /**< \brief (USBC_UDINTCLR reset_value) Device Global Interrupt Clear Register */

