Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UDINTCLR_SUSPC_Pos     0            /**< \brief (USBC_UDINTCLR) SUSP Interrupt Clear */
#define USBC_UDINTCLR_SUSPC         (0x1u << USBC_UDINTCLR_SUSPC_Pos)
#define USBC_UDINTCLR_MSOFC_Pos     1            /**< \brief (USBC_UDINTCLR) MSOF Interrupt Clear */
#define USBC_UDINTCLR_MSOFC         (0x1u << USBC_UDINTCLR_MSOFC_Pos)
#define USBC_UDINTCLR_SOFC_Pos      2            /**< \brief (USBC_UDINTCLR) SOF Interrupt Clear */
#define USBC_UDINTCLR_SOFC          (0x1u << USBC_UDINTCLR_SOFC_Pos)
#define USBC_UDINTCLR_EORSTC_Pos    3            /**< \brief (USBC_UDINTCLR) EORST Interrupt Clear */
#define USBC_UDINTCLR_EORSTC        (0x1u << USBC_UDINTCLR_EORSTC_Pos)
#define USBC_UDINTCLR_WAKEUPC_Pos   4            /**< \brief (USBC_UDINTCLR) WAKEUP Interrupt Clear */
#define USBC_UDINTCLR_WAKEUPC       (0x1u << USBC_UDINTCLR_WAKEUPC_Pos)
#define USBC_UDINTCLR_EORSMC_Pos    5            /**< \brief (USBC_UDINTCLR) EORSM Interrupt Clear */
#define USBC_UDINTCLR_EORSMC        (0x1u << USBC_UDINTCLR_EORSMC_Pos)
#define USBC_UDINTCLR_UPRSMC_Pos    6            /**< \brief (USBC_UDINTCLR) UPRSM Interrupt Clear */
#define USBC_UDINTCLR_UPRSMC        (0x1u << USBC_UDINTCLR_UPRSMC_Pos)
#define USBC_UDINTCLR_MASK          0x0000007Fu  /**< \brief (USBC_UDINTCLR) MASK Register */

/* -------- USBC_UDINTSET : (USBC Offset: 0x00C) ( /W 32) Device Global Interrupt Set Regsiter -------- */
#define USBC_UDINTSET_OFFSET        0x00C        /**< \brief (USBC_UDINTSET offset) Device Global Interrupt Set Regsiter */
#define USBC_UDINTSET_RESETVALUE    0x00000000   /**< \brief (USBC_UDINTSET reset_value) Device Global Interrupt Set Regsiter */

#define USBC_UDINTSET_SUSPS_Pos     0            /**< \brief (USBC_UDINTSET) SUSP Interrupt Set */
#define USBC_UDINTSET_SUSPS         (0x1u << USBC_UDINTSET_SUSPS_Pos)
#define USBC_UDINTSET_MSOFS_Pos     1            /**< \brief (USBC_UDINTSET) MSOF Interrupt Set */
#define USBC_UDINTSET_MSOFS         (0x1u << USBC_UDINTSET_MSOFS_Pos)
#define USBC_UDINTSET_SOFS_Pos      2            /**< \brief (USBC_UDINTSET) SOF Interrupt Set */
#define USBC_UDINTSET_SOFS          (0x1u << USBC_UDINTSET_SOFS_Pos)
#define USBC_UDINTSET_EORSTS_Pos    3            /**< \brief (USBC_UDINTSET) EORST Interrupt Set */
#define USBC_UDINTSET_EORSTS        (0x1u << USBC_UDINTSET_EORSTS_Pos)
#define USBC_UDINTSET_WAKEUPS_Pos   4            /**< \brief (USBC_UDINTSET) WAKEUP Interrupt Set */
#define USBC_UDINTSET_WAKEUPS       (0x1u << USBC_UDINTSET_WAKEUPS_Pos)
#define USBC_UDINTSET_EORSMS_Pos    5            /**< \brief (USBC_UDINTSET) EORSM Interrupt Set */
#define USBC_UDINTSET_EORSMS        (0x1u << USBC_UDINTSET_EORSMS_Pos)
#define USBC_UDINTSET_UPRSMS_Pos    6            /**< \brief (USBC_UDINTSET) UPRSM Interrupt Set */
#define USBC_UDINTSET_UPRSMS        (0x1u << USBC_UDINTSET_UPRSMS_Pos)
#define USBC_UDINTSET_MASK          0x0000007Fu  /**< \brief (USBC_UDINTSET) MASK Register */

/* -------- USBC_UDINTE : (USBC Offset: 0x010) (R/  32) Device Global Interrupt Enable Register -------- */
#define USBC_UDINTE_OFFSET          0x010        /**< \brief (USBC_UDINTE offset) Device Global Interrupt Enable Register */
#define USBC_UDINTE_RESETVALUE      0x00000000   /**< \brief (USBC_UDINTE reset_value) Device Global Interrupt Enable Register */

#define USBC_UDINTE_SUSPE_Pos       0            /**< \brief (USBC_UDINTE) SUSP Interrupt Enable */
#define USBC_UDINTE_SUSPE           (0x1u << USBC_UDINTE_SUSPE_Pos)
#define USBC_UDINTE_MSOFE_Pos       1            /**< \brief (USBC_UDINTE) MSOF Interrupt Enable */
#define USBC_UDINTE_MSOFE           (0x1u << USBC_UDINTE_MSOFE_Pos)
#define USBC_UDINTE_SOFE_Pos        2            /**< \brief (USBC_UDINTE) SOF Interrupt Enable */
#define USBC_UDINTE_SOFE            (0x1u << USBC_UDINTE_SOFE_Pos)
#define USBC_UDINTE_EORSTE_Pos      3            /**< \brief (USBC_UDINTE) EORST Interrupt Enable */
#define USBC_UDINTE_EORSTE          (0x1u << USBC_UDINTE_EORSTE_Pos)
#define USBC_UDINTE_WAKEUPE_Pos     4            /**< \brief (USBC_UDINTE) WAKEUP Interrupt Enable */
#define USBC_UDINTE_WAKEUPE         (0x1u << USBC_UDINTE_WAKEUPE_Pos)
#define USBC_UDINTE_EORSME_Pos      5            /**< \brief (USBC_UDINTE) EORSM Interrupt Enable */
#define USBC_UDINTE_EORSME          (0x1u << USBC_UDINTE_EORSME_Pos)
#define USBC_UDINTE_UPRSME_Pos      6            /**< \brief (USBC_UDINTE) UPRSM Interrupt Enable */
#define USBC_UDINTE_UPRSME          (0x1u << USBC_UDINTE_UPRSME_Pos)
#define USBC_UDINTE_EP0INTE_Pos     12           /**< \brief (USBC_UDINTE) EP0INT Interrupt Enable */
#define USBC_UDINTE_EP0INTE         (0x1u << USBC_UDINTE_EP0INTE_Pos)
#define USBC_UDINTE_EP1INTE_Pos     13           /**< \brief (USBC_UDINTE) EP1INT Interrupt Enable */
#define USBC_UDINTE_EP1INTE         (0x1u << USBC_UDINTE_EP1INTE_Pos)
#define USBC_UDINTE_EP2INTE_Pos     14           /**< \brief (USBC_UDINTE) EP2INT Interrupt Enable */
#define USBC_UDINTE_EP2INTE         (0x1u << USBC_UDINTE_EP2INTE_Pos)
#define USBC_UDINTE_EP3INTE_Pos     15           /**< \brief (USBC_UDINTE) EP3INT Interrupt Enable */
#define USBC_UDINTE_EP3INTE         (0x1u << USBC_UDINTE_EP3INTE_Pos)
#define USBC_UDINTE_EP4INTE_Pos     16           /**< \brief (USBC_UDINTE) EP4INT Interrupt Enable */
#define USBC_UDINTE_EP4INTE         (0x1u << USBC_UDINTE_EP4INTE_Pos)
#define USBC_UDINTE_EP5INTE_Pos     17           /**< \brief (USBC_UDINTE) EP5INT Interrupt Enable */
#define USBC_UDINTE_EP5INTE         (0x1u << USBC_UDINTE_EP5INTE_Pos)
#define USBC_UDINTE_EP6INTE_Pos     18           /**< \brief (USBC_UDINTE) EP6INT Interrupt Enable */
#define USBC_UDINTE_EP6INTE         (0x1u << USBC_UDINTE_EP6INTE_Pos)
#define USBC_UDINTE_EP7INTE_Pos     19           /**< \brief (USBC_UDINTE) EP7INT Interrupt Enable */
#define USBC_UDINTE_EP7INTE         (0x1u << USBC_UDINTE_EP7INTE_Pos)
#define USBC_UDINTE_MASK            0x000FF07Fu  /**< \brief (USBC_UDINTE) MASK Register */

/* -------- USBC_UDINTECLR : (USBC Offset: 0x014) ( /W 32) Device Global Interrupt Enable Clear Register -------- */
#define USBC_UDINTECLR_OFFSET       0x014        /**< \brief (USBC_UDINTECLR offset) Device Global Interrupt Enable Clear Register */
#define USBC_UDINTECLR_RESETVALUE   0x00000000   /**< \brief (USBC_UDINTECLR reset_value) Device Global Interrupt Enable Clear Register */

#define USBC_UDINTECLR_SUSPEC_Pos   0            /**< \brief (USBC_UDINTECLR) SUSP Interrupt Enable Clear */
#define USBC_UDINTECLR_SUSPEC       (0x1u << USBC_UDINTECLR_SUSPEC_Pos)
#define USBC_UDINTECLR_MSOFEC_Pos   1            /**< \brief (USBC_UDINTECLR) MSOF Interrupt Enable Clear */
#define USBC_UDINTECLR_MSOFEC       (0x1u << USBC_UDINTECLR_MSOFEC_Pos)
#define USBC_UDINTECLR_SOFEC_Pos    2            /**< \brief (USBC_UDINTECLR) SOF Interrupt Enable Clear */
#define USBC_UDINTECLR_SOFEC        (0x1u << USBC_UDINTECLR_SOFEC_Pos)
#define USBC_UDINTECLR_EORSTEC_Pos  3            /**< \brief (USBC_UDINTECLR) EORST Interrupt Enable Clear */
#define USBC_UDINTECLR_EORSTEC      (0x1u << USBC_UDINTECLR_EORSTEC_Pos)
#define USBC_UDINTECLR_WAKEUPEC_Pos 4            /**< \brief (USBC_UDINTECLR) WAKEUP Interrupt Enable Clear */
#define USBC_UDINTECLR_WAKEUPEC     (0x1u << USBC_UDINTECLR_WAKEUPEC_Pos)
#define USBC_UDINTECLR_EORSMEC_Pos  5            /**< \brief (USBC_UDINTECLR) EORSM Interrupt Enable Clear */
#define USBC_UDINTECLR_EORSMEC      (0x1u << USBC_UDINTECLR_EORSMEC_Pos)
#define USBC_UDINTECLR_UPRSMEC_Pos  6            /**< \brief (USBC_UDINTECLR) UPRSM Interrupt Enable Clear */
#define USBC_UDINTECLR_UPRSMEC      (0x1u << USBC_UDINTECLR_UPRSMEC_Pos)
#define USBC_UDINTECLR_EP0INTEC_Pos 12           /**< \brief (USBC_UDINTECLR) EP0INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP0INTEC     (0x1u << USBC_UDINTECLR_EP0INTEC_Pos)
#define USBC_UDINTECLR_EP1INTEC_Pos 13           /**< \brief (USBC_UDINTECLR) EP1INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP1INTEC     (0x1u << USBC_UDINTECLR_EP1INTEC_Pos)
#define USBC_UDINTECLR_EP2INTEC_Pos 14           /**< \brief (USBC_UDINTECLR) EP2INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP2INTEC     (0x1u << USBC_UDINTECLR_EP2INTEC_Pos)
#define USBC_UDINTECLR_EP3INTEC_Pos 15           /**< \brief (USBC_UDINTECLR) EP3INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP3INTEC     (0x1u << USBC_UDINTECLR_EP3INTEC_Pos)
#define USBC_UDINTECLR_EP4INTEC_Pos 16           /**< \brief (USBC_UDINTECLR) EP4INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP4INTEC     (0x1u << USBC_UDINTECLR_EP4INTEC_Pos)
#define USBC_UDINTECLR_EP5INTEC_Pos 17           /**< \brief (USBC_UDINTECLR) EP5INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP5INTEC     (0x1u << USBC_UDINTECLR_EP5INTEC_Pos)
#define USBC_UDINTECLR_EP6INTEC_Pos 18           /**< \brief (USBC_UDINTECLR) EP6INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP6INTEC     (0x1u << USBC_UDINTECLR_EP6INTEC_Pos)
#define USBC_UDINTECLR_EP7INTEC_Pos 19           /**< \brief (USBC_UDINTECLR) EP7INT Interrupt Enable Clear */
#define USBC_UDINTECLR_EP7INTEC     (0x1u << USBC_UDINTECLR_EP7INTEC_Pos)
#define USBC_UDINTECLR_MASK         0x000FF07Fu  /**< \brief (USBC_UDINTECLR) MASK Register */

