Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UESTA0CLR : (USBC Offset: 0x160) ( /W 32) Endpoint Status Clear Register -------- */
#define USBC_UESTA0CLR_OFFSET       0x160        /**< \brief (USBC_UESTA0CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA0CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA0CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA0CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA0CLR) TXINI Clear */
#define USBC_UESTA0CLR_TXINIC       (0x1u << USBC_UESTA0CLR_TXINIC_Pos)
#define USBC_UESTA0CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA0CLR) RXOUTI Clear */
#define USBC_UESTA0CLR_RXOUTIC      (0x1u << USBC_UESTA0CLR_RXOUTIC_Pos)
#define USBC_UESTA0CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA0CLR) RXSTPI Clear */
#define USBC_UESTA0CLR_RXSTPIC      (0x1u << USBC_UESTA0CLR_RXSTPIC_Pos)
#define USBC_UESTA0CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA0CLR) NAKOUTI Clear */
#define USBC_UESTA0CLR_NAKOUTIC     (0x1u << USBC_UESTA0CLR_NAKOUTIC_Pos)
#define USBC_UESTA0CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA0CLR) NAKINI Clear */
#define USBC_UESTA0CLR_NAKINIC      (0x1u << USBC_UESTA0CLR_NAKINIC_Pos)
#define USBC_UESTA0CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA0CLR) STALLEDI Clear */
#define USBC_UESTA0CLR_STALLEDIC    (0x1u << USBC_UESTA0CLR_STALLEDIC_Pos)
#define USBC_UESTA0CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA0CLR) RAMACERI Clear */
#define USBC_UESTA0CLR_RAMACERIC    (0x1u << USBC_UESTA0CLR_RAMACERIC_Pos)
#define USBC_UESTA0CLR_MASK         0x0000085Fu  /**< \brief (USBC_UESTA0CLR) MASK Register */

/* -------- USBC_UESTA1CLR : (USBC Offset: 0x164) ( /W 32) Endpoint Status Clear Register -------- */
#define USBC_UESTA1CLR_OFFSET       0x164        /**< \brief (USBC_UESTA1CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA1CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA1CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA1CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA1CLR) TXINI Clear */
#define USBC_UESTA1CLR_TXINIC       (0x1u << USBC_UESTA1CLR_TXINIC_Pos)
#define USBC_UESTA1CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA1CLR) RXOUTI Clear */
#define USBC_UESTA1CLR_RXOUTIC      (0x1u << USBC_UESTA1CLR_RXOUTIC_Pos)
#define USBC_UESTA1CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA1CLR) RXSTPI Clear */
#define USBC_UESTA1CLR_RXSTPIC      (0x1u << USBC_UESTA1CLR_RXSTPIC_Pos)
#define USBC_UESTA1CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA1CLR) NAKOUTI Clear */
#define USBC_UESTA1CLR_NAKOUTIC     (0x1u << USBC_UESTA1CLR_NAKOUTIC_Pos)
#define USBC_UESTA1CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA1CLR) NAKINI Clear */
#define USBC_UESTA1CLR_NAKINIC      (0x1u << USBC_UESTA1CLR_NAKINIC_Pos)
#define USBC_UESTA1CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA1CLR) STALLEDI Clear */
#define USBC_UESTA1CLR_STALLEDIC    (0x1u << USBC_UESTA1CLR_STALLEDIC_Pos)
#define USBC_UESTA1CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA1CLR) RAMACERI Clear */
#define USBC_UESTA1CLR_RAMACERIC    (0x1u << USBC_UESTA1CLR_RAMACERIC_Pos)
#define USBC_UESTA1CLR_MASK         0x0000085Fu  /**< \brief (USBC_UESTA1CLR) MASK Register */

/* -------- USBC_UESTA2CLR : (USBC Offset: 0x168) ( /W 32) Endpoint Status Clear Register -------- */
#define USBC_UESTA2CLR_OFFSET       0x168        /**< \brief (USBC_UESTA2CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA2CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA2CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA2CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA2CLR) TXINI Clear */
#define USBC_UESTA2CLR_TXINIC       (0x1u << USBC_UESTA2CLR_TXINIC_Pos)
#define USBC_UESTA2CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA2CLR) RXOUTI Clear */
#define USBC_UESTA2CLR_RXOUTIC      (0x1u << USBC_UESTA2CLR_RXOUTIC_Pos)
#define USBC_UESTA2CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA2CLR) RXSTPI Clear */
#define USBC_UESTA2CLR_RXSTPIC      (0x1u << USBC_UESTA2CLR_RXSTPIC_Pos)
#define USBC_UESTA2CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA2CLR) NAKOUTI Clear */
#define USBC_UESTA2CLR_NAKOUTIC     (0x1u << USBC_UESTA2CLR_NAKOUTIC_Pos)
#define USBC_UESTA2CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA2CLR) NAKINI Clear */
#define USBC_UESTA2CLR_NAKINIC      (0x1u << USBC_UESTA2CLR_NAKINIC_Pos)
#define USBC_UESTA2CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA2CLR) STALLEDI Clear */
#define USBC_UESTA2CLR_STALLEDIC    (0x1u << USBC_UESTA2CLR_STALLEDIC_Pos)
#define USBC_UESTA2CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA2CLR) RAMACERI Clear */
#define USBC_UESTA2CLR_RAMACERIC    (0x1u << USBC_UESTA2CLR_RAMACERIC_Pos)
#define USBC_UESTA2CLR_MASK         0x0000085Fu  /**< \brief (USBC_UESTA2CLR) MASK Register */

/* -------- USBC_UESTA3CLR : (USBC Offset: 0x16C) ( /W 32) Endpoint Status Clear Register -------- */
#define USBC_UESTA3CLR_OFFSET       0x16C        /**< \brief (USBC_UESTA3CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA3CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA3CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA3CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA3CLR) TXINI Clear */
#define USBC_UESTA3CLR_TXINIC       (0x1u << USBC_UESTA3CLR_TXINIC_Pos)
#define USBC_UESTA3CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA3CLR) RXOUTI Clear */
#define USBC_UESTA3CLR_RXOUTIC      (0x1u << USBC_UESTA3CLR_RXOUTIC_Pos)
#define USBC_UESTA3CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA3CLR) RXSTPI Clear */
#define USBC_UESTA3CLR_RXSTPIC      (0x1u << USBC_UESTA3CLR_RXSTPIC_Pos)
#define USBC_UESTA3CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA3CLR) NAKOUTI Clear */
#define USBC_UESTA3CLR_NAKOUTIC     (0x1u << USBC_UESTA3CLR_NAKOUTIC_Pos)
#define USBC_UESTA3CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA3CLR) NAKINI Clear */
#define USBC_UESTA3CLR_NAKINIC      (0x1u << USBC_UESTA3CLR_NAKINIC_Pos)
#define USBC_UESTA3CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA3CLR) STALLEDI Clear */
#define USBC_UESTA3CLR_STALLEDIC    (0x1u << USBC_UESTA3CLR_STALLEDIC_Pos)
#define USBC_UESTA3CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA3CLR) RAMACERI Clear */
#define USBC_UESTA3CLR_RAMACERIC    (0x1u << USBC_UESTA3CLR_RAMACERIC_Pos)
#define USBC_UESTA3CLR_MASK         0x0000085Fu  /**< \brief (USBC_UESTA3CLR) MASK Register */

/* -------- USBC_UESTA4CLR : (USBC Offset: 0x170) ( /W 32) Endpoint Status Clear Register -------- */
#define USBC_UESTA4CLR_OFFSET       0x170        /**< \brief (USBC_UESTA4CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA4CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA4CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA4CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA4CLR) TXINI Clear */
#define USBC_UESTA4CLR_TXINIC       (0x1u << USBC_UESTA4CLR_TXINIC_Pos)
#define USBC_UESTA4CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA4CLR) RXOUTI Clear */
#define USBC_UESTA4CLR_RXOUTIC      (0x1u << USBC_UESTA4CLR_RXOUTIC_Pos)
#define USBC_UESTA4CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA4CLR) RXSTPI Clear */
#define USBC_UESTA4CLR_RXSTPIC      (0x1u << USBC_UESTA4CLR_RXSTPIC_Pos)
#define USBC_UESTA4CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA4CLR) NAKOUTI Clear */
#define USBC_UESTA4CLR_NAKOUTIC     (0x1u << USBC_UESTA4CLR_NAKOUTIC_Pos)
#define USBC_UESTA4CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA4CLR) NAKINI Clear */
#define USBC_UESTA4CLR_NAKINIC      (0x1u << USBC_UESTA4CLR_NAKINIC_Pos)
#define USBC_UESTA4CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA4CLR) STALLEDI Clear */
#define USBC_UESTA4CLR_STALLEDIC    (0x1u << USBC_UESTA4CLR_STALLEDIC_Pos)
#define USBC_UESTA4CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA4CLR) RAMACERI Clear */
#define USBC_UESTA4CLR_RAMACERIC    (0x1u << USBC_UESTA4CLR_RAMACERIC_Pos)
#define USBC_UESTA4CLR_MASK         0x0000085Fu  /**< \brief (USBC_UESTA4CLR) MASK Register */

