Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UESTA1SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA1SET) TXINI Set */
#define USBC_UESTA1SET_TXINIS       (0x1u << USBC_UESTA1SET_TXINIS_Pos)
#define USBC_UESTA1SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA1SET) RXOUTI Set */
#define USBC_UESTA1SET_RXOUTIS      (0x1u << USBC_UESTA1SET_RXOUTIS_Pos)
#define USBC_UESTA1SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA1SET) RXSTPI Set */
#define USBC_UESTA1SET_RXSTPIS      (0x1u << USBC_UESTA1SET_RXSTPIS_Pos)
#define USBC_UESTA1SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA1SET) NAKOUTI Set */
#define USBC_UESTA1SET_NAKOUTIS     (0x1u << USBC_UESTA1SET_NAKOUTIS_Pos)
#define USBC_UESTA1SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA1SET) NAKINI Set */
#define USBC_UESTA1SET_NAKINIS      (0x1u << USBC_UESTA1SET_NAKINIS_Pos)
#define USBC_UESTA1SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA1SET) STALLEDI Set */
#define USBC_UESTA1SET_STALLEDIS    (0x1u << USBC_UESTA1SET_STALLEDIS_Pos)
#define USBC_UESTA1SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA1SET) RAMACERI Set */
#define USBC_UESTA1SET_RAMACERIS    (0x1u << USBC_UESTA1SET_RAMACERIS_Pos)
#define USBC_UESTA1SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA1SET) NBUSYBK Set */
#define USBC_UESTA1SET_NBUSYBKS     (0x1u << USBC_UESTA1SET_NBUSYBKS_Pos)
#define USBC_UESTA1SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA1SET) MASK Register */

/* -------- USBC_UESTA2SET : (USBC Offset: 0x198) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA2SET_OFFSET       0x198        /**< \brief (USBC_UESTA2SET offset) Endpoint Status Set Register */
#define USBC_UESTA2SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA2SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA2SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA2SET) TXINI Set */
#define USBC_UESTA2SET_TXINIS       (0x1u << USBC_UESTA2SET_TXINIS_Pos)
#define USBC_UESTA2SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA2SET) RXOUTI Set */
#define USBC_UESTA2SET_RXOUTIS      (0x1u << USBC_UESTA2SET_RXOUTIS_Pos)
#define USBC_UESTA2SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA2SET) RXSTPI Set */
#define USBC_UESTA2SET_RXSTPIS      (0x1u << USBC_UESTA2SET_RXSTPIS_Pos)
#define USBC_UESTA2SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA2SET) NAKOUTI Set */
#define USBC_UESTA2SET_NAKOUTIS     (0x1u << USBC_UESTA2SET_NAKOUTIS_Pos)
#define USBC_UESTA2SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA2SET) NAKINI Set */
#define USBC_UESTA2SET_NAKINIS      (0x1u << USBC_UESTA2SET_NAKINIS_Pos)
#define USBC_UESTA2SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA2SET) STALLEDI Set */
#define USBC_UESTA2SET_STALLEDIS    (0x1u << USBC_UESTA2SET_STALLEDIS_Pos)
#define USBC_UESTA2SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA2SET) RAMACERI Set */
#define USBC_UESTA2SET_RAMACERIS    (0x1u << USBC_UESTA2SET_RAMACERIS_Pos)
#define USBC_UESTA2SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA2SET) NBUSYBK Set */
#define USBC_UESTA2SET_NBUSYBKS     (0x1u << USBC_UESTA2SET_NBUSYBKS_Pos)
#define USBC_UESTA2SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA2SET) MASK Register */

/* -------- USBC_UESTA3SET : (USBC Offset: 0x19C) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA3SET_OFFSET       0x19C        /**< \brief (USBC_UESTA3SET offset) Endpoint Status Set Register */
#define USBC_UESTA3SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA3SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA3SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA3SET) TXINI Set */
#define USBC_UESTA3SET_TXINIS       (0x1u << USBC_UESTA3SET_TXINIS_Pos)
#define USBC_UESTA3SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA3SET) RXOUTI Set */
#define USBC_UESTA3SET_RXOUTIS      (0x1u << USBC_UESTA3SET_RXOUTIS_Pos)
#define USBC_UESTA3SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA3SET) RXSTPI Set */
#define USBC_UESTA3SET_RXSTPIS      (0x1u << USBC_UESTA3SET_RXSTPIS_Pos)
#define USBC_UESTA3SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA3SET) NAKOUTI Set */
#define USBC_UESTA3SET_NAKOUTIS     (0x1u << USBC_UESTA3SET_NAKOUTIS_Pos)
#define USBC_UESTA3SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA3SET) NAKINI Set */
#define USBC_UESTA3SET_NAKINIS      (0x1u << USBC_UESTA3SET_NAKINIS_Pos)
#define USBC_UESTA3SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA3SET) STALLEDI Set */
#define USBC_UESTA3SET_STALLEDIS    (0x1u << USBC_UESTA3SET_STALLEDIS_Pos)
#define USBC_UESTA3SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA3SET) RAMACERI Set */
#define USBC_UESTA3SET_RAMACERIS    (0x1u << USBC_UESTA3SET_RAMACERIS_Pos)
#define USBC_UESTA3SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA3SET) NBUSYBK Set */
#define USBC_UESTA3SET_NBUSYBKS     (0x1u << USBC_UESTA3SET_NBUSYBKS_Pos)
#define USBC_UESTA3SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA3SET) MASK Register */

/* -------- USBC_UESTA4SET : (USBC Offset: 0x1A0) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA4SET_OFFSET       0x1A0        /**< \brief (USBC_UESTA4SET offset) Endpoint Status Set Register */
#define USBC_UESTA4SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA4SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA4SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA4SET) TXINI Set */
#define USBC_UESTA4SET_TXINIS       (0x1u << USBC_UESTA4SET_TXINIS_Pos)
#define USBC_UESTA4SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA4SET) RXOUTI Set */
#define USBC_UESTA4SET_RXOUTIS      (0x1u << USBC_UESTA4SET_RXOUTIS_Pos)
#define USBC_UESTA4SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA4SET) RXSTPI Set */
#define USBC_UESTA4SET_RXSTPIS      (0x1u << USBC_UESTA4SET_RXSTPIS_Pos)
#define USBC_UESTA4SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA4SET) NAKOUTI Set */
#define USBC_UESTA4SET_NAKOUTIS     (0x1u << USBC_UESTA4SET_NAKOUTIS_Pos)
#define USBC_UESTA4SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA4SET) NAKINI Set */
#define USBC_UESTA4SET_NAKINIS      (0x1u << USBC_UESTA4SET_NAKINIS_Pos)
#define USBC_UESTA4SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA4SET) STALLEDI Set */
#define USBC_UESTA4SET_STALLEDIS    (0x1u << USBC_UESTA4SET_STALLEDIS_Pos)
#define USBC_UESTA4SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA4SET) RAMACERI Set */
#define USBC_UESTA4SET_RAMACERIS    (0x1u << USBC_UESTA4SET_RAMACERIS_Pos)
#define USBC_UESTA4SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA4SET) NBUSYBK Set */
#define USBC_UESTA4SET_NBUSYBKS     (0x1u << USBC_UESTA4SET_NBUSYBKS_Pos)
#define USBC_UESTA4SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA4SET) MASK Register */

/* -------- USBC_UESTA5SET : (USBC Offset: 0x1A4) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA5SET_OFFSET       0x1A4        /**< \brief (USBC_UESTA5SET offset) Endpoint Status Set Register */
#define USBC_UESTA5SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA5SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA5SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA5SET) TXINI Set */
#define USBC_UESTA5SET_TXINIS       (0x1u << USBC_UESTA5SET_TXINIS_Pos)
#define USBC_UESTA5SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA5SET) RXOUTI Set */
#define USBC_UESTA5SET_RXOUTIS      (0x1u << USBC_UESTA5SET_RXOUTIS_Pos)
#define USBC_UESTA5SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA5SET) RXSTPI Set */
#define USBC_UESTA5SET_RXSTPIS      (0x1u << USBC_UESTA5SET_RXSTPIS_Pos)
#define USBC_UESTA5SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA5SET) NAKOUTI Set */
#define USBC_UESTA5SET_NAKOUTIS     (0x1u << USBC_UESTA5SET_NAKOUTIS_Pos)
#define USBC_UESTA5SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA5SET) NAKINI Set */
#define USBC_UESTA5SET_NAKINIS      (0x1u << USBC_UESTA5SET_NAKINIS_Pos)
#define USBC_UESTA5SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA5SET) STALLEDI Set */
#define USBC_UESTA5SET_STALLEDIS    (0x1u << USBC_UESTA5SET_STALLEDIS_Pos)
#define USBC_UESTA5SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA5SET) RAMACERI Set */
#define USBC_UESTA5SET_RAMACERIS    (0x1u << USBC_UESTA5SET_RAMACERIS_Pos)
#define USBC_UESTA5SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA5SET) NBUSYBK Set */
#define USBC_UESTA5SET_NBUSYBKS     (0x1u << USBC_UESTA5SET_NBUSYBKS_Pos)
#define USBC_UESTA5SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA5SET) MASK Register */

/* -------- USBC_UESTA6SET : (USBC Offset: 0x1A8) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA6SET_OFFSET       0x1A8        /**< \brief (USBC_UESTA6SET offset) Endpoint Status Set Register */
#define USBC_UESTA6SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA6SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA6SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA6SET) TXINI Set */
#define USBC_UESTA6SET_TXINIS       (0x1u << USBC_UESTA6SET_TXINIS_Pos)
#define USBC_UESTA6SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA6SET) RXOUTI Set */
#define USBC_UESTA6SET_RXOUTIS      (0x1u << USBC_UESTA6SET_RXOUTIS_Pos)
#define USBC_UESTA6SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA6SET) RXSTPI Set */
#define USBC_UESTA6SET_RXSTPIS      (0x1u << USBC_UESTA6SET_RXSTPIS_Pos)
#define USBC_UESTA6SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA6SET) NAKOUTI Set */
#define USBC_UESTA6SET_NAKOUTIS     (0x1u << USBC_UESTA6SET_NAKOUTIS_Pos)
#define USBC_UESTA6SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA6SET) NAKINI Set */
#define USBC_UESTA6SET_NAKINIS      (0x1u << USBC_UESTA6SET_NAKINIS_Pos)
#define USBC_UESTA6SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA6SET) STALLEDI Set */
#define USBC_UESTA6SET_STALLEDIS    (0x1u << USBC_UESTA6SET_STALLEDIS_Pos)
#define USBC_UESTA6SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA6SET) RAMACERI Set */
#define USBC_UESTA6SET_RAMACERIS    (0x1u << USBC_UESTA6SET_RAMACERIS_Pos)
#define USBC_UESTA6SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA6SET) NBUSYBK Set */
#define USBC_UESTA6SET_NBUSYBKS     (0x1u << USBC_UESTA6SET_NBUSYBKS_Pos)
#define USBC_UESTA6SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA6SET) MASK Register */

/* -------- USBC_UESTA7SET : (USBC Offset: 0x1AC) ( /W 32) Endpoint Status Set Register -------- */
#define USBC_UESTA7SET_OFFSET       0x1AC        /**< \brief (USBC_UESTA7SET offset) Endpoint Status Set Register */
#define USBC_UESTA7SET_RESETVALUE   0x00000000   /**< \brief (USBC_UESTA7SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA7SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA7SET) TXINI Set */
#define USBC_UESTA7SET_TXINIS       (0x1u << USBC_UESTA7SET_TXINIS_Pos)
#define USBC_UESTA7SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA7SET) RXOUTI Set */
#define USBC_UESTA7SET_RXOUTIS      (0x1u << USBC_UESTA7SET_RXOUTIS_Pos)
#define USBC_UESTA7SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA7SET) RXSTPI Set */
#define USBC_UESTA7SET_RXSTPIS      (0x1u << USBC_UESTA7SET_RXSTPIS_Pos)
#define USBC_UESTA7SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA7SET) NAKOUTI Set */
#define USBC_UESTA7SET_NAKOUTIS     (0x1u << USBC_UESTA7SET_NAKOUTIS_Pos)
#define USBC_UESTA7SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA7SET) NAKINI Set */
#define USBC_UESTA7SET_NAKINIS      (0x1u << USBC_UESTA7SET_NAKINIS_Pos)
#define USBC_UESTA7SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA7SET) STALLEDI Set */
#define USBC_UESTA7SET_STALLEDIS    (0x1u << USBC_UESTA7SET_STALLEDIS_Pos)
#define USBC_UESTA7SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA7SET) RAMACERI Set */
#define USBC_UESTA7SET_RAMACERIS    (0x1u << USBC_UESTA7SET_RAMACERIS_Pos)
#define USBC_UESTA7SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA7SET) NBUSYBK Set */
#define USBC_UESTA7SET_NBUSYBKS     (0x1u << USBC_UESTA7SET_NBUSYBKS_Pos)
#define USBC_UESTA7SET_MASK         0x0000185Fu  /**< \brief (USBC_UESTA7SET) MASK Register */

/* -------- USBC_UECON0 : (USBC Offset: 0x1C0) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON0_OFFSET          0x1C0        /**< \brief (USBC_UECON0 offset) Endpoint Control Register */
#define USBC_UECON0_RESETVALUE      0x00000000   /**< \brief (USBC_UECON0 reset_value) Endpoint Control Register */

#define USBC_UECON0_TXINE_Pos       0            /**< \brief (USBC_UECON0) TXIN Interrupt Enable */
#define USBC_UECON0_TXINE           (0x1u << USBC_UECON0_TXINE_Pos)
#define USBC_UECON0_RXOUTE_Pos      1            /**< \brief (USBC_UECON0) RXOUT Interrupt Enable */
#define USBC_UECON0_RXOUTE          (0x1u << USBC_UECON0_RXOUTE_Pos)
#define USBC_UECON0_RXSTPE_Pos      2            /**< \brief (USBC_UECON0) RXSTP Interrupt Enable */
#define USBC_UECON0_RXSTPE          (0x1u << USBC_UECON0_RXSTPE_Pos)
#define USBC_UECON0_NAKOUTE_Pos     3            /**< \brief (USBC_UECON0) NAKOUT Interrupt Enable */
#define USBC_UECON0_NAKOUTE         (0x1u << USBC_UECON0_NAKOUTE_Pos)
#define USBC_UECON0_NAKINE_Pos      4            /**< \brief (USBC_UECON0) NAKIN Interrupt Enable */
#define USBC_UECON0_NAKINE          (0x1u << USBC_UECON0_NAKINE_Pos)
#define USBC_UECON0_STALLEDE_Pos    6            /**< \brief (USBC_UECON0) STALLED Interrupt Enable */
#define USBC_UECON0_STALLEDE        (0x1u << USBC_UECON0_STALLEDE_Pos)
#define USBC_UECON0_NREPLY_Pos      8            /**< \brief (USBC_UECON0) No Reply */
#define USBC_UECON0_NREPLY          (0x1u << USBC_UECON0_NREPLY_Pos)
#define USBC_UECON0_RAMACERE_Pos    11           /**< \brief (USBC_UECON0) RAMACER Interrupt Enable */
#define USBC_UECON0_RAMACERE        (0x1u << USBC_UECON0_RAMACERE_Pos)
#define USBC_UECON0_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON0) Number of Busy Banks Interrupt Enable */
#define USBC_UECON0_NBUSYBKE        (0x1u << USBC_UECON0_NBUSYBKE_Pos)
#define USBC_UECON0_KILLBK_Pos      13           /**< \brief (USBC_UECON0) Kill IN Bank */
#define USBC_UECON0_KILLBK          (0x1u << USBC_UECON0_KILLBK_Pos)
#define USBC_UECON0_FIFOCON_Pos     14           /**< \brief (USBC_UECON0) FIFO Control */
#define USBC_UECON0_FIFOCON         (0x1u << USBC_UECON0_FIFOCON_Pos)
#define USBC_UECON0_NYETDIS_Pos     17           /**< \brief (USBC_UECON0) NYET token disable */
#define USBC_UECON0_NYETDIS         (0x1u << USBC_UECON0_NYETDIS_Pos)
#define USBC_UECON0_RSTDT_Pos       18           /**< \brief (USBC_UECON0) Reset Data Toggle */
#define USBC_UECON0_RSTDT           (0x1u << USBC_UECON0_RSTDT_Pos)
#define USBC_UECON0_STALLRQ_Pos     19           /**< \brief (USBC_UECON0) STALL Request */
#define USBC_UECON0_STALLRQ         (0x1u << USBC_UECON0_STALLRQ_Pos)
#define USBC_UECON0_BUSY0_Pos       24           /**< \brief (USBC_UECON0) Busy Bank1 Enable */
#define USBC_UECON0_BUSY0           (0x1u << USBC_UECON0_BUSY0_Pos)
#define USBC_UECON0_BUSY1_Pos       25           /**< \brief (USBC_UECON0) Busy Bank0 Enable */
#define USBC_UECON0_BUSY1           (0x1u << USBC_UECON0_BUSY1_Pos)
#define USBC_UECON0_MASK            0x030E795Fu  /**< \brief (USBC_UECON0) MASK Register */

