Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UECON1 : (USBC Offset: 0x1C4) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON1_OFFSET          0x1C4        /**< \brief (USBC_UECON1 offset) Endpoint Control Register */
#define USBC_UECON1_RESETVALUE      0x00000000   /**< \brief (USBC_UECON1 reset_value) Endpoint Control Register */

#define USBC_UECON1_TXINE_Pos       0            /**< \brief (USBC_UECON1) TXIN Interrupt Enable */
#define USBC_UECON1_TXINE           (0x1u << USBC_UECON1_TXINE_Pos)
#define USBC_UECON1_RXOUTE_Pos      1            /**< \brief (USBC_UECON1) RXOUT Interrupt Enable */
#define USBC_UECON1_RXOUTE          (0x1u << USBC_UECON1_RXOUTE_Pos)
#define USBC_UECON1_RXSTPE_Pos      2            /**< \brief (USBC_UECON1) RXSTP Interrupt Enable */
#define USBC_UECON1_RXSTPE          (0x1u << USBC_UECON1_RXSTPE_Pos)
#define USBC_UECON1_NAKOUTE_Pos     3            /**< \brief (USBC_UECON1) NAKOUT Interrupt Enable */
#define USBC_UECON1_NAKOUTE         (0x1u << USBC_UECON1_NAKOUTE_Pos)
#define USBC_UECON1_NAKINE_Pos      4            /**< \brief (USBC_UECON1) NAKIN Interrupt Enable */
#define USBC_UECON1_NAKINE          (0x1u << USBC_UECON1_NAKINE_Pos)
#define USBC_UECON1_STALLEDE_Pos    6            /**< \brief (USBC_UECON1) STALLED Interrupt Enable */
#define USBC_UECON1_STALLEDE        (0x1u << USBC_UECON1_STALLEDE_Pos)
#define USBC_UECON1_NREPLY_Pos      8            /**< \brief (USBC_UECON1) No Reply */
#define USBC_UECON1_NREPLY          (0x1u << USBC_UECON1_NREPLY_Pos)
#define USBC_UECON1_RAMACERE_Pos    11           /**< \brief (USBC_UECON1) RAMACER Interrupt Enable */
#define USBC_UECON1_RAMACERE        (0x1u << USBC_UECON1_RAMACERE_Pos)
#define USBC_UECON1_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON1) Number of Busy Banks Interrupt Enable */
#define USBC_UECON1_NBUSYBKE        (0x1u << USBC_UECON1_NBUSYBKE_Pos)
#define USBC_UECON1_KILLBK_Pos      13           /**< \brief (USBC_UECON1) Kill IN Bank */
#define USBC_UECON1_KILLBK          (0x1u << USBC_UECON1_KILLBK_Pos)
#define USBC_UECON1_FIFOCON_Pos     14           /**< \brief (USBC_UECON1) FIFO Control */
#define USBC_UECON1_FIFOCON         (0x1u << USBC_UECON1_FIFOCON_Pos)
#define USBC_UECON1_NYETDIS_Pos     17           /**< \brief (USBC_UECON1) NYET Token Enable */
#define USBC_UECON1_NYETDIS         (0x1u << USBC_UECON1_NYETDIS_Pos)
#define USBC_UECON1_RSTDT_Pos       18           /**< \brief (USBC_UECON1) Reset Data Toggle */
#define USBC_UECON1_RSTDT           (0x1u << USBC_UECON1_RSTDT_Pos)
#define USBC_UECON1_STALLRQ_Pos     19           /**< \brief (USBC_UECON1) STALL Request */
#define USBC_UECON1_STALLRQ         (0x1u << USBC_UECON1_STALLRQ_Pos)
#define USBC_UECON1_BUSY0_Pos       24           /**< \brief (USBC_UECON1) Busy Bank1 Enable */
#define USBC_UECON1_BUSY0           (0x1u << USBC_UECON1_BUSY0_Pos)
#define USBC_UECON1_BUSY1_Pos       25           /**< \brief (USBC_UECON1) Busy Bank0 Enable */
#define USBC_UECON1_BUSY1           (0x1u << USBC_UECON1_BUSY1_Pos)
#define USBC_UECON1_MASK            0x030E795Fu  /**< \brief (USBC_UECON1) MASK Register */

/* -------- USBC_UECON2 : (USBC Offset: 0x1C8) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON2_OFFSET          0x1C8        /**< \brief (USBC_UECON2 offset) Endpoint Control Register */
#define USBC_UECON2_RESETVALUE      0x00000000   /**< \brief (USBC_UECON2 reset_value) Endpoint Control Register */

#define USBC_UECON2_TXINE_Pos       0            /**< \brief (USBC_UECON2) TXIN Interrupt Enable */
#define USBC_UECON2_TXINE           (0x1u << USBC_UECON2_TXINE_Pos)
#define USBC_UECON2_RXOUTE_Pos      1            /**< \brief (USBC_UECON2) RXOUT Interrupt Enable */
#define USBC_UECON2_RXOUTE          (0x1u << USBC_UECON2_RXOUTE_Pos)
#define USBC_UECON2_RXSTPE_Pos      2            /**< \brief (USBC_UECON2) RXSTP Interrupt Enable */
#define USBC_UECON2_RXSTPE          (0x1u << USBC_UECON2_RXSTPE_Pos)
#define USBC_UECON2_NAKOUTE_Pos     3            /**< \brief (USBC_UECON2) NAKOUT Interrupt Enable */
#define USBC_UECON2_NAKOUTE         (0x1u << USBC_UECON2_NAKOUTE_Pos)
#define USBC_UECON2_NAKINE_Pos      4            /**< \brief (USBC_UECON2) NAKIN Interrupt Enable */
#define USBC_UECON2_NAKINE          (0x1u << USBC_UECON2_NAKINE_Pos)
#define USBC_UECON2_STALLEDE_Pos    6            /**< \brief (USBC_UECON2) STALLED Interrupt Enable */
#define USBC_UECON2_STALLEDE        (0x1u << USBC_UECON2_STALLEDE_Pos)
#define USBC_UECON2_NREPLY_Pos      8            /**< \brief (USBC_UECON2) No Reply */
#define USBC_UECON2_NREPLY          (0x1u << USBC_UECON2_NREPLY_Pos)
#define USBC_UECON2_RAMACERE_Pos    11           /**< \brief (USBC_UECON2) RAMACER Interrupt Enable */
#define USBC_UECON2_RAMACERE        (0x1u << USBC_UECON2_RAMACERE_Pos)
#define USBC_UECON2_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON2) Number of Busy Banks Interrupt Enable */
#define USBC_UECON2_NBUSYBKE        (0x1u << USBC_UECON2_NBUSYBKE_Pos)
#define USBC_UECON2_KILLBK_Pos      13           /**< \brief (USBC_UECON2) Kill IN Bank */
#define USBC_UECON2_KILLBK          (0x1u << USBC_UECON2_KILLBK_Pos)
#define USBC_UECON2_FIFOCON_Pos     14           /**< \brief (USBC_UECON2) FIFO Control */
#define USBC_UECON2_FIFOCON         (0x1u << USBC_UECON2_FIFOCON_Pos)
#define USBC_UECON2_NYETDIS_Pos     17           /**< \brief (USBC_UECON2) NYET Token Enable */
#define USBC_UECON2_NYETDIS         (0x1u << USBC_UECON2_NYETDIS_Pos)
#define USBC_UECON2_RSTDT_Pos       18           /**< \brief (USBC_UECON2) Reset Data Toggle */
#define USBC_UECON2_RSTDT           (0x1u << USBC_UECON2_RSTDT_Pos)
#define USBC_UECON2_STALLRQ_Pos     19           /**< \brief (USBC_UECON2) STALL Request */
#define USBC_UECON2_STALLRQ         (0x1u << USBC_UECON2_STALLRQ_Pos)
#define USBC_UECON2_BUSY0_Pos       24           /**< \brief (USBC_UECON2) Busy Bank1 Enable */
#define USBC_UECON2_BUSY0           (0x1u << USBC_UECON2_BUSY0_Pos)
#define USBC_UECON2_BUSY1_Pos       25           /**< \brief (USBC_UECON2) Busy Bank0 Enable */
#define USBC_UECON2_BUSY1           (0x1u << USBC_UECON2_BUSY1_Pos)
#define USBC_UECON2_MASK            0x030E795Fu  /**< \brief (USBC_UECON2) MASK Register */

/* -------- USBC_UECON3 : (USBC Offset: 0x1CC) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON3_OFFSET          0x1CC        /**< \brief (USBC_UECON3 offset) Endpoint Control Register */
#define USBC_UECON3_RESETVALUE      0x00000000   /**< \brief (USBC_UECON3 reset_value) Endpoint Control Register */

