Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UECON3_TXINE_Pos       0            /**< \brief (USBC_UECON3) TXIN Interrupt Enable */
#define USBC_UECON3_TXINE           (0x1u << USBC_UECON3_TXINE_Pos)
#define USBC_UECON3_RXOUTE_Pos      1            /**< \brief (USBC_UECON3) RXOUT Interrupt Enable */
#define USBC_UECON3_RXOUTE          (0x1u << USBC_UECON3_RXOUTE_Pos)
#define USBC_UECON3_RXSTPE_Pos      2            /**< \brief (USBC_UECON3) RXSTP Interrupt Enable */
#define USBC_UECON3_RXSTPE          (0x1u << USBC_UECON3_RXSTPE_Pos)
#define USBC_UECON3_NAKOUTE_Pos     3            /**< \brief (USBC_UECON3) NAKOUT Interrupt Enable */
#define USBC_UECON3_NAKOUTE         (0x1u << USBC_UECON3_NAKOUTE_Pos)
#define USBC_UECON3_NAKINE_Pos      4            /**< \brief (USBC_UECON3) NAKIN Interrupt Enable */
#define USBC_UECON3_NAKINE          (0x1u << USBC_UECON3_NAKINE_Pos)
#define USBC_UECON3_STALLEDE_Pos    6            /**< \brief (USBC_UECON3) STALLED Interrupt Enable */
#define USBC_UECON3_STALLEDE        (0x1u << USBC_UECON3_STALLEDE_Pos)
#define USBC_UECON3_NREPLY_Pos      8            /**< \brief (USBC_UECON3) No Reply */
#define USBC_UECON3_NREPLY          (0x1u << USBC_UECON3_NREPLY_Pos)
#define USBC_UECON3_RAMACERE_Pos    11           /**< \brief (USBC_UECON3) RAMACER Interrupt Enable */
#define USBC_UECON3_RAMACERE        (0x1u << USBC_UECON3_RAMACERE_Pos)
#define USBC_UECON3_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON3) Number of Busy Banks Interrupt Enable */
#define USBC_UECON3_NBUSYBKE        (0x1u << USBC_UECON3_NBUSYBKE_Pos)
#define USBC_UECON3_KILLBK_Pos      13           /**< \brief (USBC_UECON3) Kill IN Bank */
#define USBC_UECON3_KILLBK          (0x1u << USBC_UECON3_KILLBK_Pos)
#define USBC_UECON3_FIFOCON_Pos     14           /**< \brief (USBC_UECON3) FIFO Control */
#define USBC_UECON3_FIFOCON         (0x1u << USBC_UECON3_FIFOCON_Pos)
#define USBC_UECON3_NYETDIS_Pos     17           /**< \brief (USBC_UECON3) NYET Token Enable */
#define USBC_UECON3_NYETDIS         (0x1u << USBC_UECON3_NYETDIS_Pos)
#define USBC_UECON3_RSTDT_Pos       18           /**< \brief (USBC_UECON3) Reset Data Toggle */
#define USBC_UECON3_RSTDT           (0x1u << USBC_UECON3_RSTDT_Pos)
#define USBC_UECON3_STALLRQ_Pos     19           /**< \brief (USBC_UECON3) STALL Request */
#define USBC_UECON3_STALLRQ         (0x1u << USBC_UECON3_STALLRQ_Pos)
#define USBC_UECON3_BUSY0_Pos       24           /**< \brief (USBC_UECON3) Busy Bank1 Enable */
#define USBC_UECON3_BUSY0           (0x1u << USBC_UECON3_BUSY0_Pos)
#define USBC_UECON3_BUSY1_Pos       25           /**< \brief (USBC_UECON3) Busy Bank0 Enable */
#define USBC_UECON3_BUSY1           (0x1u << USBC_UECON3_BUSY1_Pos)
#define USBC_UECON3_MASK            0x030E795Fu  /**< \brief (USBC_UECON3) MASK Register */

/* -------- USBC_UECON4 : (USBC Offset: 0x1D0) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON4_OFFSET          0x1D0        /**< \brief (USBC_UECON4 offset) Endpoint Control Register */
#define USBC_UECON4_RESETVALUE      0x00000000   /**< \brief (USBC_UECON4 reset_value) Endpoint Control Register */

#define USBC_UECON4_TXINE_Pos       0            /**< \brief (USBC_UECON4) TXIN Interrupt Enable */
#define USBC_UECON4_TXINE           (0x1u << USBC_UECON4_TXINE_Pos)
#define USBC_UECON4_RXOUTE_Pos      1            /**< \brief (USBC_UECON4) RXOUT Interrupt Enable */
#define USBC_UECON4_RXOUTE          (0x1u << USBC_UECON4_RXOUTE_Pos)
#define USBC_UECON4_RXSTPE_Pos      2            /**< \brief (USBC_UECON4) RXSTP Interrupt Enable */
#define USBC_UECON4_RXSTPE          (0x1u << USBC_UECON4_RXSTPE_Pos)
#define USBC_UECON4_NAKOUTE_Pos     3            /**< \brief (USBC_UECON4) NAKOUT Interrupt Enable */
#define USBC_UECON4_NAKOUTE         (0x1u << USBC_UECON4_NAKOUTE_Pos)
#define USBC_UECON4_NAKINE_Pos      4            /**< \brief (USBC_UECON4) NAKIN Interrupt Enable */
#define USBC_UECON4_NAKINE          (0x1u << USBC_UECON4_NAKINE_Pos)
#define USBC_UECON4_STALLEDE_Pos    6            /**< \brief (USBC_UECON4) STALLED Interrupt Enable */
#define USBC_UECON4_STALLEDE        (0x1u << USBC_UECON4_STALLEDE_Pos)
#define USBC_UECON4_NREPLY_Pos      8            /**< \brief (USBC_UECON4) No Reply */
#define USBC_UECON4_NREPLY          (0x1u << USBC_UECON4_NREPLY_Pos)
#define USBC_UECON4_RAMACERE_Pos    11           /**< \brief (USBC_UECON4) RAMACER Interrupt Enable */
#define USBC_UECON4_RAMACERE        (0x1u << USBC_UECON4_RAMACERE_Pos)
#define USBC_UECON4_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON4) Number of Busy Banks Interrupt Enable */
#define USBC_UECON4_NBUSYBKE        (0x1u << USBC_UECON4_NBUSYBKE_Pos)
#define USBC_UECON4_KILLBK_Pos      13           /**< \brief (USBC_UECON4) Kill IN Bank */
#define USBC_UECON4_KILLBK          (0x1u << USBC_UECON4_KILLBK_Pos)
#define USBC_UECON4_FIFOCON_Pos     14           /**< \brief (USBC_UECON4) FIFO Control */
#define USBC_UECON4_FIFOCON         (0x1u << USBC_UECON4_FIFOCON_Pos)
#define USBC_UECON4_NYETDIS_Pos     17           /**< \brief (USBC_UECON4) NYET Token Enable */
#define USBC_UECON4_NYETDIS         (0x1u << USBC_UECON4_NYETDIS_Pos)
#define USBC_UECON4_RSTDT_Pos       18           /**< \brief (USBC_UECON4) Reset Data Toggle */
#define USBC_UECON4_RSTDT           (0x1u << USBC_UECON4_RSTDT_Pos)
#define USBC_UECON4_STALLRQ_Pos     19           /**< \brief (USBC_UECON4) STALL Request */
#define USBC_UECON4_STALLRQ         (0x1u << USBC_UECON4_STALLRQ_Pos)
#define USBC_UECON4_BUSY0_Pos       24           /**< \brief (USBC_UECON4) Busy Bank1 Enable */
#define USBC_UECON4_BUSY0           (0x1u << USBC_UECON4_BUSY0_Pos)
#define USBC_UECON4_BUSY1_Pos       25           /**< \brief (USBC_UECON4) Busy Bank0 Enable */
#define USBC_UECON4_BUSY1           (0x1u << USBC_UECON4_BUSY1_Pos)
#define USBC_UECON4_MASK            0x030E795Fu  /**< \brief (USBC_UECON4) MASK Register */

/* -------- USBC_UECON5 : (USBC Offset: 0x1D4) (R/  32) Endpoint Control Register -------- */
#define USBC_UECON5_OFFSET          0x1D4        /**< \brief (USBC_UECON5 offset) Endpoint Control Register */
#define USBC_UECON5_RESETVALUE      0x00000000   /**< \brief (USBC_UECON5 reset_value) Endpoint Control Register */

