Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UECON3SET_TXINES_Pos   0            /**< \brief (USBC_UECON3SET) TXINE Set */
#define USBC_UECON3SET_TXINES       (0x1u << USBC_UECON3SET_TXINES_Pos)
#define USBC_UECON3SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON3SET) RXOUTE Set */
#define USBC_UECON3SET_RXOUTES      (0x1u << USBC_UECON3SET_RXOUTES_Pos)
#define USBC_UECON3SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON3SET) RXSTPE Set */
#define USBC_UECON3SET_RXSTPES      (0x1u << USBC_UECON3SET_RXSTPES_Pos)
#define USBC_UECON3SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON3SET) NAKOUTE Set */
#define USBC_UECON3SET_NAKOUTES     (0x1u << USBC_UECON3SET_NAKOUTES_Pos)
#define USBC_UECON3SET_NAKINES_Pos  4            /**< \brief (USBC_UECON3SET) NAKINE Set */
#define USBC_UECON3SET_NAKINES      (0x1u << USBC_UECON3SET_NAKINES_Pos)
#define USBC_UECON3SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON3SET) STALLEDE Set */
#define USBC_UECON3SET_STALLEDES    (0x1u << USBC_UECON3SET_STALLEDES_Pos)
#define USBC_UECON3SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON3SET) NREPLY Set */
#define USBC_UECON3SET_NREPLYS      (0x1u << USBC_UECON3SET_NREPLYS_Pos)
#define USBC_UECON3SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON3SET) RAMACERE Set */
#define USBC_UECON3SET_RAMACERES    (0x1u << USBC_UECON3SET_RAMACERES_Pos)
#define USBC_UECON3SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON3SET) NBUSYBKE Set */
#define USBC_UECON3SET_NBUSYBKES    (0x1u << USBC_UECON3SET_NBUSYBKES_Pos)
#define USBC_UECON3SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON3SET) KILLBK Set */
#define USBC_UECON3SET_KILLBKS      (0x1u << USBC_UECON3SET_KILLBKS_Pos)
#define USBC_UECON3SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON3SET) NYETDIS Set */
#define USBC_UECON3SET_NYETDISS     (0x1u << USBC_UECON3SET_NYETDISS_Pos)
#define USBC_UECON3SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON3SET) RSTDT Set */
#define USBC_UECON3SET_RSTDTS       (0x1u << USBC_UECON3SET_RSTDTS_Pos)
#define USBC_UECON3SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON3SET) STALLRQ Set */
#define USBC_UECON3SET_STALLRQS     (0x1u << USBC_UECON3SET_STALLRQS_Pos)
#define USBC_UECON3SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON3SET) BUSY0 Set */
#define USBC_UECON3SET_BUSY0S       (0x1u << USBC_UECON3SET_BUSY0S_Pos)
#define USBC_UECON3SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON3SET) BUSY1 Set */
#define USBC_UECON3SET_BUSY1S       (0x1u << USBC_UECON3SET_BUSY1S_Pos)
#define USBC_UECON3SET_MASK         0x030E395Fu  /**< \brief (USBC_UECON3SET) MASK Register */

/* -------- USBC_UECON4SET : (USBC Offset: 0x200) ( /W 32) Endpoint Control Set Register -------- */
#define USBC_UECON4SET_OFFSET       0x200        /**< \brief (USBC_UECON4SET offset) Endpoint Control Set Register */
#define USBC_UECON4SET_RESETVALUE   0x00000000   /**< \brief (USBC_UECON4SET reset_value) Endpoint Control Set Register */

#define USBC_UECON4SET_TXINES_Pos   0            /**< \brief (USBC_UECON4SET) TXINE Set */
#define USBC_UECON4SET_TXINES       (0x1u << USBC_UECON4SET_TXINES_Pos)
#define USBC_UECON4SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON4SET) RXOUTE Set */
#define USBC_UECON4SET_RXOUTES      (0x1u << USBC_UECON4SET_RXOUTES_Pos)
#define USBC_UECON4SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON4SET) RXSTPE Set */
#define USBC_UECON4SET_RXSTPES      (0x1u << USBC_UECON4SET_RXSTPES_Pos)
#define USBC_UECON4SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON4SET) NAKOUTE Set */
#define USBC_UECON4SET_NAKOUTES     (0x1u << USBC_UECON4SET_NAKOUTES_Pos)
#define USBC_UECON4SET_NAKINES_Pos  4            /**< \brief (USBC_UECON4SET) NAKINE Set */
#define USBC_UECON4SET_NAKINES      (0x1u << USBC_UECON4SET_NAKINES_Pos)
#define USBC_UECON4SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON4SET) STALLEDE Set */
#define USBC_UECON4SET_STALLEDES    (0x1u << USBC_UECON4SET_STALLEDES_Pos)
#define USBC_UECON4SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON4SET) NREPLY Set */
#define USBC_UECON4SET_NREPLYS      (0x1u << USBC_UECON4SET_NREPLYS_Pos)
#define USBC_UECON4SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON4SET) RAMACERE Set */
#define USBC_UECON4SET_RAMACERES    (0x1u << USBC_UECON4SET_RAMACERES_Pos)
#define USBC_UECON4SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON4SET) NBUSYBKE Set */
#define USBC_UECON4SET_NBUSYBKES    (0x1u << USBC_UECON4SET_NBUSYBKES_Pos)
#define USBC_UECON4SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON4SET) KILLBK Set */
#define USBC_UECON4SET_KILLBKS      (0x1u << USBC_UECON4SET_KILLBKS_Pos)
#define USBC_UECON4SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON4SET) NYETDIS Set */
#define USBC_UECON4SET_NYETDISS     (0x1u << USBC_UECON4SET_NYETDISS_Pos)
#define USBC_UECON4SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON4SET) RSTDT Set */
#define USBC_UECON4SET_RSTDTS       (0x1u << USBC_UECON4SET_RSTDTS_Pos)
#define USBC_UECON4SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON4SET) STALLRQ Set */
#define USBC_UECON4SET_STALLRQS     (0x1u << USBC_UECON4SET_STALLRQS_Pos)
#define USBC_UECON4SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON4SET) BUSY0 Set */
#define USBC_UECON4SET_BUSY0S       (0x1u << USBC_UECON4SET_BUSY0S_Pos)
#define USBC_UECON4SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON4SET) BUSY1 Set */
#define USBC_UECON4SET_BUSY1S       (0x1u << USBC_UECON4SET_BUSY1S_Pos)
#define USBC_UECON4SET_MASK         0x030E395Fu  /**< \brief (USBC_UECON4SET) MASK Register */

/* -------- USBC_UECON5SET : (USBC Offset: 0x204) ( /W 32) Endpoint Control Set Register -------- */
#define USBC_UECON5SET_OFFSET       0x204        /**< \brief (USBC_UECON5SET offset) Endpoint Control Set Register */
#define USBC_UECON5SET_RESETVALUE   0x00000000   /**< \brief (USBC_UECON5SET reset_value) Endpoint Control Set Register */

#define USBC_UECON5SET_TXINES_Pos   0            /**< \brief (USBC_UECON5SET) TXINE Set */
#define USBC_UECON5SET_TXINES       (0x1u << USBC_UECON5SET_TXINES_Pos)
#define USBC_UECON5SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON5SET) RXOUTE Set */
#define USBC_UECON5SET_RXOUTES      (0x1u << USBC_UECON5SET_RXOUTES_Pos)
#define USBC_UECON5SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON5SET) RXSTPE Set */
#define USBC_UECON5SET_RXSTPES      (0x1u << USBC_UECON5SET_RXSTPES_Pos)
#define USBC_UECON5SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON5SET) NAKOUTE Set */
#define USBC_UECON5SET_NAKOUTES     (0x1u << USBC_UECON5SET_NAKOUTES_Pos)
#define USBC_UECON5SET_NAKINES_Pos  4            /**< \brief (USBC_UECON5SET) NAKINE Set */
#define USBC_UECON5SET_NAKINES      (0x1u << USBC_UECON5SET_NAKINES_Pos)
#define USBC_UECON5SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON5SET) STALLEDE Set */
#define USBC_UECON5SET_STALLEDES    (0x1u << USBC_UECON5SET_STALLEDES_Pos)
#define USBC_UECON5SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON5SET) NREPLY Set */
#define USBC_UECON5SET_NREPLYS      (0x1u << USBC_UECON5SET_NREPLYS_Pos)
#define USBC_UECON5SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON5SET) RAMACERE Set */
#define USBC_UECON5SET_RAMACERES    (0x1u << USBC_UECON5SET_RAMACERES_Pos)
#define USBC_UECON5SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON5SET) NBUSYBKE Set */
#define USBC_UECON5SET_NBUSYBKES    (0x1u << USBC_UECON5SET_NBUSYBKES_Pos)
#define USBC_UECON5SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON5SET) KILLBK Set */
#define USBC_UECON5SET_KILLBKS      (0x1u << USBC_UECON5SET_KILLBKS_Pos)
#define USBC_UECON5SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON5SET) NYETDIS Set */
#define USBC_UECON5SET_NYETDISS     (0x1u << USBC_UECON5SET_NYETDISS_Pos)
#define USBC_UECON5SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON5SET) RSTDT Set */
#define USBC_UECON5SET_RSTDTS       (0x1u << USBC_UECON5SET_RSTDTS_Pos)
#define USBC_UECON5SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON5SET) STALLRQ Set */
#define USBC_UECON5SET_STALLRQS     (0x1u << USBC_UECON5SET_STALLRQS_Pos)
#define USBC_UECON5SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON5SET) BUSY0 Set */
#define USBC_UECON5SET_BUSY0S       (0x1u << USBC_UECON5SET_BUSY0S_Pos)
#define USBC_UECON5SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON5SET) BUSY1 Set */
#define USBC_UECON5SET_BUSY1S       (0x1u << USBC_UECON5SET_BUSY1S_Pos)
#define USBC_UECON5SET_MASK         0x030E395Fu  /**< \brief (USBC_UECON5SET) MASK Register */

/* -------- USBC_UECON6SET : (USBC Offset: 0x208) ( /W 32) Endpoint Control Set Register -------- */
#define USBC_UECON6SET_OFFSET       0x208        /**< \brief (USBC_UECON6SET offset) Endpoint Control Set Register */
#define USBC_UECON6SET_RESETVALUE   0x00000000   /**< \brief (USBC_UECON6SET reset_value) Endpoint Control Set Register */

