Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UECON6SET_TXINES_Pos   0            /**< \brief (USBC_UECON6SET) TXINE Set */
#define USBC_UECON6SET_TXINES       (0x1u << USBC_UECON6SET_TXINES_Pos)
#define USBC_UECON6SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON6SET) RXOUTE Set */
#define USBC_UECON6SET_RXOUTES      (0x1u << USBC_UECON6SET_RXOUTES_Pos)
#define USBC_UECON6SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON6SET) RXSTPE Set */
#define USBC_UECON6SET_RXSTPES      (0x1u << USBC_UECON6SET_RXSTPES_Pos)
#define USBC_UECON6SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON6SET) NAKOUTE Set */
#define USBC_UECON6SET_NAKOUTES     (0x1u << USBC_UECON6SET_NAKOUTES_Pos)
#define USBC_UECON6SET_NAKINES_Pos  4            /**< \brief (USBC_UECON6SET) NAKINE Set */
#define USBC_UECON6SET_NAKINES      (0x1u << USBC_UECON6SET_NAKINES_Pos)
#define USBC_UECON6SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON6SET) STALLEDE Set */
#define USBC_UECON6SET_STALLEDES    (0x1u << USBC_UECON6SET_STALLEDES_Pos)
#define USBC_UECON6SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON6SET) NREPLY Set */
#define USBC_UECON6SET_NREPLYS      (0x1u << USBC_UECON6SET_NREPLYS_Pos)
#define USBC_UECON6SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON6SET) RAMACERE Set */
#define USBC_UECON6SET_RAMACERES    (0x1u << USBC_UECON6SET_RAMACERES_Pos)
#define USBC_UECON6SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON6SET) NBUSYBKE Set */
#define USBC_UECON6SET_NBUSYBKES    (0x1u << USBC_UECON6SET_NBUSYBKES_Pos)
#define USBC_UECON6SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON6SET) KILLBK Set */
#define USBC_UECON6SET_KILLBKS      (0x1u << USBC_UECON6SET_KILLBKS_Pos)
#define USBC_UECON6SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON6SET) NYETDIS Set */
#define USBC_UECON6SET_NYETDISS     (0x1u << USBC_UECON6SET_NYETDISS_Pos)
#define USBC_UECON6SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON6SET) RSTDT Set */
#define USBC_UECON6SET_RSTDTS       (0x1u << USBC_UECON6SET_RSTDTS_Pos)
#define USBC_UECON6SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON6SET) STALLRQ Set */
#define USBC_UECON6SET_STALLRQS     (0x1u << USBC_UECON6SET_STALLRQS_Pos)
#define USBC_UECON6SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON6SET) BUSY0 Set */
#define USBC_UECON6SET_BUSY0S       (0x1u << USBC_UECON6SET_BUSY0S_Pos)
#define USBC_UECON6SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON6SET) BUSY1 Set */
#define USBC_UECON6SET_BUSY1S       (0x1u << USBC_UECON6SET_BUSY1S_Pos)
#define USBC_UECON6SET_MASK         0x030E395Fu  /**< \brief (USBC_UECON6SET) MASK Register */

/* -------- USBC_UECON7SET : (USBC Offset: 0x20C) ( /W 32) Endpoint Control Set Register -------- */
#define USBC_UECON7SET_OFFSET       0x20C        /**< \brief (USBC_UECON7SET offset) Endpoint Control Set Register */
#define USBC_UECON7SET_RESETVALUE   0x00000000   /**< \brief (USBC_UECON7SET reset_value) Endpoint Control Set Register */

#define USBC_UECON7SET_TXINES_Pos   0            /**< \brief (USBC_UECON7SET) TXINE Set */
#define USBC_UECON7SET_TXINES       (0x1u << USBC_UECON7SET_TXINES_Pos)
#define USBC_UECON7SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON7SET) RXOUTE Set */
#define USBC_UECON7SET_RXOUTES      (0x1u << USBC_UECON7SET_RXOUTES_Pos)
#define USBC_UECON7SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON7SET) RXSTPE Set */
#define USBC_UECON7SET_RXSTPES      (0x1u << USBC_UECON7SET_RXSTPES_Pos)
#define USBC_UECON7SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON7SET) NAKOUTE Set */
#define USBC_UECON7SET_NAKOUTES     (0x1u << USBC_UECON7SET_NAKOUTES_Pos)
#define USBC_UECON7SET_NAKINES_Pos  4            /**< \brief (USBC_UECON7SET) NAKINE Set */
#define USBC_UECON7SET_NAKINES      (0x1u << USBC_UECON7SET_NAKINES_Pos)
#define USBC_UECON7SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON7SET) STALLEDE Set */
#define USBC_UECON7SET_STALLEDES    (0x1u << USBC_UECON7SET_STALLEDES_Pos)
#define USBC_UECON7SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON7SET) NREPLY Set */
#define USBC_UECON7SET_NREPLYS      (0x1u << USBC_UECON7SET_NREPLYS_Pos)
#define USBC_UECON7SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON7SET) RAMACERE Set */
#define USBC_UECON7SET_RAMACERES    (0x1u << USBC_UECON7SET_RAMACERES_Pos)
#define USBC_UECON7SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON7SET) NBUSYBKE Set */
#define USBC_UECON7SET_NBUSYBKES    (0x1u << USBC_UECON7SET_NBUSYBKES_Pos)
#define USBC_UECON7SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON7SET) KILLBK Set */
#define USBC_UECON7SET_KILLBKS      (0x1u << USBC_UECON7SET_KILLBKS_Pos)
#define USBC_UECON7SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON7SET) NYETDIS Set */
#define USBC_UECON7SET_NYETDISS     (0x1u << USBC_UECON7SET_NYETDISS_Pos)
#define USBC_UECON7SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON7SET) RSTDT Set */
#define USBC_UECON7SET_RSTDTS       (0x1u << USBC_UECON7SET_RSTDTS_Pos)
#define USBC_UECON7SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON7SET) STALLRQ Set */
#define USBC_UECON7SET_STALLRQS     (0x1u << USBC_UECON7SET_STALLRQS_Pos)
#define USBC_UECON7SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON7SET) BUSY0 Set */
#define USBC_UECON7SET_BUSY0S       (0x1u << USBC_UECON7SET_BUSY0S_Pos)
#define USBC_UECON7SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON7SET) BUSY1 Set */
#define USBC_UECON7SET_BUSY1S       (0x1u << USBC_UECON7SET_BUSY1S_Pos)
#define USBC_UECON7SET_MASK         0x030E395Fu  /**< \brief (USBC_UECON7SET) MASK Register */

/* -------- USBC_UECON0CLR : (USBC Offset: 0x220) ( /W 32) Endpoint Control Clear Register -------- */
#define USBC_UECON0CLR_OFFSET       0x220        /**< \brief (USBC_UECON0CLR offset) Endpoint Control Clear Register */
#define USBC_UECON0CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON0CLR reset_value) Endpoint Control Clear Register */

#define USBC_UECON0CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON0CLR) TXINE Clear */
#define USBC_UECON0CLR_TXINEC       (0x1u << USBC_UECON0CLR_TXINEC_Pos)
#define USBC_UECON0CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON0CLR) RXOUTE Clear */
#define USBC_UECON0CLR_RXOUTEC      (0x1u << USBC_UECON0CLR_RXOUTEC_Pos)
#define USBC_UECON0CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON0CLR) RXSTPE Clear */
#define USBC_UECON0CLR_RXSTPEC      (0x1u << USBC_UECON0CLR_RXSTPEC_Pos)
#define USBC_UECON0CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON0CLR) NAKOUTE Clear */
#define USBC_UECON0CLR_NAKOUTEC     (0x1u << USBC_UECON0CLR_NAKOUTEC_Pos)
#define USBC_UECON0CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON0CLR) NAKINE Clear */
#define USBC_UECON0CLR_NAKINEC      (0x1u << USBC_UECON0CLR_NAKINEC_Pos)
#define USBC_UECON0CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON0CLR) STALLEDE Clear */
#define USBC_UECON0CLR_STALLEDEC    (0x1u << USBC_UECON0CLR_STALLEDEC_Pos)
#define USBC_UECON0CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON0CLR) NREPLY Clear */
#define USBC_UECON0CLR_NREPLYC      (0x1u << USBC_UECON0CLR_NREPLYC_Pos)
#define USBC_UECON0CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON0CLR) RAMACERE Clear */
#define USBC_UECON0CLR_RAMACEREC    (0x1u << USBC_UECON0CLR_RAMACEREC_Pos)
#define USBC_UECON0CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON0CLR) NBUSYBKE Clear */
#define USBC_UECON0CLR_NBUSYBKEC    (0x1u << USBC_UECON0CLR_NBUSYBKEC_Pos)
#define USBC_UECON0CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON0CLR) FIFOCON Clear */
#define USBC_UECON0CLR_FIFOCONC     (0x1u << USBC_UECON0CLR_FIFOCONC_Pos)
#define USBC_UECON0CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON0CLR) NYETDIS Clear */
#define USBC_UECON0CLR_NYETDISC     (0x1u << USBC_UECON0CLR_NYETDISC_Pos)
#define USBC_UECON0CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON0CLR) STALLRQ Clear */
#define USBC_UECON0CLR_STALLRQC     (0x1u << USBC_UECON0CLR_STALLRQC_Pos)
#define USBC_UECON0CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON0CLR) BUSY0 Clear */
#define USBC_UECON0CLR_BUSY0C       (0x1u << USBC_UECON0CLR_BUSY0C_Pos)
#define USBC_UECON0CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON0CLR) BUSY1 Clear */
#define USBC_UECON0CLR_BUSY1C       (0x1u << USBC_UECON0CLR_BUSY1C_Pos)
#define USBC_UECON0CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON0CLR) MASK Register */

