Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UECON1CLR : (USBC Offset: 0x224) ( /W 32) TXINE Clear -------- */
#define USBC_UECON1CLR_OFFSET       0x224        /**< \brief (USBC_UECON1CLR offset) TXINE Clear */
#define USBC_UECON1CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON1CLR reset_value) TXINE Clear */

#define USBC_UECON1CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON1CLR) TXINE Clear */
#define USBC_UECON1CLR_TXINEC       (0x1u << USBC_UECON1CLR_TXINEC_Pos)
#define USBC_UECON1CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_RXOUTEC      (0x1u << USBC_UECON1CLR_RXOUTEC_Pos)
#define USBC_UECON1CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_RXSTPEC      (0x1u << USBC_UECON1CLR_RXSTPEC_Pos)
#define USBC_UECON1CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON1CLR) NAKOUTE Clear */
#define USBC_UECON1CLR_NAKOUTEC     (0x1u << USBC_UECON1CLR_NAKOUTEC_Pos)
#define USBC_UECON1CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON1CLR) NAKINE Clear */
#define USBC_UECON1CLR_NAKINEC      (0x1u << USBC_UECON1CLR_NAKINEC_Pos)
#define USBC_UECON1CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON1CLR) RXSTPE Clear */
#define USBC_UECON1CLR_STALLEDEC    (0x1u << USBC_UECON1CLR_STALLEDEC_Pos)
#define USBC_UECON1CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON1CLR) NREPLY Clear */
#define USBC_UECON1CLR_NREPLYC      (0x1u << USBC_UECON1CLR_NREPLYC_Pos)
#define USBC_UECON1CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON1CLR) RAMACERE Clear */
#define USBC_UECON1CLR_RAMACEREC    (0x1u << USBC_UECON1CLR_RAMACEREC_Pos)
#define USBC_UECON1CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON1CLR) NBUSYBKE Clear */
#define USBC_UECON1CLR_NBUSYBKEC    (0x1u << USBC_UECON1CLR_NBUSYBKEC_Pos)
#define USBC_UECON1CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON1CLR) FIFOCON Clear */
#define USBC_UECON1CLR_FIFOCONC     (0x1u << USBC_UECON1CLR_FIFOCONC_Pos)
#define USBC_UECON1CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON1CLR) NYETDIS Clear */
#define USBC_UECON1CLR_NYETDISC     (0x1u << USBC_UECON1CLR_NYETDISC_Pos)
#define USBC_UECON1CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON1CLR) STALLEDE Clear */
#define USBC_UECON1CLR_STALLRQC     (0x1u << USBC_UECON1CLR_STALLRQC_Pos)
#define USBC_UECON1CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON1CLR) BUSY0 Clear */
#define USBC_UECON1CLR_BUSY0C       (0x1u << USBC_UECON1CLR_BUSY0C_Pos)
#define USBC_UECON1CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON1CLR) BUSY1 Clear */
#define USBC_UECON1CLR_BUSY1C       (0x1u << USBC_UECON1CLR_BUSY1C_Pos)
#define USBC_UECON1CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON1CLR) MASK Register */

/* -------- USBC_UECON2CLR : (USBC Offset: 0x228) ( /W 32) TXINE Clear -------- */
#define USBC_UECON2CLR_OFFSET       0x228        /**< \brief (USBC_UECON2CLR offset) TXINE Clear */
#define USBC_UECON2CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON2CLR reset_value) TXINE Clear */

#define USBC_UECON2CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON2CLR) TXINE Clear */
#define USBC_UECON2CLR_TXINEC       (0x1u << USBC_UECON2CLR_TXINEC_Pos)
#define USBC_UECON2CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON2CLR) RXOUTE Clear */
#define USBC_UECON2CLR_RXOUTEC      (0x1u << USBC_UECON2CLR_RXOUTEC_Pos)
#define USBC_UECON2CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON2CLR) RXOUTE Clear */
#define USBC_UECON2CLR_RXSTPEC      (0x1u << USBC_UECON2CLR_RXSTPEC_Pos)
#define USBC_UECON2CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON2CLR) NAKOUTE Clear */
#define USBC_UECON2CLR_NAKOUTEC     (0x1u << USBC_UECON2CLR_NAKOUTEC_Pos)
#define USBC_UECON2CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON2CLR) NAKINE Clear */
#define USBC_UECON2CLR_NAKINEC      (0x1u << USBC_UECON2CLR_NAKINEC_Pos)
#define USBC_UECON2CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON2CLR) RXSTPE Clear */
#define USBC_UECON2CLR_STALLEDEC    (0x1u << USBC_UECON2CLR_STALLEDEC_Pos)
#define USBC_UECON2CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON2CLR) NREPLY Clear */
#define USBC_UECON2CLR_NREPLYC      (0x1u << USBC_UECON2CLR_NREPLYC_Pos)
#define USBC_UECON2CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON2CLR) RAMACERE Clear */
#define USBC_UECON2CLR_RAMACEREC    (0x1u << USBC_UECON2CLR_RAMACEREC_Pos)
#define USBC_UECON2CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON2CLR) NBUSYBKE Clear */
#define USBC_UECON2CLR_NBUSYBKEC    (0x1u << USBC_UECON2CLR_NBUSYBKEC_Pos)
#define USBC_UECON2CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON2CLR) FIFOCON Clear */
#define USBC_UECON2CLR_FIFOCONC     (0x1u << USBC_UECON2CLR_FIFOCONC_Pos)
#define USBC_UECON2CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON2CLR) NYETDIS Clear */
#define USBC_UECON2CLR_NYETDISC     (0x1u << USBC_UECON2CLR_NYETDISC_Pos)
#define USBC_UECON2CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON2CLR) STALLEDE Clear */
#define USBC_UECON2CLR_STALLRQC     (0x1u << USBC_UECON2CLR_STALLRQC_Pos)
#define USBC_UECON2CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON2CLR) BUSY0 Clear */
#define USBC_UECON2CLR_BUSY0C       (0x1u << USBC_UECON2CLR_BUSY0C_Pos)
#define USBC_UECON2CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON2CLR) BUSY1 Clear */
#define USBC_UECON2CLR_BUSY1C       (0x1u << USBC_UECON2CLR_BUSY1C_Pos)
#define USBC_UECON2CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON2CLR) MASK Register */

/* -------- USBC_UECON3CLR : (USBC Offset: 0x22C) ( /W 32) TXINE Clear -------- */
#define USBC_UECON3CLR_OFFSET       0x22C        /**< \brief (USBC_UECON3CLR offset) TXINE Clear */
#define USBC_UECON3CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON3CLR reset_value) TXINE Clear */

#define USBC_UECON3CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON3CLR) TXINE Clear */
#define USBC_UECON3CLR_TXINEC       (0x1u << USBC_UECON3CLR_TXINEC_Pos)
#define USBC_UECON3CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON3CLR) RXOUTE Clear */
#define USBC_UECON3CLR_RXOUTEC      (0x1u << USBC_UECON3CLR_RXOUTEC_Pos)
#define USBC_UECON3CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON3CLR) RXOUTE Clear */
#define USBC_UECON3CLR_RXSTPEC      (0x1u << USBC_UECON3CLR_RXSTPEC_Pos)
#define USBC_UECON3CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON3CLR) NAKOUTE Clear */
#define USBC_UECON3CLR_NAKOUTEC     (0x1u << USBC_UECON3CLR_NAKOUTEC_Pos)
#define USBC_UECON3CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON3CLR) NAKINE Clear */
#define USBC_UECON3CLR_NAKINEC      (0x1u << USBC_UECON3CLR_NAKINEC_Pos)
#define USBC_UECON3CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON3CLR) RXSTPE Clear */
#define USBC_UECON3CLR_STALLEDEC    (0x1u << USBC_UECON3CLR_STALLEDEC_Pos)
#define USBC_UECON3CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON3CLR) NREPLY Clear */
#define USBC_UECON3CLR_NREPLYC      (0x1u << USBC_UECON3CLR_NREPLYC_Pos)
#define USBC_UECON3CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON3CLR) RAMACERE Clear */
#define USBC_UECON3CLR_RAMACEREC    (0x1u << USBC_UECON3CLR_RAMACEREC_Pos)
#define USBC_UECON3CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON3CLR) NBUSYBKE Clear */
#define USBC_UECON3CLR_NBUSYBKEC    (0x1u << USBC_UECON3CLR_NBUSYBKEC_Pos)
#define USBC_UECON3CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON3CLR) FIFOCON Clear */
#define USBC_UECON3CLR_FIFOCONC     (0x1u << USBC_UECON3CLR_FIFOCONC_Pos)
#define USBC_UECON3CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON3CLR) NYETDIS Clear */
#define USBC_UECON3CLR_NYETDISC     (0x1u << USBC_UECON3CLR_NYETDISC_Pos)
#define USBC_UECON3CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON3CLR) STALLEDE Clear */
#define USBC_UECON3CLR_STALLRQC     (0x1u << USBC_UECON3CLR_STALLRQC_Pos)
#define USBC_UECON3CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON3CLR) BUSY0 Clear */
#define USBC_UECON3CLR_BUSY0C       (0x1u << USBC_UECON3CLR_BUSY0C_Pos)
#define USBC_UECON3CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON3CLR) BUSY1 Clear */
#define USBC_UECON3CLR_BUSY1C       (0x1u << USBC_UECON3CLR_BUSY1C_Pos)
#define USBC_UECON3CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON3CLR) MASK Register */

/* -------- USBC_UECON4CLR : (USBC Offset: 0x230) ( /W 32) TXINE Clear -------- */
#define USBC_UECON4CLR_OFFSET       0x230        /**< \brief (USBC_UECON4CLR offset) TXINE Clear */
#define USBC_UECON4CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON4CLR reset_value) TXINE Clear */

