Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UECON4CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON4CLR) TXINE Clear */
#define USBC_UECON4CLR_TXINEC       (0x1u << USBC_UECON4CLR_TXINEC_Pos)
#define USBC_UECON4CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON4CLR) RXOUTE Clear */
#define USBC_UECON4CLR_RXOUTEC      (0x1u << USBC_UECON4CLR_RXOUTEC_Pos)
#define USBC_UECON4CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON4CLR) RXOUTE Clear */
#define USBC_UECON4CLR_RXSTPEC      (0x1u << USBC_UECON4CLR_RXSTPEC_Pos)
#define USBC_UECON4CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON4CLR) NAKOUTE Clear */
#define USBC_UECON4CLR_NAKOUTEC     (0x1u << USBC_UECON4CLR_NAKOUTEC_Pos)
#define USBC_UECON4CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON4CLR) NAKINE Clear */
#define USBC_UECON4CLR_NAKINEC      (0x1u << USBC_UECON4CLR_NAKINEC_Pos)
#define USBC_UECON4CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON4CLR) RXSTPE Clear */
#define USBC_UECON4CLR_STALLEDEC    (0x1u << USBC_UECON4CLR_STALLEDEC_Pos)
#define USBC_UECON4CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON4CLR) NREPLY Clear */
#define USBC_UECON4CLR_NREPLYC      (0x1u << USBC_UECON4CLR_NREPLYC_Pos)
#define USBC_UECON4CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON4CLR) RAMACERE Clear */
#define USBC_UECON4CLR_RAMACEREC    (0x1u << USBC_UECON4CLR_RAMACEREC_Pos)
#define USBC_UECON4CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON4CLR) NBUSYBKE Clear */
#define USBC_UECON4CLR_NBUSYBKEC    (0x1u << USBC_UECON4CLR_NBUSYBKEC_Pos)
#define USBC_UECON4CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON4CLR) FIFOCON Clear */
#define USBC_UECON4CLR_FIFOCONC     (0x1u << USBC_UECON4CLR_FIFOCONC_Pos)
#define USBC_UECON4CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON4CLR) NYETDIS Clear */
#define USBC_UECON4CLR_NYETDISC     (0x1u << USBC_UECON4CLR_NYETDISC_Pos)
#define USBC_UECON4CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON4CLR) STALLEDE Clear */
#define USBC_UECON4CLR_STALLRQC     (0x1u << USBC_UECON4CLR_STALLRQC_Pos)
#define USBC_UECON4CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON4CLR) BUSY0 Clear */
#define USBC_UECON4CLR_BUSY0C       (0x1u << USBC_UECON4CLR_BUSY0C_Pos)
#define USBC_UECON4CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON4CLR) BUSY1 Clear */
#define USBC_UECON4CLR_BUSY1C       (0x1u << USBC_UECON4CLR_BUSY1C_Pos)
#define USBC_UECON4CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON4CLR) MASK Register */

/* -------- USBC_UECON5CLR : (USBC Offset: 0x234) ( /W 32) TXINE Clear -------- */
#define USBC_UECON5CLR_OFFSET       0x234        /**< \brief (USBC_UECON5CLR offset) TXINE Clear */
#define USBC_UECON5CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON5CLR reset_value) TXINE Clear */

#define USBC_UECON5CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON5CLR) TXINE Clear */
#define USBC_UECON5CLR_TXINEC       (0x1u << USBC_UECON5CLR_TXINEC_Pos)
#define USBC_UECON5CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON5CLR) RXOUTE Clear */
#define USBC_UECON5CLR_RXOUTEC      (0x1u << USBC_UECON5CLR_RXOUTEC_Pos)
#define USBC_UECON5CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON5CLR) RXOUTE Clear */
#define USBC_UECON5CLR_RXSTPEC      (0x1u << USBC_UECON5CLR_RXSTPEC_Pos)
#define USBC_UECON5CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON5CLR) NAKOUTE Clear */
#define USBC_UECON5CLR_NAKOUTEC     (0x1u << USBC_UECON5CLR_NAKOUTEC_Pos)
#define USBC_UECON5CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON5CLR) NAKINE Clear */
#define USBC_UECON5CLR_NAKINEC      (0x1u << USBC_UECON5CLR_NAKINEC_Pos)
#define USBC_UECON5CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON5CLR) RXSTPE Clear */
#define USBC_UECON5CLR_STALLEDEC    (0x1u << USBC_UECON5CLR_STALLEDEC_Pos)
#define USBC_UECON5CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON5CLR) NREPLY Clear */
#define USBC_UECON5CLR_NREPLYC      (0x1u << USBC_UECON5CLR_NREPLYC_Pos)
#define USBC_UECON5CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON5CLR) RAMACERE Clear */
#define USBC_UECON5CLR_RAMACEREC    (0x1u << USBC_UECON5CLR_RAMACEREC_Pos)
#define USBC_UECON5CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON5CLR) NBUSYBKE Clear */
#define USBC_UECON5CLR_NBUSYBKEC    (0x1u << USBC_UECON5CLR_NBUSYBKEC_Pos)
#define USBC_UECON5CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON5CLR) FIFOCON Clear */
#define USBC_UECON5CLR_FIFOCONC     (0x1u << USBC_UECON5CLR_FIFOCONC_Pos)
#define USBC_UECON5CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON5CLR) NYETDIS Clear */
#define USBC_UECON5CLR_NYETDISC     (0x1u << USBC_UECON5CLR_NYETDISC_Pos)
#define USBC_UECON5CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON5CLR) STALLEDE Clear */
#define USBC_UECON5CLR_STALLRQC     (0x1u << USBC_UECON5CLR_STALLRQC_Pos)
#define USBC_UECON5CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON5CLR) BUSY0 Clear */
#define USBC_UECON5CLR_BUSY0C       (0x1u << USBC_UECON5CLR_BUSY0C_Pos)
#define USBC_UECON5CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON5CLR) BUSY1 Clear */
#define USBC_UECON5CLR_BUSY1C       (0x1u << USBC_UECON5CLR_BUSY1C_Pos)
#define USBC_UECON5CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON5CLR) MASK Register */

/* -------- USBC_UECON6CLR : (USBC Offset: 0x238) ( /W 32) TXINE Clear -------- */
#define USBC_UECON6CLR_OFFSET       0x238        /**< \brief (USBC_UECON6CLR offset) TXINE Clear */
#define USBC_UECON6CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON6CLR reset_value) TXINE Clear */

#define USBC_UECON6CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON6CLR) TXINE Clear */
#define USBC_UECON6CLR_TXINEC       (0x1u << USBC_UECON6CLR_TXINEC_Pos)
#define USBC_UECON6CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_RXOUTEC      (0x1u << USBC_UECON6CLR_RXOUTEC_Pos)
#define USBC_UECON6CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_RXSTPEC      (0x1u << USBC_UECON6CLR_RXSTPEC_Pos)
#define USBC_UECON6CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON6CLR) NAKOUTE Clear */
#define USBC_UECON6CLR_NAKOUTEC     (0x1u << USBC_UECON6CLR_NAKOUTEC_Pos)
#define USBC_UECON6CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON6CLR) NAKINE Clear */
#define USBC_UECON6CLR_NAKINEC      (0x1u << USBC_UECON6CLR_NAKINEC_Pos)
#define USBC_UECON6CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON6CLR) RXSTPE Clear */
#define USBC_UECON6CLR_STALLEDEC    (0x1u << USBC_UECON6CLR_STALLEDEC_Pos)
#define USBC_UECON6CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON6CLR) NREPLY Clear */
#define USBC_UECON6CLR_NREPLYC      (0x1u << USBC_UECON6CLR_NREPLYC_Pos)
#define USBC_UECON6CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON6CLR) RAMACERE Clear */
#define USBC_UECON6CLR_RAMACEREC    (0x1u << USBC_UECON6CLR_RAMACEREC_Pos)
#define USBC_UECON6CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON6CLR) NBUSYBKE Clear */
#define USBC_UECON6CLR_NBUSYBKEC    (0x1u << USBC_UECON6CLR_NBUSYBKEC_Pos)
#define USBC_UECON6CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON6CLR) FIFOCON Clear */
#define USBC_UECON6CLR_FIFOCONC     (0x1u << USBC_UECON6CLR_FIFOCONC_Pos)
#define USBC_UECON6CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON6CLR) NYETDIS Clear */
#define USBC_UECON6CLR_NYETDISC     (0x1u << USBC_UECON6CLR_NYETDISC_Pos)
#define USBC_UECON6CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON6CLR) STALLEDE Clear */
#define USBC_UECON6CLR_STALLRQC     (0x1u << USBC_UECON6CLR_STALLRQC_Pos)
#define USBC_UECON6CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON6CLR) BUSY0 Clear */
#define USBC_UECON6CLR_BUSY0C       (0x1u << USBC_UECON6CLR_BUSY0C_Pos)
#define USBC_UECON6CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON6CLR) BUSY1 Clear */
#define USBC_UECON6CLR_BUSY1C       (0x1u << USBC_UECON6CLR_BUSY1C_Pos)
#define USBC_UECON6CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON6CLR) MASK Register */

/* -------- USBC_UECON7CLR : (USBC Offset: 0x23C) ( /W 32) TXINE Clear -------- */
#define USBC_UECON7CLR_OFFSET       0x23C        /**< \brief (USBC_UECON7CLR offset) TXINE Clear */
#define USBC_UECON7CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UECON7CLR reset_value) TXINE Clear */

#define USBC_UECON7CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON7CLR) TXINE Clear */
#define USBC_UECON7CLR_TXINEC       (0x1u << USBC_UECON7CLR_TXINEC_Pos)
#define USBC_UECON7CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_RXOUTEC      (0x1u << USBC_UECON7CLR_RXOUTEC_Pos)
#define USBC_UECON7CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_RXSTPEC      (0x1u << USBC_UECON7CLR_RXSTPEC_Pos)
#define USBC_UECON7CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON7CLR) NAKOUTE Clear */
#define USBC_UECON7CLR_NAKOUTEC     (0x1u << USBC_UECON7CLR_NAKOUTEC_Pos)
#define USBC_UECON7CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON7CLR) NAKINE Clear */
#define USBC_UECON7CLR_NAKINEC      (0x1u << USBC_UECON7CLR_NAKINEC_Pos)
#define USBC_UECON7CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON7CLR) RXSTPE Clear */
#define USBC_UECON7CLR_STALLEDEC    (0x1u << USBC_UECON7CLR_STALLEDEC_Pos)
#define USBC_UECON7CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON7CLR) NREPLY Clear */
#define USBC_UECON7CLR_NREPLYC      (0x1u << USBC_UECON7CLR_NREPLYC_Pos)
#define USBC_UECON7CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON7CLR) RAMACERE Clear */
#define USBC_UECON7CLR_RAMACEREC    (0x1u << USBC_UECON7CLR_RAMACEREC_Pos)
#define USBC_UECON7CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON7CLR) NBUSYBKE Clear */
#define USBC_UECON7CLR_NBUSYBKEC    (0x1u << USBC_UECON7CLR_NBUSYBKEC_Pos)
#define USBC_UECON7CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON7CLR) FIFOCON Clear */
#define USBC_UECON7CLR_FIFOCONC     (0x1u << USBC_UECON7CLR_FIFOCONC_Pos)
#define USBC_UECON7CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON7CLR) NYETDIS Clear */
#define USBC_UECON7CLR_NYETDISC     (0x1u << USBC_UECON7CLR_NYETDISC_Pos)
#define USBC_UECON7CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON7CLR) STALLEDE Clear */
#define USBC_UECON7CLR_STALLRQC     (0x1u << USBC_UECON7CLR_STALLRQC_Pos)
#define USBC_UECON7CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON7CLR) BUSY0 Clear */
#define USBC_UECON7CLR_BUSY0C       (0x1u << USBC_UECON7CLR_BUSY0C_Pos)
#define USBC_UECON7CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON7CLR) BUSY1 Clear */
#define USBC_UECON7CLR_BUSY1C       (0x1u << USBC_UECON7CLR_BUSY1C_Pos)
#define USBC_UECON7CLR_MASK         0x030A595Fu  /**< \brief (USBC_UECON7CLR) MASK Register */

/* -------- USBC_UHCON : (USBC Offset: 0x400) (R/W 32) Host General Control Register -------- */
#define USBC_UHCON_OFFSET           0x400        /**< \brief (USBC_UHCON offset) Host General Control Register */
#define USBC_UHCON_RESETVALUE       0x00000000   /**< \brief (USBC_UHCON reset_value) Host General Control Register */

#define USBC_UHCON_SOFE_Pos         8            /**< \brief (USBC_UHCON) SOF Enable */
#define USBC_UHCON_SOFE             (0x1u << USBC_UHCON_SOFE_Pos)
#define USBC_UHCON_RESET_Pos        9            /**< \brief (USBC_UHCON) Send USB Reset */
#define USBC_UHCON_RESET            (0x1u << USBC_UHCON_RESET_Pos)
#define USBC_UHCON_RESUME_Pos       10           /**< \brief (USBC_UHCON) Send USB Resume */
#define USBC_UHCON_RESUME           (0x1u << USBC_UHCON_RESUME_Pos)
#define USBC_UHCON_SPDCONF_Pos      12           /**< \brief (USBC_UHCON) Speed Configuration */
#define USBC_UHCON_SPDCONF_Msk      (0x3u << USBC_UHCON_SPDCONF_Pos)
#define USBC_UHCON_SPDCONF(value)   ((USBC_UHCON_SPDCONF_Msk & ((value) << USBC_UHCON_SPDCONF_Pos)))
#define USBC_UHCON_TSTJ_Pos         16           /**< \brief (USBC_UHCON) Test J */
#define USBC_UHCON_TSTJ             (0x1u << USBC_UHCON_TSTJ_Pos)
#define USBC_UHCON_TSTK_Pos         17           /**< \brief (USBC_UHCON) Test K */
#define USBC_UHCON_TSTK             (0x1u << USBC_UHCON_TSTK_Pos)
#define USBC_UHCON_MASK             0x00033700u  /**< \brief (USBC_UHCON) MASK Register */

/* -------- USBC_UHINT : (USBC Offset: 0x404) (R/  32) Host Global Interrupt Register -------- */
#define USBC_UHINT_OFFSET           0x404        /**< \brief (USBC_UHINT offset) Host Global Interrupt Register */
#define USBC_UHINT_RESETVALUE       0x00000000   /**< \brief (USBC_UHINT reset_value) Host Global Interrupt Register */

#define USBC_UHINT_DCONNI_Pos       0            /**< \brief (USBC_UHINT) Device Connection Interrupt */
#define USBC_UHINT_DCONNI           (0x1u << USBC_UHINT_DCONNI_Pos)
#define USBC_UHINT_DDISCI_Pos       1            /**< \brief (USBC_UHINT) Device Disconnection Interrupt */
#define USBC_UHINT_DDISCI           (0x1u << USBC_UHINT_DDISCI_Pos)
#define USBC_UHINT_RSTI_Pos         2            /**< \brief (USBC_UHINT) USB Reset Sent Interrupt */
#define USBC_UHINT_RSTI             (0x1u << USBC_UHINT_RSTI_Pos)
#define USBC_UHINT_RSMEDI_Pos       3            /**< \brief (USBC_UHINT) Downstream Resume Sent Interrupt */
#define USBC_UHINT_RSMEDI           (0x1u << USBC_UHINT_RSMEDI_Pos)
#define USBC_UHINT_RXRSMI_Pos       4            /**< \brief (USBC_UHINT) Upstream Resume Received Interrupt */
#define USBC_UHINT_RXRSMI           (0x1u << USBC_UHINT_RXRSMI_Pos)
#define USBC_UHINT_HSOFI_Pos        5            /**< \brief (USBC_UHINT) Host SOF Interrupt */
#define USBC_UHINT_HSOFI            (0x1u << USBC_UHINT_HSOFI_Pos)
#define USBC_UHINT_HWUPI_Pos        6            /**< \brief (USBC_UHINT) Host Wake-Up Interrupt */
#define USBC_UHINT_HWUPI            (0x1u << USBC_UHINT_HWUPI_Pos)
#define USBC_UHINT_P0INT_Pos        8            /**< \brief (USBC_UHINT) Pipe 0 Interrupt */
#define USBC_UHINT_P0INT            (0x1u << USBC_UHINT_P0INT_Pos)
#define USBC_UHINT_P1INT_Pos        9            /**< \brief (USBC_UHINT) Pipe 1 Interrupt */
#define USBC_UHINT_P1INT            (0x1u << USBC_UHINT_P1INT_Pos)
#define USBC_UHINT_P2INT_Pos        10           /**< \brief (USBC_UHINT) Pipe 2 Interrupt */
#define USBC_UHINT_P2INT            (0x1u << USBC_UHINT_P2INT_Pos)
#define USBC_UHINT_P3INT_Pos        11           /**< \brief (USBC_UHINT) Pipe 3 Interrupt */
#define USBC_UHINT_P3INT            (0x1u << USBC_UHINT_P3INT_Pos)
#define USBC_UHINT_P4INT_Pos        12           /**< \brief (USBC_UHINT) Pipe 4 Interrupt */
#define USBC_UHINT_P4INT            (0x1u << USBC_UHINT_P4INT_Pos)
#define USBC_UHINT_P5INT_Pos        13           /**< \brief (USBC_UHINT) Pipe 5 Interrupt */
#define USBC_UHINT_P5INT            (0x1u << USBC_UHINT_P5INT_Pos)
#define USBC_UHINT_P6INT_Pos        14           /**< \brief (USBC_UHINT) Pipe 6 Interrupt */
#define USBC_UHINT_P6INT            (0x1u << USBC_UHINT_P6INT_Pos)
#define USBC_UHINT_MASK             0x00007F7Fu  /**< \brief (USBC_UHINT) MASK Register */

/* -------- USBC_UHINTCLR : (USBC Offset: 0x408) ( /W 32) Host Global Interrrupt Clear Register -------- */
#define USBC_UHINTCLR_OFFSET        0x408        /**< \brief (USBC_UHINTCLR offset) Host Global Interrrupt Clear Register */
#define USBC_UHINTCLR_RESETVALUE    0x00000000   /**< \brief (USBC_UHINTCLR reset_value) Host Global Interrrupt Clear Register */

#define USBC_UHINTCLR_DCONNIC_Pos   0            /**< \brief (USBC_UHINTCLR) DCONNI Clear */
#define USBC_UHINTCLR_DCONNIC       (0x1u << USBC_UHINTCLR_DCONNIC_Pos)
#define USBC_UHINTCLR_DDISCIC_Pos   1            /**< \brief (USBC_UHINTCLR) DDISCI Clear */
#define USBC_UHINTCLR_DDISCIC       (0x1u << USBC_UHINTCLR_DDISCIC_Pos)
#define USBC_UHINTCLR_RSTIC_Pos     2            /**< \brief (USBC_UHINTCLR) RSTI Clear */
#define USBC_UHINTCLR_RSTIC         (0x1u << USBC_UHINTCLR_RSTIC_Pos)
#define USBC_UHINTCLR_RSMEDIC_Pos   3            /**< \brief (USBC_UHINTCLR) RSMEDI Clear */
#define USBC_UHINTCLR_RSMEDIC       (0x1u << USBC_UHINTCLR_RSMEDIC_Pos)
#define USBC_UHINTCLR_RXRSMIC_Pos   4            /**< \brief (USBC_UHINTCLR) RXRSMI Clear */
#define USBC_UHINTCLR_RXRSMIC       (0x1u << USBC_UHINTCLR_RXRSMIC_Pos)
#define USBC_UHINTCLR_HSOFIC_Pos    5            /**< \brief (USBC_UHINTCLR) HSOFI Clear */
#define USBC_UHINTCLR_HSOFIC        (0x1u << USBC_UHINTCLR_HSOFIC_Pos)
#define USBC_UHINTCLR_HWUPIC_Pos    6            /**< \brief (USBC_UHINTCLR) HWUPI Clear */
#define USBC_UHINTCLR_HWUPIC        (0x1u << USBC_UHINTCLR_HWUPIC_Pos)
#define USBC_UHINTCLR_MASK          0x0000007Fu  /**< \brief (USBC_UHINTCLR) MASK Register */

