Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UHINTSET : (USBC Offset: 0x40C) ( /W 32) Host Global Interrupt Set Register -------- */
#define USBC_UHINTSET_OFFSET        0x40C        /**< \brief (USBC_UHINTSET offset) Host Global Interrupt Set Register */
#define USBC_UHINTSET_RESETVALUE    0x00000000   /**< \brief (USBC_UHINTSET reset_value) Host Global Interrupt Set Register */

#define USBC_UHINTSET_DCONNIS_Pos   0            /**< \brief (USBC_UHINTSET) DCONNI Set */
#define USBC_UHINTSET_DCONNIS       (0x1u << USBC_UHINTSET_DCONNIS_Pos)
#define USBC_UHINTSET_DDISCIS_Pos   1            /**< \brief (USBC_UHINTSET) DDISCI Set */
#define USBC_UHINTSET_DDISCIS       (0x1u << USBC_UHINTSET_DDISCIS_Pos)
#define USBC_UHINTSET_RSTIS_Pos     2            /**< \brief (USBC_UHINTSET) RSTI Set */
#define USBC_UHINTSET_RSTIS         (0x1u << USBC_UHINTSET_RSTIS_Pos)
#define USBC_UHINTSET_RSMEDIS_Pos   3            /**< \brief (USBC_UHINTSET) RSMEDI Set */
#define USBC_UHINTSET_RSMEDIS       (0x1u << USBC_UHINTSET_RSMEDIS_Pos)
#define USBC_UHINTSET_RXRSMIS_Pos   4            /**< \brief (USBC_UHINTSET) RXRSMI Set */
#define USBC_UHINTSET_RXRSMIS       (0x1u << USBC_UHINTSET_RXRSMIS_Pos)
#define USBC_UHINTSET_HSOFIS_Pos    5            /**< \brief (USBC_UHINTSET) HSOFI Set */
#define USBC_UHINTSET_HSOFIS        (0x1u << USBC_UHINTSET_HSOFIS_Pos)
#define USBC_UHINTSET_HWUPIS_Pos    6            /**< \brief (USBC_UHINTSET) HWUPI Set */
#define USBC_UHINTSET_HWUPIS        (0x1u << USBC_UHINTSET_HWUPIS_Pos)
#define USBC_UHINTSET_MASK          0x0000007Fu  /**< \brief (USBC_UHINTSET) MASK Register */

/* -------- USBC_UHINTE : (USBC Offset: 0x410) (R/  32) Host Global Interrupt Enable Register -------- */
#define USBC_UHINTE_OFFSET          0x410        /**< \brief (USBC_UHINTE offset) Host Global Interrupt Enable Register */
#define USBC_UHINTE_RESETVALUE      0x00000000   /**< \brief (USBC_UHINTE reset_value) Host Global Interrupt Enable Register */

#define USBC_UHINTE_DCONNIE_Pos     0            /**< \brief (USBC_UHINTE) DCONNI Enable */
#define USBC_UHINTE_DCONNIE         (0x1u << USBC_UHINTE_DCONNIE_Pos)
#define USBC_UHINTE_DDISCIE_Pos     1            /**< \brief (USBC_UHINTE) DDISCI Enable */
#define USBC_UHINTE_DDISCIE         (0x1u << USBC_UHINTE_DDISCIE_Pos)
#define USBC_UHINTE_RSTIE_Pos       2            /**< \brief (USBC_UHINTE) RSTI Enable */
#define USBC_UHINTE_RSTIE           (0x1u << USBC_UHINTE_RSTIE_Pos)
#define USBC_UHINTE_RSMEDIE_Pos     3            /**< \brief (USBC_UHINTE) RSMEDI Enable */
#define USBC_UHINTE_RSMEDIE         (0x1u << USBC_UHINTE_RSMEDIE_Pos)
#define USBC_UHINTE_RXRSMIE_Pos     4            /**< \brief (USBC_UHINTE) RXRSMI Enable */
#define USBC_UHINTE_RXRSMIE         (0x1u << USBC_UHINTE_RXRSMIE_Pos)
#define USBC_UHINTE_HSOFIE_Pos      5            /**< \brief (USBC_UHINTE) HSOFI Enable */
#define USBC_UHINTE_HSOFIE          (0x1u << USBC_UHINTE_HSOFIE_Pos)
#define USBC_UHINTE_HWUPIE_Pos      6            /**< \brief (USBC_UHINTE) HWUPI Enable */
#define USBC_UHINTE_HWUPIE          (0x1u << USBC_UHINTE_HWUPIE_Pos)
#define USBC_UHINTE_P0INTE_Pos      8            /**< \brief (USBC_UHINTE) P0INT Enable */
#define USBC_UHINTE_P0INTE          (0x1u << USBC_UHINTE_P0INTE_Pos)
#define USBC_UHINTE_P1INTE_Pos      9            /**< \brief (USBC_UHINTE) P1INT Enable */
#define USBC_UHINTE_P1INTE          (0x1u << USBC_UHINTE_P1INTE_Pos)
#define USBC_UHINTE_P2INTE_Pos      10           /**< \brief (USBC_UHINTE) P2INT Enable */
#define USBC_UHINTE_P2INTE          (0x1u << USBC_UHINTE_P2INTE_Pos)
#define USBC_UHINTE_P3INTE_Pos      11           /**< \brief (USBC_UHINTE) P3INT Enable */
#define USBC_UHINTE_P3INTE          (0x1u << USBC_UHINTE_P3INTE_Pos)
#define USBC_UHINTE_P4INTE_Pos      12           /**< \brief (USBC_UHINTE) P4INT Enable */
#define USBC_UHINTE_P4INTE          (0x1u << USBC_UHINTE_P4INTE_Pos)
#define USBC_UHINTE_P5INTE_Pos      13           /**< \brief (USBC_UHINTE) P5INT Enable */
#define USBC_UHINTE_P5INTE          (0x1u << USBC_UHINTE_P5INTE_Pos)
#define USBC_UHINTE_P6INTE_Pos      14           /**< \brief (USBC_UHINTE) P6INT Enable */
#define USBC_UHINTE_P6INTE          (0x1u << USBC_UHINTE_P6INTE_Pos)
#define USBC_UHINTE_P7INTE_Pos      15           /**< \brief (USBC_UHINTE) P7INT Enable */
#define USBC_UHINTE_P7INTE          (0x1u << USBC_UHINTE_P7INTE_Pos)
#define USBC_UHINTE_MASK            0x0000FF7Fu  /**< \brief (USBC_UHINTE) MASK Register */

/* -------- USBC_UHINTECLR : (USBC Offset: 0x414) ( /W 32) Host Global Interrupt Enable Clear Register -------- */
#define USBC_UHINTECLR_OFFSET       0x414        /**< \brief (USBC_UHINTECLR offset) Host Global Interrupt Enable Clear Register */
#define USBC_UHINTECLR_RESETVALUE   0x00000000   /**< \brief (USBC_UHINTECLR reset_value) Host Global Interrupt Enable Clear Register */

#define USBC_UHINTECLR_DCONNIEC_Pos 0            /**< \brief (USBC_UHINTECLR) DCONNIE Clear */
#define USBC_UHINTECLR_DCONNIEC     (0x1u << USBC_UHINTECLR_DCONNIEC_Pos)
#define USBC_UHINTECLR_DDISCIEC_Pos 1            /**< \brief (USBC_UHINTECLR) DDISCIE Clear */
#define USBC_UHINTECLR_DDISCIEC     (0x1u << USBC_UHINTECLR_DDISCIEC_Pos)
#define USBC_UHINTECLR_RSTIEC_Pos   2            /**< \brief (USBC_UHINTECLR) RSTIE Clear */
#define USBC_UHINTECLR_RSTIEC       (0x1u << USBC_UHINTECLR_RSTIEC_Pos)
#define USBC_UHINTECLR_RSMEDIEC_Pos 3            /**< \brief (USBC_UHINTECLR) RSMEDIE Clear */
#define USBC_UHINTECLR_RSMEDIEC     (0x1u << USBC_UHINTECLR_RSMEDIEC_Pos)
#define USBC_UHINTECLR_RXRSMIEC_Pos 4            /**< \brief (USBC_UHINTECLR) RXRSMIE Clear */
#define USBC_UHINTECLR_RXRSMIEC     (0x1u << USBC_UHINTECLR_RXRSMIEC_Pos)
#define USBC_UHINTECLR_HSOFIEC_Pos  5            /**< \brief (USBC_UHINTECLR) HSOFIE Clear */
#define USBC_UHINTECLR_HSOFIEC      (0x1u << USBC_UHINTECLR_HSOFIEC_Pos)
#define USBC_UHINTECLR_HWUPIEC_Pos  6            /**< \brief (USBC_UHINTECLR) HWUPIE Clear */
#define USBC_UHINTECLR_HWUPIEC      (0x1u << USBC_UHINTECLR_HWUPIEC_Pos)
#define USBC_UHINTECLR_P0INTEC_Pos  8            /**< \brief (USBC_UHINTECLR) P0INTE Clear */
#define USBC_UHINTECLR_P0INTEC      (0x1u << USBC_UHINTECLR_P0INTEC_Pos)
#define USBC_UHINTECLR_P1INTEC_Pos  9            /**< \brief (USBC_UHINTECLR) P1INTE Clear */
#define USBC_UHINTECLR_P1INTEC      (0x1u << USBC_UHINTECLR_P1INTEC_Pos)
#define USBC_UHINTECLR_P2INTEC_Pos  10           /**< \brief (USBC_UHINTECLR) P2INTE Clear */
#define USBC_UHINTECLR_P2INTEC      (0x1u << USBC_UHINTECLR_P2INTEC_Pos)
#define USBC_UHINTECLR_P3INTEC_Pos  11           /**< \brief (USBC_UHINTECLR) P3INTE Clear */
#define USBC_UHINTECLR_P3INTEC      (0x1u << USBC_UHINTECLR_P3INTEC_Pos)
#define USBC_UHINTECLR_P4INTEC_Pos  12           /**< \brief (USBC_UHINTECLR) P4INTE Clear */
#define USBC_UHINTECLR_P4INTEC      (0x1u << USBC_UHINTECLR_P4INTEC_Pos)
#define USBC_UHINTECLR_P5INTEC_Pos  13           /**< \brief (USBC_UHINTECLR) P5INTE Clear */
#define USBC_UHINTECLR_P5INTEC      (0x1u << USBC_UHINTECLR_P5INTEC_Pos)
#define USBC_UHINTECLR_P6INTEC_Pos  14           /**< \brief (USBC_UHINTECLR) P6INTE Clear */
#define USBC_UHINTECLR_P6INTEC      (0x1u << USBC_UHINTECLR_P6INTEC_Pos)
#define USBC_UHINTECLR_P7INTEC_Pos  15           /**< \brief (USBC_UHINTECLR) P7INTE Clear */
#define USBC_UHINTECLR_P7INTEC      (0x1u << USBC_UHINTECLR_P7INTEC_Pos)
#define USBC_UHINTECLR_MASK         0x0000FF7Fu  /**< \brief (USBC_UHINTECLR) MASK Register */

/* -------- USBC_UHINTESET : (USBC Offset: 0x418) ( /W 32) Host Global Interrupt Enable Set Register -------- */
#define USBC_UHINTESET_OFFSET       0x418        /**< \brief (USBC_UHINTESET offset) Host Global Interrupt Enable Set Register */
#define USBC_UHINTESET_RESETVALUE   0x00000000   /**< \brief (USBC_UHINTESET reset_value) Host Global Interrupt Enable Set Register */

#define USBC_UHINTESET_DCONNIES_Pos 0            /**< \brief (USBC_UHINTESET) DCONNIE Set */
#define USBC_UHINTESET_DCONNIES     (0x1u << USBC_UHINTESET_DCONNIES_Pos)
#define USBC_UHINTESET_DDISCIES_Pos 1            /**< \brief (USBC_UHINTESET) DDISCIE Set */
#define USBC_UHINTESET_DDISCIES     (0x1u << USBC_UHINTESET_DDISCIES_Pos)
#define USBC_UHINTESET_RSTIES_Pos   2            /**< \brief (USBC_UHINTESET) RSTIE Set */
#define USBC_UHINTESET_RSTIES       (0x1u << USBC_UHINTESET_RSTIES_Pos)
#define USBC_UHINTESET_RSMEDIES_Pos 3            /**< \brief (USBC_UHINTESET) RSMEDIE Set */
#define USBC_UHINTESET_RSMEDIES     (0x1u << USBC_UHINTESET_RSMEDIES_Pos)
#define USBC_UHINTESET_RXRSMIES_Pos 4            /**< \brief (USBC_UHINTESET) RXRSMIE Set */
#define USBC_UHINTESET_RXRSMIES     (0x1u << USBC_UHINTESET_RXRSMIES_Pos)
#define USBC_UHINTESET_HSOFIES_Pos  5            /**< \brief (USBC_UHINTESET) HSOFIE Set */
#define USBC_UHINTESET_HSOFIES      (0x1u << USBC_UHINTESET_HSOFIES_Pos)
#define USBC_UHINTESET_HWUPIES_Pos  6            /**< \brief (USBC_UHINTESET) HWUPIE Set */
#define USBC_UHINTESET_HWUPIES      (0x1u << USBC_UHINTESET_HWUPIES_Pos)
#define USBC_UHINTESET_P0INTES_Pos  8            /**< \brief (USBC_UHINTESET) P0INTE Set */
#define USBC_UHINTESET_P0INTES      (0x1u << USBC_UHINTESET_P0INTES_Pos)
#define USBC_UHINTESET_P1INTES_Pos  9            /**< \brief (USBC_UHINTESET) P1INTE Set */
#define USBC_UHINTESET_P1INTES      (0x1u << USBC_UHINTESET_P1INTES_Pos)
#define USBC_UHINTESET_P2INTES_Pos  10           /**< \brief (USBC_UHINTESET) P2INTE Set */
#define USBC_UHINTESET_P2INTES      (0x1u << USBC_UHINTESET_P2INTES_Pos)
#define USBC_UHINTESET_P3INTES_Pos  11           /**< \brief (USBC_UHINTESET) P3INTE Set */
#define USBC_UHINTESET_P3INTES      (0x1u << USBC_UHINTESET_P3INTES_Pos)
#define USBC_UHINTESET_P4INTES_Pos  12           /**< \brief (USBC_UHINTESET) P4INTE Set */
#define USBC_UHINTESET_P4INTES      (0x1u << USBC_UHINTESET_P4INTES_Pos)
#define USBC_UHINTESET_P5INTES_Pos  13           /**< \brief (USBC_UHINTESET) P5INTE Set */
#define USBC_UHINTESET_P5INTES      (0x1u << USBC_UHINTESET_P5INTES_Pos)
#define USBC_UHINTESET_P6INTES_Pos  14           /**< \brief (USBC_UHINTESET) P6INTE Set */
#define USBC_UHINTESET_P6INTES      (0x1u << USBC_UHINTESET_P6INTES_Pos)
#define USBC_UHINTESET_P7INTES_Pos  15           /**< \brief (USBC_UHINTESET) P7INTE Set */
#define USBC_UHINTESET_P7INTES      (0x1u << USBC_UHINTESET_P7INTES_Pos)
#define USBC_UHINTESET_MASK         0x0000FF7Fu  /**< \brief (USBC_UHINTESET) MASK Register */

/* -------- USBC_UPRST : (USBC Offset: 0x41C) (R/W 32) Pipe Reset Register -------- */
#define USBC_UPRST_OFFSET           0x41C        /**< \brief (USBC_UPRST offset) Pipe Reset Register */
#define USBC_UPRST_RESETVALUE       0x00000000   /**< \brief (USBC_UPRST reset_value) Pipe Reset Register */

#define USBC_UPRST_PEN0_Pos         0            /**< \brief (USBC_UPRST) Pipe0 Enable */
#define USBC_UPRST_PEN0             (0x1u << USBC_UPRST_PEN0_Pos)
#define USBC_UPRST_PEN1_Pos         1            /**< \brief (USBC_UPRST) Pipe1 Enable */
#define USBC_UPRST_PEN1             (0x1u << USBC_UPRST_PEN1_Pos)
#define USBC_UPRST_PEN2_Pos         2            /**< \brief (USBC_UPRST) Pipe2 Enable */
#define USBC_UPRST_PEN2             (0x1u << USBC_UPRST_PEN2_Pos)
#define USBC_UPRST_PEN3_Pos         3            /**< \brief (USBC_UPRST) Pipe3 Enable */
#define USBC_UPRST_PEN3             (0x1u << USBC_UPRST_PEN3_Pos)
#define USBC_UPRST_PEN4_Pos         4            /**< \brief (USBC_UPRST) Pipe4 Enable */
#define USBC_UPRST_PEN4             (0x1u << USBC_UPRST_PEN4_Pos)
#define USBC_UPRST_PEN5_Pos         5            /**< \brief (USBC_UPRST) Pipe5 Enable */
#define USBC_UPRST_PEN5             (0x1u << USBC_UPRST_PEN5_Pos)
#define USBC_UPRST_PEN6_Pos         6            /**< \brief (USBC_UPRST) Pipe6 Enable */
#define USBC_UPRST_PEN6             (0x1u << USBC_UPRST_PEN6_Pos)
#define USBC_UPRST_PEN7_Pos         7            /**< \brief (USBC_UPRST) Pipe7 Enable */
#define USBC_UPRST_PEN7             (0x1u << USBC_UPRST_PEN7_Pos)
#define USBC_UPRST_MASK             0x000000FFu  /**< \brief (USBC_UPRST) MASK Register */

/* -------- USBC_UHFNUM : (USBC Offset: 0x420) (R/W 32) Host Frame Number Register -------- */
#define USBC_UHFNUM_OFFSET          0x420        /**< \brief (USBC_UHFNUM offset) Host Frame Number Register */
#define USBC_UHFNUM_RESETVALUE      0x00000000   /**< \brief (USBC_UHFNUM reset_value) Host Frame Number Register */

#define USBC_UHFNUM_MFNUM_Pos       0            /**< \brief (USBC_UHFNUM) Micro Frame Number */
#define USBC_UHFNUM_MFNUM_Msk       (0x7u << USBC_UHFNUM_MFNUM_Pos)
#define USBC_UHFNUM_MFNUM(value)    ((USBC_UHFNUM_MFNUM_Msk & ((value) << USBC_UHFNUM_MFNUM_Pos)))
#define USBC_UHFNUM_FNUM_Pos        3            /**< \brief (USBC_UHFNUM) Frame Number */
#define USBC_UHFNUM_FNUM_Msk        (0x7FFu << USBC_UHFNUM_FNUM_Pos)
#define USBC_UHFNUM_FNUM(value)     ((USBC_UHFNUM_FNUM_Msk & ((value) << USBC_UHFNUM_FNUM_Pos)))
#define USBC_UHFNUM_FLENHIGH_Pos    16           /**< \brief (USBC_UHFNUM) Frame Length */
#define USBC_UHFNUM_FLENHIGH_Msk    (0xFFu << USBC_UHFNUM_FLENHIGH_Pos)
#define USBC_UHFNUM_FLENHIGH(value) ((USBC_UHFNUM_FLENHIGH_Msk & ((value) << USBC_UHFNUM_FLENHIGH_Pos)))
#define USBC_UHFNUM_MASK            0x00FF3FFFu  /**< \brief (USBC_UHFNUM) MASK Register */

