Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UPSTA3CLR : (USBC Offset: 0x56C) ( /W 32) Pipe Status Clear Register -------- */
#define USBC_UPSTA3CLR_OFFSET       0x56C        /**< \brief (USBC_UPSTA3CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA3CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA3CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA3CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA3CLR) RXINI Clear */
#define USBC_UPSTA3CLR_RXINIC       (0x1u << USBC_UPSTA3CLR_RXINIC_Pos)
#define USBC_UPSTA3CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA3CLR) TXOUTI Clear */
#define USBC_UPSTA3CLR_TXOUTIC      (0x1u << USBC_UPSTA3CLR_TXOUTIC_Pos)
#define USBC_UPSTA3CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA3CLR) TXSTPI Clear */
#define USBC_UPSTA3CLR_TXSTPIC      (0x1u << USBC_UPSTA3CLR_TXSTPIC_Pos)
#define USBC_UPSTA3CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA3CLR) PERRI Clear */
#define USBC_UPSTA3CLR_PERRIC       (0x1u << USBC_UPSTA3CLR_PERRIC_Pos)
#define USBC_UPSTA3CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA3CLR) NAKEDI Clear */
#define USBC_UPSTA3CLR_NAKEDIC      (0x1u << USBC_UPSTA3CLR_NAKEDIC_Pos)
#define USBC_UPSTA3CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA3CLR) ERRORFI Clear */
#define USBC_UPSTA3CLR_ERRORFIC     (0x1u << USBC_UPSTA3CLR_ERRORFIC_Pos)
#define USBC_UPSTA3CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA3CLR) RXSTALLDI Clear */
#define USBC_UPSTA3CLR_RXSTALLDIC   (0x1u << USBC_UPSTA3CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA3CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA3CLR) RAMACERI Clear */
#define USBC_UPSTA3CLR_RAMACERIC    (0x1u << USBC_UPSTA3CLR_RAMACERIC_Pos)
#define USBC_UPSTA3CLR_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA3CLR) MASK Register */

/* -------- USBC_UPSTA4CLR : (USBC Offset: 0x570) ( /W 32) Pipe Status Clear Register -------- */
#define USBC_UPSTA4CLR_OFFSET       0x570        /**< \brief (USBC_UPSTA4CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA4CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA4CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA4CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA4CLR) RXINI Clear */
#define USBC_UPSTA4CLR_RXINIC       (0x1u << USBC_UPSTA4CLR_RXINIC_Pos)
#define USBC_UPSTA4CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA4CLR) TXOUTI Clear */
#define USBC_UPSTA4CLR_TXOUTIC      (0x1u << USBC_UPSTA4CLR_TXOUTIC_Pos)
#define USBC_UPSTA4CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA4CLR) TXSTPI Clear */
#define USBC_UPSTA4CLR_TXSTPIC      (0x1u << USBC_UPSTA4CLR_TXSTPIC_Pos)
#define USBC_UPSTA4CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA4CLR) PERRI Clear */
#define USBC_UPSTA4CLR_PERRIC       (0x1u << USBC_UPSTA4CLR_PERRIC_Pos)
#define USBC_UPSTA4CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA4CLR) NAKEDI Clear */
#define USBC_UPSTA4CLR_NAKEDIC      (0x1u << USBC_UPSTA4CLR_NAKEDIC_Pos)
#define USBC_UPSTA4CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA4CLR) ERRORFI Clear */
#define USBC_UPSTA4CLR_ERRORFIC     (0x1u << USBC_UPSTA4CLR_ERRORFIC_Pos)
#define USBC_UPSTA4CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA4CLR) RXSTALLDI Clear */
#define USBC_UPSTA4CLR_RXSTALLDIC   (0x1u << USBC_UPSTA4CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA4CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA4CLR) RAMACERI Clear */
#define USBC_UPSTA4CLR_RAMACERIC    (0x1u << USBC_UPSTA4CLR_RAMACERIC_Pos)
#define USBC_UPSTA4CLR_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA4CLR) MASK Register */

/* -------- USBC_UPSTA5CLR : (USBC Offset: 0x574) ( /W 32) Pipe Status Clear Register -------- */
#define USBC_UPSTA5CLR_OFFSET       0x574        /**< \brief (USBC_UPSTA5CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA5CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA5CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA5CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA5CLR) RXINI Clear */
#define USBC_UPSTA5CLR_RXINIC       (0x1u << USBC_UPSTA5CLR_RXINIC_Pos)
#define USBC_UPSTA5CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA5CLR) TXOUTI Clear */
#define USBC_UPSTA5CLR_TXOUTIC      (0x1u << USBC_UPSTA5CLR_TXOUTIC_Pos)
#define USBC_UPSTA5CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA5CLR) TXSTPI Clear */
#define USBC_UPSTA5CLR_TXSTPIC      (0x1u << USBC_UPSTA5CLR_TXSTPIC_Pos)
#define USBC_UPSTA5CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA5CLR) PERRI Clear */
#define USBC_UPSTA5CLR_PERRIC       (0x1u << USBC_UPSTA5CLR_PERRIC_Pos)
#define USBC_UPSTA5CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA5CLR) NAKEDI Clear */
#define USBC_UPSTA5CLR_NAKEDIC      (0x1u << USBC_UPSTA5CLR_NAKEDIC_Pos)
#define USBC_UPSTA5CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA5CLR) ERRORFI Clear */
#define USBC_UPSTA5CLR_ERRORFIC     (0x1u << USBC_UPSTA5CLR_ERRORFIC_Pos)
#define USBC_UPSTA5CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA5CLR) RXSTALLDI Clear */
#define USBC_UPSTA5CLR_RXSTALLDIC   (0x1u << USBC_UPSTA5CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA5CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA5CLR) RAMACERI Clear */
#define USBC_UPSTA5CLR_RAMACERIC    (0x1u << USBC_UPSTA5CLR_RAMACERIC_Pos)
#define USBC_UPSTA5CLR_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA5CLR) MASK Register */

/* -------- USBC_UPSTA6CLR : (USBC Offset: 0x578) ( /W 32) Pipe Status Clear Register -------- */
#define USBC_UPSTA6CLR_OFFSET       0x578        /**< \brief (USBC_UPSTA6CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA6CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA6CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA6CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA6CLR) RXINI Clear */
#define USBC_UPSTA6CLR_RXINIC       (0x1u << USBC_UPSTA6CLR_RXINIC_Pos)
#define USBC_UPSTA6CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA6CLR) TXOUTI Clear */
#define USBC_UPSTA6CLR_TXOUTIC      (0x1u << USBC_UPSTA6CLR_TXOUTIC_Pos)
#define USBC_UPSTA6CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA6CLR) TXSTPI Clear */
#define USBC_UPSTA6CLR_TXSTPIC      (0x1u << USBC_UPSTA6CLR_TXSTPIC_Pos)
#define USBC_UPSTA6CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA6CLR) PERRI Clear */
#define USBC_UPSTA6CLR_PERRIC       (0x1u << USBC_UPSTA6CLR_PERRIC_Pos)
#define USBC_UPSTA6CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA6CLR) NAKEDI Clear */
#define USBC_UPSTA6CLR_NAKEDIC      (0x1u << USBC_UPSTA6CLR_NAKEDIC_Pos)
#define USBC_UPSTA6CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA6CLR) ERRORFI Clear */
#define USBC_UPSTA6CLR_ERRORFIC     (0x1u << USBC_UPSTA6CLR_ERRORFIC_Pos)
#define USBC_UPSTA6CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA6CLR) RXSTALLDI Clear */
#define USBC_UPSTA6CLR_RXSTALLDIC   (0x1u << USBC_UPSTA6CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA6CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA6CLR) RAMACERI Clear */
#define USBC_UPSTA6CLR_RAMACERIC    (0x1u << USBC_UPSTA6CLR_RAMACERIC_Pos)
#define USBC_UPSTA6CLR_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA6CLR) MASK Register */

/* -------- USBC_UPSTA7CLR : (USBC Offset: 0x57C) ( /W 32) Pipe Status Clear Register -------- */
#define USBC_UPSTA7CLR_OFFSET       0x57C        /**< \brief (USBC_UPSTA7CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA7CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA7CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA7CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA7CLR) RXINI Clear */
#define USBC_UPSTA7CLR_RXINIC       (0x1u << USBC_UPSTA7CLR_RXINIC_Pos)
#define USBC_UPSTA7CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA7CLR) TXOUTI Clear */
#define USBC_UPSTA7CLR_TXOUTIC      (0x1u << USBC_UPSTA7CLR_TXOUTIC_Pos)
#define USBC_UPSTA7CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA7CLR) TXSTPI Clear */
#define USBC_UPSTA7CLR_TXSTPIC      (0x1u << USBC_UPSTA7CLR_TXSTPIC_Pos)
#define USBC_UPSTA7CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA7CLR) PERRI Clear */
#define USBC_UPSTA7CLR_PERRIC       (0x1u << USBC_UPSTA7CLR_PERRIC_Pos)
#define USBC_UPSTA7CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA7CLR) NAKEDI Clear */
#define USBC_UPSTA7CLR_NAKEDIC      (0x1u << USBC_UPSTA7CLR_NAKEDIC_Pos)
#define USBC_UPSTA7CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA7CLR) ERRORFI Clear */
#define USBC_UPSTA7CLR_ERRORFIC     (0x1u << USBC_UPSTA7CLR_ERRORFIC_Pos)
#define USBC_UPSTA7CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA7CLR) RXSTALLDI Clear */
#define USBC_UPSTA7CLR_RXSTALLDIC   (0x1u << USBC_UPSTA7CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA7CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA7CLR) RAMACERI Clear */
#define USBC_UPSTA7CLR_RAMACERIC    (0x1u << USBC_UPSTA7CLR_RAMACERIC_Pos)
#define USBC_UPSTA7CLR_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA7CLR) MASK Register */

/* -------- USBC_UPSTA0SET : (USBC Offset: 0x590) ( /W 32) Pipe Status Set Register -------- */
#define USBC_UPSTA0SET_OFFSET       0x590        /**< \brief (USBC_UPSTA0SET offset) Pipe Status Set Register */
#define USBC_UPSTA0SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA0SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA0SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA0SET) RXINI Set */
#define USBC_UPSTA0SET_RXINIS       (0x1u << USBC_UPSTA0SET_RXINIS_Pos)
#define USBC_UPSTA0SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA0SET) TXOUTI Set */
#define USBC_UPSTA0SET_TXOUTIS      (0x1u << USBC_UPSTA0SET_TXOUTIS_Pos)
#define USBC_UPSTA0SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA0SET) TXSTPI Set */
#define USBC_UPSTA0SET_TXSTPIS      (0x1u << USBC_UPSTA0SET_TXSTPIS_Pos)
#define USBC_UPSTA0SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA0SET) PERRI Set */
#define USBC_UPSTA0SET_PERRIS       (0x1u << USBC_UPSTA0SET_PERRIS_Pos)
#define USBC_UPSTA0SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA0SET) NAKEDI Set */
#define USBC_UPSTA0SET_NAKEDIS      (0x1u << USBC_UPSTA0SET_NAKEDIS_Pos)
#define USBC_UPSTA0SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA0SET) ERRORFI Set */
#define USBC_UPSTA0SET_ERRORFIS     (0x1u << USBC_UPSTA0SET_ERRORFIS_Pos)
#define USBC_UPSTA0SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA0SET) RXSTALLDI Set */
#define USBC_UPSTA0SET_RXSTALLDIS   (0x1u << USBC_UPSTA0SET_RXSTALLDIS_Pos)
#define USBC_UPSTA0SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA0SET) RAMACERI Set */
#define USBC_UPSTA0SET_RAMACERIS    (0x1u << USBC_UPSTA0SET_RAMACERIS_Pos)
#define USBC_UPSTA0SET_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA0SET) MASK Register */

/* -------- USBC_UPSTA1SET : (USBC Offset: 0x594) ( /W 32) Pipe Status Set Register -------- */
#define USBC_UPSTA1SET_OFFSET       0x594        /**< \brief (USBC_UPSTA1SET offset) Pipe Status Set Register */
#define USBC_UPSTA1SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA1SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA1SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA1SET) RXINI Set */
#define USBC_UPSTA1SET_RXINIS       (0x1u << USBC_UPSTA1SET_RXINIS_Pos)
#define USBC_UPSTA1SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA1SET) TXOUTI Set */
#define USBC_UPSTA1SET_TXOUTIS      (0x1u << USBC_UPSTA1SET_TXOUTIS_Pos)
#define USBC_UPSTA1SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA1SET) TXSTPI Set */
#define USBC_UPSTA1SET_TXSTPIS      (0x1u << USBC_UPSTA1SET_TXSTPIS_Pos)
#define USBC_UPSTA1SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA1SET) PERRI Set */
#define USBC_UPSTA1SET_PERRIS       (0x1u << USBC_UPSTA1SET_PERRIS_Pos)
#define USBC_UPSTA1SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA1SET) NAKEDI Set */
#define USBC_UPSTA1SET_NAKEDIS      (0x1u << USBC_UPSTA1SET_NAKEDIS_Pos)
#define USBC_UPSTA1SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA1SET) ERRORFI Set */
#define USBC_UPSTA1SET_ERRORFIS     (0x1u << USBC_UPSTA1SET_ERRORFIS_Pos)
#define USBC_UPSTA1SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA1SET) RXSTALLDI Set */
#define USBC_UPSTA1SET_RXSTALLDIS   (0x1u << USBC_UPSTA1SET_RXSTALLDIS_Pos)
#define USBC_UPSTA1SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA1SET) RAMACERI Set */
#define USBC_UPSTA1SET_RAMACERIS    (0x1u << USBC_UPSTA1SET_RAMACERIS_Pos)
#define USBC_UPSTA1SET_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA1SET) MASK Register */

/* -------- USBC_UPSTA2SET : (USBC Offset: 0x598) ( /W 32) Pipe Status Set Register -------- */
#define USBC_UPSTA2SET_OFFSET       0x598        /**< \brief (USBC_UPSTA2SET offset) Pipe Status Set Register */
#define USBC_UPSTA2SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA2SET reset_value) Pipe Status Set Register */

