Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UPSTA6SET : (USBC Offset: 0x5A8) ( /W 32) Pipe Status Set Register -------- */
#define USBC_UPSTA6SET_OFFSET       0x5A8        /**< \brief (USBC_UPSTA6SET offset) Pipe Status Set Register */
#define USBC_UPSTA6SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA6SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA6SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA6SET) RXINI Set */
#define USBC_UPSTA6SET_RXINIS       (0x1u << USBC_UPSTA6SET_RXINIS_Pos)
#define USBC_UPSTA6SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA6SET) TXOUTI Set */
#define USBC_UPSTA6SET_TXOUTIS      (0x1u << USBC_UPSTA6SET_TXOUTIS_Pos)
#define USBC_UPSTA6SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA6SET) TXSTPI Set */
#define USBC_UPSTA6SET_TXSTPIS      (0x1u << USBC_UPSTA6SET_TXSTPIS_Pos)
#define USBC_UPSTA6SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA6SET) PERRI Set */
#define USBC_UPSTA6SET_PERRIS       (0x1u << USBC_UPSTA6SET_PERRIS_Pos)
#define USBC_UPSTA6SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA6SET) NAKEDI Set */
#define USBC_UPSTA6SET_NAKEDIS      (0x1u << USBC_UPSTA6SET_NAKEDIS_Pos)
#define USBC_UPSTA6SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA6SET) ERRORFI Set */
#define USBC_UPSTA6SET_ERRORFIS     (0x1u << USBC_UPSTA6SET_ERRORFIS_Pos)
#define USBC_UPSTA6SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA6SET) RXSTALLDI Set */
#define USBC_UPSTA6SET_RXSTALLDIS   (0x1u << USBC_UPSTA6SET_RXSTALLDIS_Pos)
#define USBC_UPSTA6SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA6SET) RAMACERI Set */
#define USBC_UPSTA6SET_RAMACERIS    (0x1u << USBC_UPSTA6SET_RAMACERIS_Pos)
#define USBC_UPSTA6SET_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA6SET) MASK Register */

/* -------- USBC_UPSTA7SET : (USBC Offset: 0x5AC) ( /W 32) Pipe Status Set Register -------- */
#define USBC_UPSTA7SET_OFFSET       0x5AC        /**< \brief (USBC_UPSTA7SET offset) Pipe Status Set Register */
#define USBC_UPSTA7SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPSTA7SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA7SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA7SET) RXINI Set */
#define USBC_UPSTA7SET_RXINIS       (0x1u << USBC_UPSTA7SET_RXINIS_Pos)
#define USBC_UPSTA7SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA7SET) TXOUTI Set */
#define USBC_UPSTA7SET_TXOUTIS      (0x1u << USBC_UPSTA7SET_TXOUTIS_Pos)
#define USBC_UPSTA7SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA7SET) TXSTPI Set */
#define USBC_UPSTA7SET_TXSTPIS      (0x1u << USBC_UPSTA7SET_TXSTPIS_Pos)
#define USBC_UPSTA7SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA7SET) PERRI Set */
#define USBC_UPSTA7SET_PERRIS       (0x1u << USBC_UPSTA7SET_PERRIS_Pos)
#define USBC_UPSTA7SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA7SET) NAKEDI Set */
#define USBC_UPSTA7SET_NAKEDIS      (0x1u << USBC_UPSTA7SET_NAKEDIS_Pos)
#define USBC_UPSTA7SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA7SET) ERRORFI Set */
#define USBC_UPSTA7SET_ERRORFIS     (0x1u << USBC_UPSTA7SET_ERRORFIS_Pos)
#define USBC_UPSTA7SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA7SET) RXSTALLDI Set */
#define USBC_UPSTA7SET_RXSTALLDIS   (0x1u << USBC_UPSTA7SET_RXSTALLDIS_Pos)
#define USBC_UPSTA7SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA7SET) RAMACERI Set */
#define USBC_UPSTA7SET_RAMACERIS    (0x1u << USBC_UPSTA7SET_RAMACERIS_Pos)
#define USBC_UPSTA7SET_MASK         0x0000047Fu  /**< \brief (USBC_UPSTA7SET) MASK Register */

/* -------- USBC_UPCON0 : (USBC Offset: 0x5C0) (R/  32) Pipe Control Register -------- */
#define USBC_UPCON0_OFFSET          0x5C0        /**< \brief (USBC_UPCON0 offset) Pipe Control Register */
#define USBC_UPCON0_RESETVALUE      0x00000000   /**< \brief (USBC_UPCON0 reset_value) Pipe Control Register */

#define USBC_UPCON0_RXINE_Pos       0            /**< \brief (USBC_UPCON0) RXIN Interrupt Enable */
#define USBC_UPCON0_RXINE           (0x1u << USBC_UPCON0_RXINE_Pos)
#define USBC_UPCON0_TXOUTE_Pos      1            /**< \brief (USBC_UPCON0) TXOUT Interrupt Enable */
#define USBC_UPCON0_TXOUTE          (0x1u << USBC_UPCON0_TXOUTE_Pos)
#define USBC_UPCON0_TXSTPE_Pos      2            /**< \brief (USBC_UPCON0) TXSTP Interrupt Enable */
#define USBC_UPCON0_TXSTPE          (0x1u << USBC_UPCON0_TXSTPE_Pos)
#define USBC_UPCON0_PERRE_Pos       3            /**< \brief (USBC_UPCON0) PERR Interrupt Enable */
#define USBC_UPCON0_PERRE           (0x1u << USBC_UPCON0_PERRE_Pos)
#define USBC_UPCON0_NAKEDE_Pos      4            /**< \brief (USBC_UPCON0) NAKED Interrupt Enable */
#define USBC_UPCON0_NAKEDE          (0x1u << USBC_UPCON0_NAKEDE_Pos)
#define USBC_UPCON0_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON0) ERRORFI Interrupt Enable */
#define USBC_UPCON0_ERRORFIE        (0x1u << USBC_UPCON0_ERRORFIE_Pos)
#define USBC_UPCON0_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON0) RXTALLD Interrupt Enable */
#define USBC_UPCON0_RXSTALLDE       (0x1u << USBC_UPCON0_RXSTALLDE_Pos)
#define USBC_UPCON0_RAMACERE_Pos    10           /**< \brief (USBC_UPCON0) RAMACER Interrupt Enable */
#define USBC_UPCON0_RAMACERE        (0x1u << USBC_UPCON0_RAMACERE_Pos)
#define USBC_UPCON0_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON0) NBUSYBKInterrupt Enable */
#define USBC_UPCON0_NBUSYBKE        (0x1u << USBC_UPCON0_NBUSYBKE_Pos)
#define USBC_UPCON0_FIFOCON_Pos     14           /**< \brief (USBC_UPCON0) FIFO Control */
#define USBC_UPCON0_FIFOCON         (0x1u << USBC_UPCON0_FIFOCON_Pos)
#define USBC_UPCON0_PFREEZE_Pos     17           /**< \brief (USBC_UPCON0) Pipe Freeze */
#define USBC_UPCON0_PFREEZE         (0x1u << USBC_UPCON0_PFREEZE_Pos)
#define USBC_UPCON0_INITDTGL_Pos    18           /**< \brief (USBC_UPCON0) Data Toggle Initialization */
#define USBC_UPCON0_INITDTGL        (0x1u << USBC_UPCON0_INITDTGL_Pos)
#define USBC_UPCON0_INITBK_Pos      19           /**< \brief (USBC_UPCON0) Bank Initialization */
#define USBC_UPCON0_INITBK          (0x1u << USBC_UPCON0_INITBK_Pos)
#define USBC_UPCON0_MASK            0x000E547Fu  /**< \brief (USBC_UPCON0) MASK Register */

