Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UPCON0SET_RXINES_Pos   0            /**< \brief (USBC_UPCON0SET) RXINE Set */
#define USBC_UPCON0SET_RXINES       (0x1u << USBC_UPCON0SET_RXINES_Pos)
#define USBC_UPCON0SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON0SET) TXOUTE Set */
#define USBC_UPCON0SET_TXOUTES      (0x1u << USBC_UPCON0SET_TXOUTES_Pos)
#define USBC_UPCON0SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON0SET) TXSTPE Set */
#define USBC_UPCON0SET_TXSTPES      (0x1u << USBC_UPCON0SET_TXSTPES_Pos)
#define USBC_UPCON0SET_PERRES_Pos   3            /**< \brief (USBC_UPCON0SET) PERRE Set */
#define USBC_UPCON0SET_PERRES       (0x1u << USBC_UPCON0SET_PERRES_Pos)
#define USBC_UPCON0SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON0SET) NAKEDE Set */
#define USBC_UPCON0SET_NAKEDES      (0x1u << USBC_UPCON0SET_NAKEDES_Pos)
#define USBC_UPCON0SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON0SET) ERRORFIE Set */
#define USBC_UPCON0SET_ERRORFIES    (0x1u << USBC_UPCON0SET_ERRORFIES_Pos)
#define USBC_UPCON0SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON0SET) RXSTALLDE Set */
#define USBC_UPCON0SET_RXSTALLDES   (0x1u << USBC_UPCON0SET_RXSTALLDES_Pos)
#define USBC_UPCON0SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON0SET) RAMACERE Set */
#define USBC_UPCON0SET_RAMACERES    (0x1u << USBC_UPCON0SET_RAMACERES_Pos)
#define USBC_UPCON0SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON0SET) NBUSYBKE Set */
#define USBC_UPCON0SET_NBUSYBKES    (0x1u << USBC_UPCON0SET_NBUSYBKES_Pos)
#define USBC_UPCON0SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON0SET) FIFOCON Set */
#define USBC_UPCON0SET_FIFOCONS     (0x1u << USBC_UPCON0SET_FIFOCONS_Pos)
#define USBC_UPCON0SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON0SET) PFREEZE Set */
#define USBC_UPCON0SET_PFREEZES     (0x1u << USBC_UPCON0SET_PFREEZES_Pos)
#define USBC_UPCON0SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON0SET) INITDTGL Set */
#define USBC_UPCON0SET_INITDTGLS    (0x1u << USBC_UPCON0SET_INITDTGLS_Pos)
#define USBC_UPCON0SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON0SET) INITBK Set */
#define USBC_UPCON0SET_INITBKS      (0x1u << USBC_UPCON0SET_INITBKS_Pos)
#define USBC_UPCON0SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON0SET) MASK Register */

/* -------- USBC_UPCON1SET : (USBC Offset: 0x5F4) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON1SET_OFFSET       0x5F4        /**< \brief (USBC_UPCON1SET offset) Pipe Control Set Register */
#define USBC_UPCON1SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON1SET reset_value) Pipe Control Set Register */

#define USBC_UPCON1SET_RXINES_Pos   0            /**< \brief (USBC_UPCON1SET) RXINE Set */
#define USBC_UPCON1SET_RXINES       (0x1u << USBC_UPCON1SET_RXINES_Pos)
#define USBC_UPCON1SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON1SET) TXOUTE Set */
#define USBC_UPCON1SET_TXOUTES      (0x1u << USBC_UPCON1SET_TXOUTES_Pos)
#define USBC_UPCON1SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON1SET) TXSTPE Set */
#define USBC_UPCON1SET_TXSTPES      (0x1u << USBC_UPCON1SET_TXSTPES_Pos)
#define USBC_UPCON1SET_PERRES_Pos   3            /**< \brief (USBC_UPCON1SET) PERRE Set */
#define USBC_UPCON1SET_PERRES       (0x1u << USBC_UPCON1SET_PERRES_Pos)
#define USBC_UPCON1SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON1SET) NAKEDE Set */
#define USBC_UPCON1SET_NAKEDES      (0x1u << USBC_UPCON1SET_NAKEDES_Pos)
#define USBC_UPCON1SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON1SET) ERRORFIE Set */
#define USBC_UPCON1SET_ERRORFIES    (0x1u << USBC_UPCON1SET_ERRORFIES_Pos)
#define USBC_UPCON1SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON1SET) RXSTALLDE Set */
#define USBC_UPCON1SET_RXSTALLDES   (0x1u << USBC_UPCON1SET_RXSTALLDES_Pos)
#define USBC_UPCON1SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON1SET) RAMACERE Set */
#define USBC_UPCON1SET_RAMACERES    (0x1u << USBC_UPCON1SET_RAMACERES_Pos)
#define USBC_UPCON1SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON1SET) NBUSYBKE Set */
#define USBC_UPCON1SET_NBUSYBKES    (0x1u << USBC_UPCON1SET_NBUSYBKES_Pos)
#define USBC_UPCON1SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON1SET) FIFOCON Set */
#define USBC_UPCON1SET_FIFOCONS     (0x1u << USBC_UPCON1SET_FIFOCONS_Pos)
#define USBC_UPCON1SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON1SET) PFREEZE Set */
#define USBC_UPCON1SET_PFREEZES     (0x1u << USBC_UPCON1SET_PFREEZES_Pos)
#define USBC_UPCON1SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON1SET) INITDTGL Set */
#define USBC_UPCON1SET_INITDTGLS    (0x1u << USBC_UPCON1SET_INITDTGLS_Pos)
#define USBC_UPCON1SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON1SET) INITBK Set */
#define USBC_UPCON1SET_INITBKS      (0x1u << USBC_UPCON1SET_INITBKS_Pos)
#define USBC_UPCON1SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON1SET) MASK Register */

/* -------- USBC_UPCON2SET : (USBC Offset: 0x5F8) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON2SET_OFFSET       0x5F8        /**< \brief (USBC_UPCON2SET offset) Pipe Control Set Register */
#define USBC_UPCON2SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON2SET reset_value) Pipe Control Set Register */

#define USBC_UPCON2SET_RXINES_Pos   0            /**< \brief (USBC_UPCON2SET) RXINE Set */
#define USBC_UPCON2SET_RXINES       (0x1u << USBC_UPCON2SET_RXINES_Pos)
#define USBC_UPCON2SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON2SET) TXOUTE Set */
#define USBC_UPCON2SET_TXOUTES      (0x1u << USBC_UPCON2SET_TXOUTES_Pos)
#define USBC_UPCON2SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON2SET) TXSTPE Set */
#define USBC_UPCON2SET_TXSTPES      (0x1u << USBC_UPCON2SET_TXSTPES_Pos)
#define USBC_UPCON2SET_PERRES_Pos   3            /**< \brief (USBC_UPCON2SET) PERRE Set */
#define USBC_UPCON2SET_PERRES       (0x1u << USBC_UPCON2SET_PERRES_Pos)
#define USBC_UPCON2SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON2SET) NAKEDE Set */
#define USBC_UPCON2SET_NAKEDES      (0x1u << USBC_UPCON2SET_NAKEDES_Pos)
#define USBC_UPCON2SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON2SET) ERRORFIE Set */
#define USBC_UPCON2SET_ERRORFIES    (0x1u << USBC_UPCON2SET_ERRORFIES_Pos)
#define USBC_UPCON2SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON2SET) RXSTALLDE Set */
#define USBC_UPCON2SET_RXSTALLDES   (0x1u << USBC_UPCON2SET_RXSTALLDES_Pos)
#define USBC_UPCON2SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON2SET) RAMACERE Set */
#define USBC_UPCON2SET_RAMACERES    (0x1u << USBC_UPCON2SET_RAMACERES_Pos)
#define USBC_UPCON2SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON2SET) NBUSYBKE Set */
#define USBC_UPCON2SET_NBUSYBKES    (0x1u << USBC_UPCON2SET_NBUSYBKES_Pos)
#define USBC_UPCON2SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON2SET) FIFOCON Set */
#define USBC_UPCON2SET_FIFOCONS     (0x1u << USBC_UPCON2SET_FIFOCONS_Pos)
#define USBC_UPCON2SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON2SET) PFREEZE Set */
#define USBC_UPCON2SET_PFREEZES     (0x1u << USBC_UPCON2SET_PFREEZES_Pos)
#define USBC_UPCON2SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON2SET) INITDTGL Set */
#define USBC_UPCON2SET_INITDTGLS    (0x1u << USBC_UPCON2SET_INITDTGLS_Pos)
#define USBC_UPCON2SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON2SET) INITBK Set */
#define USBC_UPCON2SET_INITBKS      (0x1u << USBC_UPCON2SET_INITBKS_Pos)
#define USBC_UPCON2SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON2SET) MASK Register */

/* -------- USBC_UPCON3SET : (USBC Offset: 0x5FC) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON3SET_OFFSET       0x5FC        /**< \brief (USBC_UPCON3SET offset) Pipe Control Set Register */
#define USBC_UPCON3SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON3SET reset_value) Pipe Control Set Register */

#define USBC_UPCON3SET_RXINES_Pos   0            /**< \brief (USBC_UPCON3SET) RXINE Set */
#define USBC_UPCON3SET_RXINES       (0x1u << USBC_UPCON3SET_RXINES_Pos)
#define USBC_UPCON3SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON3SET) TXOUTE Set */
#define USBC_UPCON3SET_TXOUTES      (0x1u << USBC_UPCON3SET_TXOUTES_Pos)
#define USBC_UPCON3SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON3SET) TXSTPE Set */
#define USBC_UPCON3SET_TXSTPES      (0x1u << USBC_UPCON3SET_TXSTPES_Pos)
#define USBC_UPCON3SET_PERRES_Pos   3            /**< \brief (USBC_UPCON3SET) PERRE Set */
#define USBC_UPCON3SET_PERRES       (0x1u << USBC_UPCON3SET_PERRES_Pos)
#define USBC_UPCON3SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON3SET) NAKEDE Set */
#define USBC_UPCON3SET_NAKEDES      (0x1u << USBC_UPCON3SET_NAKEDES_Pos)
#define USBC_UPCON3SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON3SET) ERRORFIE Set */
#define USBC_UPCON3SET_ERRORFIES    (0x1u << USBC_UPCON3SET_ERRORFIES_Pos)
#define USBC_UPCON3SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON3SET) RXSTALLDE Set */
#define USBC_UPCON3SET_RXSTALLDES   (0x1u << USBC_UPCON3SET_RXSTALLDES_Pos)
#define USBC_UPCON3SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON3SET) RAMACERE Set */
#define USBC_UPCON3SET_RAMACERES    (0x1u << USBC_UPCON3SET_RAMACERES_Pos)
#define USBC_UPCON3SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON3SET) NBUSYBKE Set */
#define USBC_UPCON3SET_NBUSYBKES    (0x1u << USBC_UPCON3SET_NBUSYBKES_Pos)
#define USBC_UPCON3SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON3SET) FIFOCON Set */
#define USBC_UPCON3SET_FIFOCONS     (0x1u << USBC_UPCON3SET_FIFOCONS_Pos)
#define USBC_UPCON3SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON3SET) PFREEZE Set */
#define USBC_UPCON3SET_PFREEZES     (0x1u << USBC_UPCON3SET_PFREEZES_Pos)
#define USBC_UPCON3SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON3SET) INITDTGL Set */
#define USBC_UPCON3SET_INITDTGLS    (0x1u << USBC_UPCON3SET_INITDTGLS_Pos)
#define USBC_UPCON3SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON3SET) INITBK Set */
#define USBC_UPCON3SET_INITBKS      (0x1u << USBC_UPCON3SET_INITBKS_Pos)
#define USBC_UPCON3SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON3SET) MASK Register */

/* -------- USBC_UPCON4SET : (USBC Offset: 0x600) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON4SET_OFFSET       0x600        /**< \brief (USBC_UPCON4SET offset) Pipe Control Set Register */
#define USBC_UPCON4SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON4SET reset_value) Pipe Control Set Register */

#define USBC_UPCON4SET_RXINES_Pos   0            /**< \brief (USBC_UPCON4SET) RXINE Set */
#define USBC_UPCON4SET_RXINES       (0x1u << USBC_UPCON4SET_RXINES_Pos)
#define USBC_UPCON4SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON4SET) TXOUTE Set */
#define USBC_UPCON4SET_TXOUTES      (0x1u << USBC_UPCON4SET_TXOUTES_Pos)
#define USBC_UPCON4SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON4SET) TXSTPE Set */
#define USBC_UPCON4SET_TXSTPES      (0x1u << USBC_UPCON4SET_TXSTPES_Pos)
#define USBC_UPCON4SET_PERRES_Pos   3            /**< \brief (USBC_UPCON4SET) PERRE Set */
#define USBC_UPCON4SET_PERRES       (0x1u << USBC_UPCON4SET_PERRES_Pos)
#define USBC_UPCON4SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON4SET) NAKEDE Set */
#define USBC_UPCON4SET_NAKEDES      (0x1u << USBC_UPCON4SET_NAKEDES_Pos)
#define USBC_UPCON4SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON4SET) ERRORFIE Set */
#define USBC_UPCON4SET_ERRORFIES    (0x1u << USBC_UPCON4SET_ERRORFIES_Pos)
#define USBC_UPCON4SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON4SET) RXSTALLDE Set */
#define USBC_UPCON4SET_RXSTALLDES   (0x1u << USBC_UPCON4SET_RXSTALLDES_Pos)
#define USBC_UPCON4SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON4SET) RAMACERE Set */
#define USBC_UPCON4SET_RAMACERES    (0x1u << USBC_UPCON4SET_RAMACERES_Pos)
#define USBC_UPCON4SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON4SET) NBUSYBKE Set */
#define USBC_UPCON4SET_NBUSYBKES    (0x1u << USBC_UPCON4SET_NBUSYBKES_Pos)
#define USBC_UPCON4SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON4SET) FIFOCON Set */
#define USBC_UPCON4SET_FIFOCONS     (0x1u << USBC_UPCON4SET_FIFOCONS_Pos)
#define USBC_UPCON4SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON4SET) PFREEZE Set */
#define USBC_UPCON4SET_PFREEZES     (0x1u << USBC_UPCON4SET_PFREEZES_Pos)
#define USBC_UPCON4SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON4SET) INITDTGL Set */
#define USBC_UPCON4SET_INITDTGLS    (0x1u << USBC_UPCON4SET_INITDTGLS_Pos)
#define USBC_UPCON4SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON4SET) INITBK Set */
#define USBC_UPCON4SET_INITBKS      (0x1u << USBC_UPCON4SET_INITBKS_Pos)
#define USBC_UPCON4SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON4SET) MASK Register */

/* -------- USBC_UPCON5SET : (USBC Offset: 0x604) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON5SET_OFFSET       0x604        /**< \brief (USBC_UPCON5SET offset) Pipe Control Set Register */
#define USBC_UPCON5SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON5SET reset_value) Pipe Control Set Register */

