Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
#define USBC_UPCON5SET_RXINES_Pos   0            /**< \brief (USBC_UPCON5SET) RXINE Set */
#define USBC_UPCON5SET_RXINES       (0x1u << USBC_UPCON5SET_RXINES_Pos)
#define USBC_UPCON5SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON5SET) TXOUTE Set */
#define USBC_UPCON5SET_TXOUTES      (0x1u << USBC_UPCON5SET_TXOUTES_Pos)
#define USBC_UPCON5SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON5SET) TXSTPE Set */
#define USBC_UPCON5SET_TXSTPES      (0x1u << USBC_UPCON5SET_TXSTPES_Pos)
#define USBC_UPCON5SET_PERRES_Pos   3            /**< \brief (USBC_UPCON5SET) PERRE Set */
#define USBC_UPCON5SET_PERRES       (0x1u << USBC_UPCON5SET_PERRES_Pos)
#define USBC_UPCON5SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON5SET) NAKEDE Set */
#define USBC_UPCON5SET_NAKEDES      (0x1u << USBC_UPCON5SET_NAKEDES_Pos)
#define USBC_UPCON5SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON5SET) ERRORFIE Set */
#define USBC_UPCON5SET_ERRORFIES    (0x1u << USBC_UPCON5SET_ERRORFIES_Pos)
#define USBC_UPCON5SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON5SET) RXSTALLDE Set */
#define USBC_UPCON5SET_RXSTALLDES   (0x1u << USBC_UPCON5SET_RXSTALLDES_Pos)
#define USBC_UPCON5SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON5SET) RAMACERE Set */
#define USBC_UPCON5SET_RAMACERES    (0x1u << USBC_UPCON5SET_RAMACERES_Pos)
#define USBC_UPCON5SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON5SET) NBUSYBKE Set */
#define USBC_UPCON5SET_NBUSYBKES    (0x1u << USBC_UPCON5SET_NBUSYBKES_Pos)
#define USBC_UPCON5SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON5SET) FIFOCON Set */
#define USBC_UPCON5SET_FIFOCONS     (0x1u << USBC_UPCON5SET_FIFOCONS_Pos)
#define USBC_UPCON5SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON5SET) PFREEZE Set */
#define USBC_UPCON5SET_PFREEZES     (0x1u << USBC_UPCON5SET_PFREEZES_Pos)
#define USBC_UPCON5SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON5SET) INITDTGL Set */
#define USBC_UPCON5SET_INITDTGLS    (0x1u << USBC_UPCON5SET_INITDTGLS_Pos)
#define USBC_UPCON5SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON5SET) INITBK Set */
#define USBC_UPCON5SET_INITBKS      (0x1u << USBC_UPCON5SET_INITBKS_Pos)
#define USBC_UPCON5SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON5SET) MASK Register */

/* -------- USBC_UPCON6SET : (USBC Offset: 0x608) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON6SET_OFFSET       0x608        /**< \brief (USBC_UPCON6SET offset) Pipe Control Set Register */
#define USBC_UPCON6SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON6SET reset_value) Pipe Control Set Register */

#define USBC_UPCON6SET_RXINES_Pos   0            /**< \brief (USBC_UPCON6SET) RXINE Set */
#define USBC_UPCON6SET_RXINES       (0x1u << USBC_UPCON6SET_RXINES_Pos)
#define USBC_UPCON6SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON6SET) TXOUTE Set */
#define USBC_UPCON6SET_TXOUTES      (0x1u << USBC_UPCON6SET_TXOUTES_Pos)
#define USBC_UPCON6SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON6SET) TXSTPE Set */
#define USBC_UPCON6SET_TXSTPES      (0x1u << USBC_UPCON6SET_TXSTPES_Pos)
#define USBC_UPCON6SET_PERRES_Pos   3            /**< \brief (USBC_UPCON6SET) PERRE Set */
#define USBC_UPCON6SET_PERRES       (0x1u << USBC_UPCON6SET_PERRES_Pos)
#define USBC_UPCON6SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON6SET) NAKEDE Set */
#define USBC_UPCON6SET_NAKEDES      (0x1u << USBC_UPCON6SET_NAKEDES_Pos)
#define USBC_UPCON6SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON6SET) ERRORFIE Set */
#define USBC_UPCON6SET_ERRORFIES    (0x1u << USBC_UPCON6SET_ERRORFIES_Pos)
#define USBC_UPCON6SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON6SET) RXSTALLDE Set */
#define USBC_UPCON6SET_RXSTALLDES   (0x1u << USBC_UPCON6SET_RXSTALLDES_Pos)
#define USBC_UPCON6SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON6SET) RAMACERE Set */
#define USBC_UPCON6SET_RAMACERES    (0x1u << USBC_UPCON6SET_RAMACERES_Pos)
#define USBC_UPCON6SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON6SET) NBUSYBKE Set */
#define USBC_UPCON6SET_NBUSYBKES    (0x1u << USBC_UPCON6SET_NBUSYBKES_Pos)
#define USBC_UPCON6SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON6SET) FIFOCON Set */
#define USBC_UPCON6SET_FIFOCONS     (0x1u << USBC_UPCON6SET_FIFOCONS_Pos)
#define USBC_UPCON6SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON6SET) PFREEZE Set */
#define USBC_UPCON6SET_PFREEZES     (0x1u << USBC_UPCON6SET_PFREEZES_Pos)
#define USBC_UPCON6SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON6SET) INITDTGL Set */
#define USBC_UPCON6SET_INITDTGLS    (0x1u << USBC_UPCON6SET_INITDTGLS_Pos)
#define USBC_UPCON6SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON6SET) INITBK Set */
#define USBC_UPCON6SET_INITBKS      (0x1u << USBC_UPCON6SET_INITBKS_Pos)
#define USBC_UPCON6SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON6SET) MASK Register */

/* -------- USBC_UPCON7SET : (USBC Offset: 0x60C) ( /W 32) Pipe Control Set Register -------- */
#define USBC_UPCON7SET_OFFSET       0x60C        /**< \brief (USBC_UPCON7SET offset) Pipe Control Set Register */
#define USBC_UPCON7SET_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON7SET reset_value) Pipe Control Set Register */

#define USBC_UPCON7SET_RXINES_Pos   0            /**< \brief (USBC_UPCON7SET) RXINE Set */
#define USBC_UPCON7SET_RXINES       (0x1u << USBC_UPCON7SET_RXINES_Pos)
#define USBC_UPCON7SET_TXOUTES_Pos  1            /**< \brief (USBC_UPCON7SET) TXOUTE Set */
#define USBC_UPCON7SET_TXOUTES      (0x1u << USBC_UPCON7SET_TXOUTES_Pos)
#define USBC_UPCON7SET_TXSTPES_Pos  2            /**< \brief (USBC_UPCON7SET) TXSTPE Set */
#define USBC_UPCON7SET_TXSTPES      (0x1u << USBC_UPCON7SET_TXSTPES_Pos)
#define USBC_UPCON7SET_PERRES_Pos   3            /**< \brief (USBC_UPCON7SET) PERRE Set */
#define USBC_UPCON7SET_PERRES       (0x1u << USBC_UPCON7SET_PERRES_Pos)
#define USBC_UPCON7SET_NAKEDES_Pos  4            /**< \brief (USBC_UPCON7SET) NAKEDE Set */
#define USBC_UPCON7SET_NAKEDES      (0x1u << USBC_UPCON7SET_NAKEDES_Pos)
#define USBC_UPCON7SET_ERRORFIES_Pos 5            /**< \brief (USBC_UPCON7SET) ERRORFIE Set */
#define USBC_UPCON7SET_ERRORFIES    (0x1u << USBC_UPCON7SET_ERRORFIES_Pos)
#define USBC_UPCON7SET_RXSTALLDES_Pos 6            /**< \brief (USBC_UPCON7SET) RXSTALLDE Set */
#define USBC_UPCON7SET_RXSTALLDES   (0x1u << USBC_UPCON7SET_RXSTALLDES_Pos)
#define USBC_UPCON7SET_RAMACERES_Pos 10           /**< \brief (USBC_UPCON7SET) RAMACERE Set */
#define USBC_UPCON7SET_RAMACERES    (0x1u << USBC_UPCON7SET_RAMACERES_Pos)
#define USBC_UPCON7SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UPCON7SET) NBUSYBKE Set */
#define USBC_UPCON7SET_NBUSYBKES    (0x1u << USBC_UPCON7SET_NBUSYBKES_Pos)
#define USBC_UPCON7SET_FIFOCONS_Pos 14           /**< \brief (USBC_UPCON7SET) FIFOCON Set */
#define USBC_UPCON7SET_FIFOCONS     (0x1u << USBC_UPCON7SET_FIFOCONS_Pos)
#define USBC_UPCON7SET_PFREEZES_Pos 17           /**< \brief (USBC_UPCON7SET) PFREEZE Set */
#define USBC_UPCON7SET_PFREEZES     (0x1u << USBC_UPCON7SET_PFREEZES_Pos)
#define USBC_UPCON7SET_INITDTGLS_Pos 18           /**< \brief (USBC_UPCON7SET) INITDTGL Set */
#define USBC_UPCON7SET_INITDTGLS    (0x1u << USBC_UPCON7SET_INITDTGLS_Pos)
#define USBC_UPCON7SET_INITBKS_Pos  19           /**< \brief (USBC_UPCON7SET) INITBK Set */
#define USBC_UPCON7SET_INITBKS      (0x1u << USBC_UPCON7SET_INITBKS_Pos)
#define USBC_UPCON7SET_MASK         0x000E547Fu  /**< \brief (USBC_UPCON7SET) MASK Register */

