Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UPCON0CLR : (USBC Offset: 0x620) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON0CLR_OFFSET       0x620        /**< \brief (USBC_UPCON0CLR offset) Pipe Control Clear Register */
#define USBC_UPCON0CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON0CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON0CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON0CLR) RXINE Clear */
#define USBC_UPCON0CLR_RXINEC       (0x1u << USBC_UPCON0CLR_RXINEC_Pos)
#define USBC_UPCON0CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON0CLR) TXOUTE Clear */
#define USBC_UPCON0CLR_TXOUTEC      (0x1u << USBC_UPCON0CLR_TXOUTEC_Pos)
#define USBC_UPCON0CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON0CLR) TXSTPE Clear */
#define USBC_UPCON0CLR_TXSTPEC      (0x1u << USBC_UPCON0CLR_TXSTPEC_Pos)
#define USBC_UPCON0CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON0CLR) PERRE Clear */
#define USBC_UPCON0CLR_PERREC       (0x1u << USBC_UPCON0CLR_PERREC_Pos)
#define USBC_UPCON0CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON0CLR) NAKEDE Clear */
#define USBC_UPCON0CLR_NAKEDEC      (0x1u << USBC_UPCON0CLR_NAKEDEC_Pos)
#define USBC_UPCON0CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON0CLR) ERRORFIE Clear */
#define USBC_UPCON0CLR_ERRORFIEC    (0x1u << USBC_UPCON0CLR_ERRORFIEC_Pos)
#define USBC_UPCON0CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON0CLR) RXTALLDE Clear */
#define USBC_UPCON0CLR_RXSTALLDEC   (0x1u << USBC_UPCON0CLR_RXSTALLDEC_Pos)
#define USBC_UPCON0CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON0CLR) RAMACERE Clear */
#define USBC_UPCON0CLR_RAMACEREC    (0x1u << USBC_UPCON0CLR_RAMACEREC_Pos)
#define USBC_UPCON0CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON0CLR) NBUSYBKE Clear */
#define USBC_UPCON0CLR_NBUSYBKEC    (0x1u << USBC_UPCON0CLR_NBUSYBKEC_Pos)
#define USBC_UPCON0CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON0CLR) FIFOCON Clear */
#define USBC_UPCON0CLR_FIFOCONC     (0x1u << USBC_UPCON0CLR_FIFOCONC_Pos)
#define USBC_UPCON0CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON0CLR) PFREEZE Clear */
#define USBC_UPCON0CLR_PFREEZEC     (0x1u << USBC_UPCON0CLR_PFREEZEC_Pos)
#define USBC_UPCON0CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON0CLR) INITDTGL Clear */
#define USBC_UPCON0CLR_INITDTGLC    (0x1u << USBC_UPCON0CLR_INITDTGLC_Pos)
#define USBC_UPCON0CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON0CLR) INITBK Clear */
#define USBC_UPCON0CLR_INITBKC      (0x1u << USBC_UPCON0CLR_INITBKC_Pos)
#define USBC_UPCON0CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON0CLR) MASK Register */

/* -------- USBC_UPCON1CLR : (USBC Offset: 0x624) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON1CLR_OFFSET       0x624        /**< \brief (USBC_UPCON1CLR offset) Pipe Control Clear Register */
#define USBC_UPCON1CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON1CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON1CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON1CLR) RXINE Clear */
#define USBC_UPCON1CLR_RXINEC       (0x1u << USBC_UPCON1CLR_RXINEC_Pos)
#define USBC_UPCON1CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON1CLR) TXOUTE Clear */
#define USBC_UPCON1CLR_TXOUTEC      (0x1u << USBC_UPCON1CLR_TXOUTEC_Pos)
#define USBC_UPCON1CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON1CLR) TXSTPE Clear */
#define USBC_UPCON1CLR_TXSTPEC      (0x1u << USBC_UPCON1CLR_TXSTPEC_Pos)
#define USBC_UPCON1CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON1CLR) PERRE Clear */
#define USBC_UPCON1CLR_PERREC       (0x1u << USBC_UPCON1CLR_PERREC_Pos)
#define USBC_UPCON1CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON1CLR) NAKEDE Clear */
#define USBC_UPCON1CLR_NAKEDEC      (0x1u << USBC_UPCON1CLR_NAKEDEC_Pos)
#define USBC_UPCON1CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON1CLR) ERRORFIE Clear */
#define USBC_UPCON1CLR_ERRORFIEC    (0x1u << USBC_UPCON1CLR_ERRORFIEC_Pos)
#define USBC_UPCON1CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON1CLR) RXTALLDE Clear */
#define USBC_UPCON1CLR_RXSTALLDEC   (0x1u << USBC_UPCON1CLR_RXSTALLDEC_Pos)
#define USBC_UPCON1CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON1CLR) RAMACERE Clear */
#define USBC_UPCON1CLR_RAMACEREC    (0x1u << USBC_UPCON1CLR_RAMACEREC_Pos)
#define USBC_UPCON1CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON1CLR) NBUSYBKE Clear */
#define USBC_UPCON1CLR_NBUSYBKEC    (0x1u << USBC_UPCON1CLR_NBUSYBKEC_Pos)
#define USBC_UPCON1CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON1CLR) FIFOCON Clear */
#define USBC_UPCON1CLR_FIFOCONC     (0x1u << USBC_UPCON1CLR_FIFOCONC_Pos)
#define USBC_UPCON1CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON1CLR) PFREEZE Clear */
#define USBC_UPCON1CLR_PFREEZEC     (0x1u << USBC_UPCON1CLR_PFREEZEC_Pos)
#define USBC_UPCON1CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON1CLR) INITDTGL Clear */
#define USBC_UPCON1CLR_INITDTGLC    (0x1u << USBC_UPCON1CLR_INITDTGLC_Pos)
#define USBC_UPCON1CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON1CLR) INITBK Clear */
#define USBC_UPCON1CLR_INITBKC      (0x1u << USBC_UPCON1CLR_INITBKC_Pos)
#define USBC_UPCON1CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON1CLR) MASK Register */

/* -------- USBC_UPCON2CLR : (USBC Offset: 0x628) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON2CLR_OFFSET       0x628        /**< \brief (USBC_UPCON2CLR offset) Pipe Control Clear Register */
#define USBC_UPCON2CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON2CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON2CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON2CLR) RXINE Clear */
#define USBC_UPCON2CLR_RXINEC       (0x1u << USBC_UPCON2CLR_RXINEC_Pos)
#define USBC_UPCON2CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON2CLR) TXOUTE Clear */
#define USBC_UPCON2CLR_TXOUTEC      (0x1u << USBC_UPCON2CLR_TXOUTEC_Pos)
#define USBC_UPCON2CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON2CLR) TXSTPE Clear */
#define USBC_UPCON2CLR_TXSTPEC      (0x1u << USBC_UPCON2CLR_TXSTPEC_Pos)
#define USBC_UPCON2CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON2CLR) PERRE Clear */
#define USBC_UPCON2CLR_PERREC       (0x1u << USBC_UPCON2CLR_PERREC_Pos)
#define USBC_UPCON2CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON2CLR) NAKEDE Clear */
#define USBC_UPCON2CLR_NAKEDEC      (0x1u << USBC_UPCON2CLR_NAKEDEC_Pos)
#define USBC_UPCON2CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON2CLR) ERRORFIE Clear */
#define USBC_UPCON2CLR_ERRORFIEC    (0x1u << USBC_UPCON2CLR_ERRORFIEC_Pos)
#define USBC_UPCON2CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON2CLR) RXTALLDE Clear */
#define USBC_UPCON2CLR_RXSTALLDEC   (0x1u << USBC_UPCON2CLR_RXSTALLDEC_Pos)
#define USBC_UPCON2CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON2CLR) RAMACERE Clear */
#define USBC_UPCON2CLR_RAMACEREC    (0x1u << USBC_UPCON2CLR_RAMACEREC_Pos)
#define USBC_UPCON2CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON2CLR) NBUSYBKE Clear */
#define USBC_UPCON2CLR_NBUSYBKEC    (0x1u << USBC_UPCON2CLR_NBUSYBKEC_Pos)
#define USBC_UPCON2CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON2CLR) FIFOCON Clear */
#define USBC_UPCON2CLR_FIFOCONC     (0x1u << USBC_UPCON2CLR_FIFOCONC_Pos)
#define USBC_UPCON2CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON2CLR) PFREEZE Clear */
#define USBC_UPCON2CLR_PFREEZEC     (0x1u << USBC_UPCON2CLR_PFREEZEC_Pos)
#define USBC_UPCON2CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON2CLR) INITDTGL Clear */
#define USBC_UPCON2CLR_INITDTGLC    (0x1u << USBC_UPCON2CLR_INITDTGLC_Pos)
#define USBC_UPCON2CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON2CLR) INITBK Clear */
#define USBC_UPCON2CLR_INITBKC      (0x1u << USBC_UPCON2CLR_INITBKC_Pos)
#define USBC_UPCON2CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON2CLR) MASK Register */

/* -------- USBC_UPCON3CLR : (USBC Offset: 0x62C) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON3CLR_OFFSET       0x62C        /**< \brief (USBC_UPCON3CLR offset) Pipe Control Clear Register */
#define USBC_UPCON3CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON3CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON3CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON3CLR) RXINE Clear */
#define USBC_UPCON3CLR_RXINEC       (0x1u << USBC_UPCON3CLR_RXINEC_Pos)
#define USBC_UPCON3CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON3CLR) TXOUTE Clear */
#define USBC_UPCON3CLR_TXOUTEC      (0x1u << USBC_UPCON3CLR_TXOUTEC_Pos)
#define USBC_UPCON3CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON3CLR) TXSTPE Clear */
#define USBC_UPCON3CLR_TXSTPEC      (0x1u << USBC_UPCON3CLR_TXSTPEC_Pos)
#define USBC_UPCON3CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON3CLR) PERRE Clear */
#define USBC_UPCON3CLR_PERREC       (0x1u << USBC_UPCON3CLR_PERREC_Pos)
#define USBC_UPCON3CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON3CLR) NAKEDE Clear */
#define USBC_UPCON3CLR_NAKEDEC      (0x1u << USBC_UPCON3CLR_NAKEDEC_Pos)
#define USBC_UPCON3CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON3CLR) ERRORFIE Clear */
#define USBC_UPCON3CLR_ERRORFIEC    (0x1u << USBC_UPCON3CLR_ERRORFIEC_Pos)
#define USBC_UPCON3CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON3CLR) RXTALLDE Clear */
#define USBC_UPCON3CLR_RXSTALLDEC   (0x1u << USBC_UPCON3CLR_RXSTALLDEC_Pos)
#define USBC_UPCON3CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON3CLR) RAMACERE Clear */
#define USBC_UPCON3CLR_RAMACEREC    (0x1u << USBC_UPCON3CLR_RAMACEREC_Pos)
#define USBC_UPCON3CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON3CLR) NBUSYBKE Clear */
#define USBC_UPCON3CLR_NBUSYBKEC    (0x1u << USBC_UPCON3CLR_NBUSYBKEC_Pos)
#define USBC_UPCON3CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON3CLR) FIFOCON Clear */
#define USBC_UPCON3CLR_FIFOCONC     (0x1u << USBC_UPCON3CLR_FIFOCONC_Pos)
#define USBC_UPCON3CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON3CLR) PFREEZE Clear */
#define USBC_UPCON3CLR_PFREEZEC     (0x1u << USBC_UPCON3CLR_PFREEZEC_Pos)
#define USBC_UPCON3CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON3CLR) INITDTGL Clear */
#define USBC_UPCON3CLR_INITDTGLC    (0x1u << USBC_UPCON3CLR_INITDTGLC_Pos)
#define USBC_UPCON3CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON3CLR) INITBK Clear */
#define USBC_UPCON3CLR_INITBKC      (0x1u << USBC_UPCON3CLR_INITBKC_Pos)
#define USBC_UPCON3CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON3CLR) MASK Register */

/* -------- USBC_UPCON4CLR : (USBC Offset: 0x630) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON4CLR_OFFSET       0x630        /**< \brief (USBC_UPCON4CLR offset) Pipe Control Clear Register */
#define USBC_UPCON4CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON4CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON4CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON4CLR) RXINE Clear */
#define USBC_UPCON4CLR_RXINEC       (0x1u << USBC_UPCON4CLR_RXINEC_Pos)
#define USBC_UPCON4CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON4CLR) TXOUTE Clear */
#define USBC_UPCON4CLR_TXOUTEC      (0x1u << USBC_UPCON4CLR_TXOUTEC_Pos)
#define USBC_UPCON4CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON4CLR) TXSTPE Clear */
#define USBC_UPCON4CLR_TXSTPEC      (0x1u << USBC_UPCON4CLR_TXSTPEC_Pos)
#define USBC_UPCON4CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON4CLR) PERRE Clear */
#define USBC_UPCON4CLR_PERREC       (0x1u << USBC_UPCON4CLR_PERREC_Pos)
#define USBC_UPCON4CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON4CLR) NAKEDE Clear */
#define USBC_UPCON4CLR_NAKEDEC      (0x1u << USBC_UPCON4CLR_NAKEDEC_Pos)
#define USBC_UPCON4CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON4CLR) ERRORFIE Clear */
#define USBC_UPCON4CLR_ERRORFIEC    (0x1u << USBC_UPCON4CLR_ERRORFIEC_Pos)
#define USBC_UPCON4CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON4CLR) RXTALLDE Clear */
#define USBC_UPCON4CLR_RXSTALLDEC   (0x1u << USBC_UPCON4CLR_RXSTALLDEC_Pos)
#define USBC_UPCON4CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON4CLR) RAMACERE Clear */
#define USBC_UPCON4CLR_RAMACEREC    (0x1u << USBC_UPCON4CLR_RAMACEREC_Pos)
#define USBC_UPCON4CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON4CLR) NBUSYBKE Clear */
#define USBC_UPCON4CLR_NBUSYBKEC    (0x1u << USBC_UPCON4CLR_NBUSYBKEC_Pos)
#define USBC_UPCON4CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON4CLR) FIFOCON Clear */
#define USBC_UPCON4CLR_FIFOCONC     (0x1u << USBC_UPCON4CLR_FIFOCONC_Pos)
#define USBC_UPCON4CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON4CLR) PFREEZE Clear */
#define USBC_UPCON4CLR_PFREEZEC     (0x1u << USBC_UPCON4CLR_PFREEZEC_Pos)
#define USBC_UPCON4CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON4CLR) INITDTGL Clear */
#define USBC_UPCON4CLR_INITDTGLC    (0x1u << USBC_UPCON4CLR_INITDTGLC_Pos)
#define USBC_UPCON4CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON4CLR) INITBK Clear */
#define USBC_UPCON4CLR_INITBKC      (0x1u << USBC_UPCON4CLR_INITBKC_Pos)
#define USBC_UPCON4CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON4CLR) MASK Register */

/* -------- USBC_UPCON5CLR : (USBC Offset: 0x634) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON5CLR_OFFSET       0x634        /**< \brief (USBC_UPCON5CLR offset) Pipe Control Clear Register */
#define USBC_UPCON5CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON5CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON5CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON5CLR) RXINE Clear */
#define USBC_UPCON5CLR_RXINEC       (0x1u << USBC_UPCON5CLR_RXINEC_Pos)
#define USBC_UPCON5CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON5CLR) TXOUTE Clear */
#define USBC_UPCON5CLR_TXOUTEC      (0x1u << USBC_UPCON5CLR_TXOUTEC_Pos)
#define USBC_UPCON5CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON5CLR) TXSTPE Clear */
#define USBC_UPCON5CLR_TXSTPEC      (0x1u << USBC_UPCON5CLR_TXSTPEC_Pos)
#define USBC_UPCON5CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON5CLR) PERRE Clear */
#define USBC_UPCON5CLR_PERREC       (0x1u << USBC_UPCON5CLR_PERREC_Pos)
#define USBC_UPCON5CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON5CLR) NAKEDE Clear */
#define USBC_UPCON5CLR_NAKEDEC      (0x1u << USBC_UPCON5CLR_NAKEDEC_Pos)
#define USBC_UPCON5CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON5CLR) ERRORFIE Clear */
#define USBC_UPCON5CLR_ERRORFIEC    (0x1u << USBC_UPCON5CLR_ERRORFIEC_Pos)
#define USBC_UPCON5CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON5CLR) RXTALLDE Clear */
#define USBC_UPCON5CLR_RXSTALLDEC   (0x1u << USBC_UPCON5CLR_RXSTALLDEC_Pos)
#define USBC_UPCON5CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON5CLR) RAMACERE Clear */
#define USBC_UPCON5CLR_RAMACEREC    (0x1u << USBC_UPCON5CLR_RAMACEREC_Pos)
#define USBC_UPCON5CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON5CLR) NBUSYBKE Clear */
#define USBC_UPCON5CLR_NBUSYBKEC    (0x1u << USBC_UPCON5CLR_NBUSYBKEC_Pos)
#define USBC_UPCON5CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON5CLR) FIFOCON Clear */
#define USBC_UPCON5CLR_FIFOCONC     (0x1u << USBC_UPCON5CLR_FIFOCONC_Pos)
#define USBC_UPCON5CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON5CLR) PFREEZE Clear */
#define USBC_UPCON5CLR_PFREEZEC     (0x1u << USBC_UPCON5CLR_PFREEZEC_Pos)
#define USBC_UPCON5CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON5CLR) INITDTGL Clear */
#define USBC_UPCON5CLR_INITDTGLC    (0x1u << USBC_UPCON5CLR_INITDTGLC_Pos)
#define USBC_UPCON5CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON5CLR) INITBK Clear */
#define USBC_UPCON5CLR_INITBKC      (0x1u << USBC_UPCON5CLR_INITBKC_Pos)
#define USBC_UPCON5CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON5CLR) MASK Register */

/* -------- USBC_UPCON6CLR : (USBC Offset: 0x638) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON6CLR_OFFSET       0x638        /**< \brief (USBC_UPCON6CLR offset) Pipe Control Clear Register */
#define USBC_UPCON6CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON6CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON6CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON6CLR) RXINE Clear */
#define USBC_UPCON6CLR_RXINEC       (0x1u << USBC_UPCON6CLR_RXINEC_Pos)
#define USBC_UPCON6CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON6CLR) TXOUTE Clear */
#define USBC_UPCON6CLR_TXOUTEC      (0x1u << USBC_UPCON6CLR_TXOUTEC_Pos)
#define USBC_UPCON6CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON6CLR) TXSTPE Clear */
#define USBC_UPCON6CLR_TXSTPEC      (0x1u << USBC_UPCON6CLR_TXSTPEC_Pos)
#define USBC_UPCON6CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON6CLR) PERRE Clear */
#define USBC_UPCON6CLR_PERREC       (0x1u << USBC_UPCON6CLR_PERREC_Pos)
#define USBC_UPCON6CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON6CLR) NAKEDE Clear */
#define USBC_UPCON6CLR_NAKEDEC      (0x1u << USBC_UPCON6CLR_NAKEDEC_Pos)
#define USBC_UPCON6CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON6CLR) ERRORFIE Clear */
#define USBC_UPCON6CLR_ERRORFIEC    (0x1u << USBC_UPCON6CLR_ERRORFIEC_Pos)
#define USBC_UPCON6CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON6CLR) RXTALLDE Clear */
#define USBC_UPCON6CLR_RXSTALLDEC   (0x1u << USBC_UPCON6CLR_RXSTALLDEC_Pos)
#define USBC_UPCON6CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON6CLR) RAMACERE Clear */
#define USBC_UPCON6CLR_RAMACEREC    (0x1u << USBC_UPCON6CLR_RAMACEREC_Pos)
#define USBC_UPCON6CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON6CLR) NBUSYBKE Clear */
#define USBC_UPCON6CLR_NBUSYBKEC    (0x1u << USBC_UPCON6CLR_NBUSYBKEC_Pos)
#define USBC_UPCON6CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON6CLR) FIFOCON Clear */
#define USBC_UPCON6CLR_FIFOCONC     (0x1u << USBC_UPCON6CLR_FIFOCONC_Pos)
#define USBC_UPCON6CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON6CLR) PFREEZE Clear */
#define USBC_UPCON6CLR_PFREEZEC     (0x1u << USBC_UPCON6CLR_PFREEZEC_Pos)
#define USBC_UPCON6CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON6CLR) INITDTGL Clear */
#define USBC_UPCON6CLR_INITDTGLC    (0x1u << USBC_UPCON6CLR_INITDTGLC_Pos)
#define USBC_UPCON6CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON6CLR) INITBK Clear */
#define USBC_UPCON6CLR_INITBKC      (0x1u << USBC_UPCON6CLR_INITBKC_Pos)
#define USBC_UPCON6CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON6CLR) MASK Register */

