Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usbc.h
/* -------- USBC_UPCON7CLR : (USBC Offset: 0x63C) ( /W 32) Pipe Control Clear Register -------- */
#define USBC_UPCON7CLR_OFFSET       0x63C        /**< \brief (USBC_UPCON7CLR offset) Pipe Control Clear Register */
#define USBC_UPCON7CLR_RESETVALUE   0x00000000   /**< \brief (USBC_UPCON7CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON7CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON7CLR) RXINE Clear */
#define USBC_UPCON7CLR_RXINEC       (0x1u << USBC_UPCON7CLR_RXINEC_Pos)
#define USBC_UPCON7CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON7CLR) TXOUTE Clear */
#define USBC_UPCON7CLR_TXOUTEC      (0x1u << USBC_UPCON7CLR_TXOUTEC_Pos)
#define USBC_UPCON7CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON7CLR) TXSTPE Clear */
#define USBC_UPCON7CLR_TXSTPEC      (0x1u << USBC_UPCON7CLR_TXSTPEC_Pos)
#define USBC_UPCON7CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON7CLR) PERRE Clear */
#define USBC_UPCON7CLR_PERREC       (0x1u << USBC_UPCON7CLR_PERREC_Pos)
#define USBC_UPCON7CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON7CLR) NAKEDE Clear */
#define USBC_UPCON7CLR_NAKEDEC      (0x1u << USBC_UPCON7CLR_NAKEDEC_Pos)
#define USBC_UPCON7CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON7CLR) ERRORFIE Clear */
#define USBC_UPCON7CLR_ERRORFIEC    (0x1u << USBC_UPCON7CLR_ERRORFIEC_Pos)
#define USBC_UPCON7CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON7CLR) RXTALLDE Clear */
#define USBC_UPCON7CLR_RXSTALLDEC   (0x1u << USBC_UPCON7CLR_RXSTALLDEC_Pos)
#define USBC_UPCON7CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON7CLR) RAMACERE Clear */
#define USBC_UPCON7CLR_RAMACEREC    (0x1u << USBC_UPCON7CLR_RAMACEREC_Pos)
#define USBC_UPCON7CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON7CLR) NBUSYBKE Clear */
#define USBC_UPCON7CLR_NBUSYBKEC    (0x1u << USBC_UPCON7CLR_NBUSYBKEC_Pos)
#define USBC_UPCON7CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON7CLR) FIFOCON Clear */
#define USBC_UPCON7CLR_FIFOCONC     (0x1u << USBC_UPCON7CLR_FIFOCONC_Pos)
#define USBC_UPCON7CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON7CLR) PFREEZE Clear */
#define USBC_UPCON7CLR_PFREEZEC     (0x1u << USBC_UPCON7CLR_PFREEZEC_Pos)
#define USBC_UPCON7CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON7CLR) INITDTGL Clear */
#define USBC_UPCON7CLR_INITDTGLC    (0x1u << USBC_UPCON7CLR_INITDTGLC_Pos)
#define USBC_UPCON7CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON7CLR) INITBK Clear */
#define USBC_UPCON7CLR_INITBKC      (0x1u << USBC_UPCON7CLR_INITBKC_Pos)
#define USBC_UPCON7CLR_MASK         0x000E547Fu  /**< \brief (USBC_UPCON7CLR) MASK Register */

/* -------- USBC_UPINRQ0 : (USBC Offset: 0x650) (R/W 32) Pipe In Request -------- */
#define USBC_UPINRQ0_OFFSET         0x650        /**< \brief (USBC_UPINRQ0 offset) Pipe In Request */
#define USBC_UPINRQ0_RESETVALUE     0x00000001   /**< \brief (USBC_UPINRQ0 reset_value) Pipe In Request */

#define USBC_UPINRQ0_INRQ_Pos       0            /**< \brief (USBC_UPINRQ0) IN Request Number before Freeze */
#define USBC_UPINRQ0_INRQ_Msk       (0xFFu << USBC_UPINRQ0_INRQ_Pos)
#define USBC_UPINRQ0_INRQ(value)    ((USBC_UPINRQ0_INRQ_Msk & ((value) << USBC_UPINRQ0_INRQ_Pos)))
#define USBC_UPINRQ0_INMODE_Pos     8            /**< \brief (USBC_UPINRQ0) IN Request Mode */
#define USBC_UPINRQ0_INMODE         (0x1u << USBC_UPINRQ0_INMODE_Pos)
#define USBC_UPINRQ0_MASK           0x000001FFu  /**< \brief (USBC_UPINRQ0) MASK Register */

/* -------- USBC_UPINRQ1 : (USBC Offset: 0x654) (R/W 32) Pipe In Request -------- */
#define USBC_UPINRQ1_OFFSET         0x654        /**< \brief (USBC_UPINRQ1 offset) Pipe In Request */
#define USBC_UPINRQ1_RESETVALUE     0x00000001   /**< \brief (USBC_UPINRQ1 reset_value) Pipe In Request */

#define USBC_UPINRQ1_INRQ_Pos       0            /**< \brief (USBC_UPINRQ1) IN Request Number before Freeze */
#define USBC_UPINRQ1_INRQ_Msk       (0xFFu << USBC_UPINRQ1_INRQ_Pos)
#define USBC_UPINRQ1_INRQ(value)    ((USBC_UPINRQ1_INRQ_Msk & ((value) << USBC_UPINRQ1_INRQ_Pos)))
#define USBC_UPINRQ1_INMODE_Pos     8            /**< \brief (USBC_UPINRQ1) IN Request Mode */
#define USBC_UPINRQ1_INMODE         (0x1u << USBC_UPINRQ1_INMODE_Pos)
#define USBC_UPINRQ1_MASK           0x000001FFu  /**< \brief (USBC_UPINRQ1) MASK Register */

/* -------- USBC_UPINRQ2 : (USBC Offset: 0x658) (R/W 32) Pipe In Request -------- */
#define USBC_UPINRQ2_OFFSET         0x658        /**< \brief (USBC_UPINRQ2 offset) Pipe In Request */
#define USBC_UPINRQ2_RESETVALUE     0x00000001   /**< \brief (USBC_UPINRQ2 reset_value) Pipe In Request */

#define USBC_UPINRQ2_INRQ_Pos       0            /**< \brief (USBC_UPINRQ2) IN Request Number before Freeze */
#define USBC_UPINRQ2_INRQ_Msk       (0xFFu << USBC_UPINRQ2_INRQ_Pos)
#define USBC_UPINRQ2_INRQ(value)    ((USBC_UPINRQ2_INRQ_Msk & ((value) << USBC_UPINRQ2_INRQ_Pos)))
#define USBC_UPINRQ2_INMODE_Pos     8            /**< \brief (USBC_UPINRQ2) IN Request Mode */
#define USBC_UPINRQ2_INMODE         (0x1u << USBC_UPINRQ2_INMODE_Pos)
#define USBC_UPINRQ2_MASK           0x000001FFu  /**< \brief (USBC_UPINRQ2) MASK Register */

/* -------- USBC_UPINRQ3 : (USBC Offset: 0x65C) (R/W 32) Pipe In Request -------- */
#define USBC_UPINRQ3_OFFSET         0x65C        /**< \brief (USBC_UPINRQ3 offset) Pipe In Request */
#define USBC_UPINRQ3_RESETVALUE     0x00000001   /**< \brief (USBC_UPINRQ3 reset_value) Pipe In Request */

#define USBC_UPINRQ3_INRQ_Pos       0            /**< \brief (USBC_UPINRQ3) IN Request Number before Freeze */
#define USBC_UPINRQ3_INRQ_Msk       (0xFFu << USBC_UPINRQ3_INRQ_Pos)
#define USBC_UPINRQ3_INRQ(value)    ((USBC_UPINRQ3_INRQ_Msk & ((value) << USBC_UPINRQ3_INRQ_Pos)))
#define USBC_UPINRQ3_INMODE_Pos     8            /**< \brief (USBC_UPINRQ3) IN Request Mode */
#define USBC_UPINRQ3_INMODE         (0x1u << USBC_UPINRQ3_INMODE_Pos)
#define USBC_UPINRQ3_MASK           0x000001FFu  /**< \brief (USBC_UPINRQ3) MASK Register */

/* -------- USBC_UPINRQ4 : (USBC Offset: 0x660) (R/W 32) Pipe In Request -------- */
#define USBC_UPINRQ4_OFFSET         0x660        /**< \brief (USBC_UPINRQ4 offset) Pipe In Request */
#define USBC_UPINRQ4_RESETVALUE     0x00000001   /**< \brief (USBC_UPINRQ4 reset_value) Pipe In Request */

